// subject.h
// Generated on TIMESTAMP by decompiling from_pouet.net/with_source_303/ia32_com/subject.exe
// using Decompiler version VERSION

/*
// Equivalence classes ////////////
Eq_1: (struct "Globals" (FFFA0020 (ptr Eq_71) ptrFFFA0020))
	globals_t (in globals : (ptr (struct "Globals")))
Eq_2: (fn void (byte))
	T_2 (in bios_video_set_mode : ptr32)
	T_3 (in signature of bios_video_set_mode : void)
Eq_7: (fn void (word16, word16))
	T_7 (in msmouse_define_horizontal_range : ptr32)
	T_8 (in signature of msmouse_define_horizontal_range : void)
Eq_24: (segment "Eq_24" (0 byte b0000) (21F Eq_81 t021F) (300 word16 w0300) (3EC word16 w03EC) (400 Eq_91 t0400) (402 uint16 w0402) (404 (arr word16) a0404) (42C (arr word16) a042C) (42E (arr word16) a042E))
	T_24 (in es : (ptr Eq_24))
	T_67 (in ds : (ptr Eq_24))
	T_143 (in es : (ptr Eq_24))
Eq_48: (fn byte (word16))
	T_48 (in __inb : ptr32)
Eq_60: (struct "Eq_60" 0002 (FFFFFFFE word16 wFFFFFFFE) (0 word16 w0000))
	T_60 (in si_147 : (memptr (ptr Eq_24) Eq_60))
	T_61 (in 0x042E : word16)
	T_76 (in si_147 + 0x0002 : word16)
Eq_71: (segment "Eq_71" (0 (arr word16) a0000))
	T_71 (in 0xA002 : selector)
Eq_81: (union "Eq_81" (byte u0) (word16 u1))
	T_81 (in al_160 : Eq_81)
	T_82 (in (byte) ax_159 : byte)
	T_100 (in cl_195 : Eq_81)
	T_101 (in (byte) cx_173 : byte)
	T_112 (in Mem182[ds:si_171 + 0x0000:byte] : byte)
	T_115 (in bl_184 : Eq_81)
	T_118 (in Mem182[ds:si_171 + 0x0000:byte] : byte)
	T_121 (in Mem187[ds:si_171 + 0x0001:byte] : byte)

  OrigDataType: bool
T_283: (in 0x0300 : word16)
  Class: Eq_25
  DataType: (memptr (ptr Eq_24) word16)
  OrigDataType: word16
T_284: (in 0x89 : byte)
  Class: Eq_284
  DataType: byte
  OrigDataType: byte
T_285: (in DPB(cx_111, 0x89, 0, 8) : word16)
  Class: Eq_18
  DataType: word16
  OrigDataType: word16
T_286: (in C : byte)
  Class: Eq_286
  DataType: byte
  OrigDataType: byte
T_287: (in cx_18 : word16)
  Class: Eq_287
  DataType: word16
  OrigDataType: word16
T_288: (in 0x0008 : word16)
  Class: Eq_287
  DataType: word16
  OrigDataType: word16
T_289: (in 0x00000001 : word32)
  Class: Eq_289
  DataType: uint32
  OrigDataType: uint32
T_290: (in ebx >>u 0x00000001 : word32)
  Class: Eq_141
  DataType: uint32
  OrigDataType: uint32
T_291: (in 0x00000000 : word32)
  Class: Eq_141
  DataType: uint32
  OrigDataType: up32
T_292: (in ebx <u 0x00000000 : bool)
  Class: Eq_292
  DataType: bool
  OrigDataType: bool
T_293: (in 0x0000 : word16)
  Class: Eq_293
  DataType: word16
  OrigDataType: word16
T_294: (in di + 0x0000 : word16)
  Class: Eq_294
  DataType: word16
  OrigDataType: word16
T_295: (in Mem27[es:di + 0x0000:byte] : byte)
  Class: Eq_292
  DataType: bool
  OrigDataType: byte
T_296: (in bx_23 : word16)
  Class: Eq_296
  DataType: word16
  OrigDataType: word16
T_297: (in (word16) ebx : word16)
  Class: Eq_296
  DataType: word16
  OrigDataType: word16
T_298: (in 0x0001 : word16)
  Class: Eq_298
  DataType: word16
  OrigDataType: word16
T_299: (in di + 0x0001 : word16)
  Class: Eq_142
  DataType: (memptr (ptr Eq_24) bool)
  OrigDataType: word16
T_300: (in 0x0001 : word16)
  Class: Eq_300
  DataType: word16
  OrigDataType: word16
T_301: (in cx_18 - 0x0001 : word16)
  Class: Eq_287
  DataType: word16
  OrigDataType: word16
T_302: (in 0x0000 : word16)
  Class: Eq_287
  DataType: word16
  OrigDataType: word16
T_303: (in cx_18 != 0x0000 : bool)
  Class: Eq_303
  DataType: bool
  OrigDataType: bool
T_304: (in 0x0138 : word16)
  Class: Eq_304
  DataType: word16
  OrigDataType: word16
T_305: (in di + 0x0138 : word16)
  Class: Eq_142
  DataType: (memptr (ptr Eq_24) bool)
  OrigDataType: word16
T_306: (in DPB(ebx, bx_23, 0, 16) : word32)
  Class: Eq_141
  DataType: uint32
  OrigDataType: word32
T_307: (in 0x0000 : word16)
  Class: Eq_296
  DataType: word16
  OrigDataType: word16
T_308: (in bx_23 != 0x0000 : bool)
  Class: Eq_308
  DataType: bool
  OrigDataType: bool
T_309: (in false : bool)
  Class: Eq_309
  DataType: bool
  OrigDataType: bool
T_310:
  Class: Eq_310
  DataType: word16
  OrigDataType: (struct 0002 (0 T_70 t0000))
T_311:
  Class: Eq_311
  DataType: word16
  OrigDataType: (struct 0002 (0 T_74 t0000))
T_312:
  Class: Eq_312
  DataType: word16
  OrigDataType: (struct 0002 (0 T_80 t0000))
T_313:
  Class: Eq_313
  DataType: word16
  OrigDataType: (struct 0002 (0 T_257 t0000))
*/
typedef Eq_71 Eq_1struct Globals {
	Eq_71 * ptrFFFA0020;	// FFFA0020
} Eq_1;

typedef void (Eq_2)(byte);

typedef void (Eq_7)(word16, word16);

typedef Eq_81 Eq_24Eq_91 Eq_24 Eq_24[][][]struct Eq_24 {
	byte b0000;	// 0
	Eq_81 t021F;	// 21F
	word16 w0300;	// 300
	word16 w03EC;	// 3EC
	Eq_91 t0400;	// 400
	uint16 w0402;	// 402
	word16 a0404[];	// 404
	word16 a042C[];	// 42C
	word16 a042E[];	// 42E
} Eq_24;

typedef byte (Eq_48)(word16);

typedef struct Eq_60 {	// size: 2 2
	word16 wFFFFFFFE;	// FFFFFFFE
	word16 w0000;	// 0
} Eq_60;

typedef  Eq_71[]struct Eq_71 {
	word16 a0000[];	// 0
} Eq_71;

typedef union Eq_81 {
	byte u0;
	word16 u1;
} Eq_81;

typedef Eq_81 Eq_91Eq_81 Eq_91struct Eq_91 {	// size: 1 1
	Eq_81 t0000;	// 0
	Eq_81 t0001;	// 1
} Eq_91;

typedef void (Eq_125)(byte);

typedef bool (Eq_139)(uint32, bool Eq_24::*, Eq_24 *);

typedef uint16 (Eq_254)(word16, byte);

typedef word16 (Eq_271)(word16, byte);

