// subject.h
// Generated on TIMESTAMP by decompiling from_pouet.net/with_source_240/ia32_com/subject.exe
// using Decompiler version VERSION

/*
// Equivalence classes ////////////
Eq_1: (struct "Globals" (FFFA0000 (ptr Eq_74) ptrFFFA0000) (400 (ptr Eq_49) ptr0400))
	globals_t (in globals : (ptr (struct "Globals")))
Eq_2: (fn void (byte))
	T_2 (in bios_video_set_mode : ptr32)
	T_3 (in signature of bios_video_set_mode : void)
Eq_17: (segment "Eq_17" (1FF int8 b01FF))
	T_17 (in ds : (ptr Eq_17))
Eq_49: (segment "Eq_49" (6C byte b006C))
	T_49 (in 0x0040 : selector)
Eq_62: (struct "Eq_62" (1EF byte b01EF))
	T_62 (in bx_79 & 0x003F : word16)
Eq_74: (segment "Eq_74" (FFFFA8C0 byte bFFFFA8C0) (FFFFAA00 byte bFFFFAA00) (FFFFF8C0 byte bFFFFF8C0) (0 (arr byte 320) a0000) (13F byte b013F) (A8C0 byte bA8C0) (AA00 byte bAA00) (F8C0 byte bF8C0))
	T_74 (in 0xA000 : selector)
Eq_142: (struct "Eq_142" 0001 (FFFFFFFD byte bFFFFFFFD) (FFFFFFFE byte bFFFFFFFE) (0 byte b0000))
	T_142 (in si_170 : (memptr (ptr Eq_74) Eq_142))
	T_164 (in si_170 + 0x0001 : word16)
	T_178 (in si_321 : (memptr (ptr Eq_74) Eq_142))
	T_180 (in si_321 + 0x0001 : word16)
	T_215 (in di_152 - 0x0140 : word16)
Eq_194: (struct "Eq_194" 0001 (0 byte b0000) (2 byte b0002) (3 byte b0003))
	T_194 (in si_312 : (memptr (ptr Eq_74) Eq_194))
	T_196 (in si_170 + 0x0136 : word16)
	T_197 (in si_322 : (memptr (ptr Eq_74) Eq_194))
	T_199 (in si_322 - 0x0001 : word16)
Eq_233: (fn bcu8 (byte))
	T_233 (in __inb : ptr32)

  DataType: word16
  OrigDataType: word16
T_280: (in di_248 - 0x0140 - 0x0001 : word16)
  Class: Eq_280
  DataType: word16
  OrigDataType: word16
T_281: (in di_248 - 0x0140 - 0x0001 + ax : word16)
  Class: Eq_254
  DataType: (memptr (ptr Eq_74) byte)
  OrigDataType: word16
T_282: (in __inb : ptr32)
  Class: Eq_282
  DataType: (ptr Eq_282)
  OrigDataType: (ptr (fn T_284 (T_283)))
T_283: (in 0x60 : byte)
  Class: Eq_283
  DataType: byte
  OrigDataType: byte
T_284: (in __inb(0x60) : byte)
  Class: Eq_284
  DataType: byte
  OrigDataType: byte
T_285: (in 0x01 : byte)
  Class: Eq_284
  DataType: byte
  OrigDataType: byte
T_286: (in __inb(0x60) != 0x01 : bool)
  Class: Eq_286
  DataType: bool
  OrigDataType: bool
T_287: (in 0x006C : word16)
  Class: Eq_287
  DataType: (memptr (ptr Eq_49) byte)
  OrigDataType: (memptr T_49 (struct (0 T_288 t0000)))
T_288: (in Mem34[0x0040:0x006C:byte] : byte)
  Class: Eq_48
  DataType: byte
  OrigDataType: byte
T_289: (in DPB(ax, ah_75, 8, 8) : word16)
  Class: Eq_231
  DataType: word16
  OrigDataType: word16
T_290: (in al_290 : byte)
  Class: Eq_290
  DataType: byte
  OrigDataType: byte
T_291: (in bios_kbd_get_keystroke : ptr32)
  Class: Eq_291
  DataType: (ptr Eq_291)
  OrigDataType: (ptr (fn T_295 (T_294)))
T_292: (in signature of bios_kbd_get_keystroke : void)
  Class: Eq_291
  DataType: (ptr Eq_291)
  OrigDataType: 
T_293: (in alOut : ptr16)
  Class: Eq_293
  DataType: (ptr byte)
  OrigDataType: ptr16
T_294: (in out al_290 : ptr16)
  Class: Eq_293
  DataType: (ptr byte)
  OrigDataType: (ptr byte)
T_295: (in bios_kbd_get_keystroke(out al_290) : byte)
  Class: Eq_295
  DataType: byte
  OrigDataType: byte
T_296: (in bl_294 : byte)
  Class: Eq_296
  DataType: byte
  OrigDataType: byte
T_297: (in ch_295 : byte)
  Class: Eq_297
  DataType: byte
  OrigDataType: byte
T_298: (in cl_296 : byte)
  Class: Eq_298
  DataType: byte
  OrigDataType: byte
T_299: (in bios_video_get_EGA_info : ptr32)
  Class: Eq_299
  DataType: (ptr Eq_299)
  OrigDataType: (ptr (fn T_307 (T_304, T_305, T_306)))
T_300: (in signature of bios_video_get_EGA_info : void)
  Class: Eq_299
  DataType: (ptr Eq_299)
  OrigDataType: 
T_301: (in blOut : ptr16)
  Class: Eq_301
  DataType: (ptr byte)
  OrigDataType: ptr16
T_302: (in chOut : ptr16)
  Class: Eq_302
  DataType: (ptr byte)
  OrigDataType: ptr16
T_303: (in clOut : ptr16)
  Class: Eq_303
  DataType: (ptr byte)
  OrigDataType: ptr16
T_304: (in out bl_294 : ptr16)
  Class: Eq_301
  DataType: (ptr byte)
  OrigDataType: (ptr byte)
T_305: (in out ch_295 : ptr16)
  Class: Eq_302
  DataType: (ptr byte)
  OrigDataType: (ptr byte)
T_306: (in out cl_296 : ptr16)
  Class: Eq_303
  DataType: (ptr byte)
  OrigDataType: (ptr byte)
T_307: (in bios_video_get_EGA_info(out bl_294, out ch_295, out cl_296) : byte)
  Class: Eq_307
  DataType: byte
  OrigDataType: byte
T_308:
  Class: Eq_308
  DataType: byte
  OrigDataType: (struct 0001 (0 T_221 t0000))
*/
typedef Eq_74 Eq_1Eq_49 Eq_1struct Globals {
	Eq_74 * ptrFFFA0000;	// FFFA0000
	Eq_49 * ptr0400;	// 400
} Eq_1;

typedef void (Eq_2)(byte);

typedef struct Eq_17 {
	int8 b01FF;	// 1FF
} Eq_17;

typedef struct Eq_49 {
	byte b006C;	// 6C
} Eq_49;

typedef struct Eq_62 {
	byte b01EF;	// 1EF
} Eq_62;

typedef  Eq_74[320]struct Eq_74 {
	byte bFFFFA8C0;	// FFFFA8C0
	byte bFFFFAA00;	// FFFFAA00
	byte bFFFFF8C0;	// FFFFF8C0
	byte a0000[320];	// 0
	byte b013F;	// 13F
	byte bA8C0;	// A8C0
	byte bAA00;	// AA00
	byte bF8C0;	// F8C0
} Eq_74;

typedef struct Eq_142 {	// size: 1 1
	byte bFFFFFFFD;	// FFFFFFFD
	byte bFFFFFFFE;	// FFFFFFFE
	byte b0000;	// 0
} Eq_142;

typedef struct Eq_194 {	// size: 1 1
	byte b0000;	// 0
	byte b0002;	// 2
	byte b0003;	// 3
} Eq_194;

typedef bcu8 (Eq_233)(byte);

typedef byte (Eq_270)(byte);

typedef byte (Eq_282)(byte);

typedef byte (Eq_291)(byte *);

typedef byte (Eq_299)(byte *, byte *, byte *);

