// subject.h
// Generated on TIMESTAMP by decompiling malware_via_email/malware_0801/ia32_pe/subject.exe
// using Decompiler version VERSION

/*
// Equivalence classes ////////////
Eq_1: (struct "Globals" (403000 up32 dw403000) (403004 word32 dw403004) (407024 Eq_25 t407024) (407028 word32 dw407028) (40702C up32 dw40702C) (407030 word32 dw407030) (407034 Eq_25 t407034) (407038 word32 dw407038) (40703C word32 dw40703C) (407040 word32 dw407040) (407044 word32 dw407044) (407048 (ptr Eq_112) ptr407048) (40704C (ptr code) ptr40704C))
	globals_t (in globals : (ptr (struct "Globals")))
Eq_25: (union "Eq_25" ((ptr Eq_1079) u0) (HANDLE u1) (HMODULE u2) (LPCSTR u3) (LPVOID u4) (SIZE_T u5))
	T_25 (in eax_18 : Eq_25)
	T_28 (in lpModuleName : LPCSTR)
	T_29 (in 0x00000000 : word32)
	T_30 (in GetModuleHandleA(0x00000000) : word32)
	T_31 (in dwArg04 : word32)
	T_42 (in 0x00000000 : word32)
	T_76 (in Mem181[0x00407034:word32] : word32)
	T_140 (in dwArg08 : Eq_25)
	T_162 (in hModule : HMODULE)
	T_164 (in dwArg04 : word32)
	T_168 (in dwArg04 : word32)
	T_181 (in eax_33 : Eq_25)
	T_184 (in lpAddress : LPVOID)
	T_185 (in dwSize : SIZE_T)
	T_188 (in 0x00000000 : word32)
	T_191 (in Mem0[edx_16 + 0x00000050:word32] : word32)
	T_194 (in VirtualAlloc(0x00000000, edx_16->t0050, 0x00003000, 0x00000040) : word32)
	T_195 (in 0x00000000 : word32)
	T_215 (in Mem124[fp - 0x0000005C:word32] : word32)
	T_218 (in dwArg04 : Eq_25)
	T_219 (in dwArg08 : Eq_25)
	T_221 (in 0x00003000 : word32)

T_1054: (in ecx_26 : word32)
  Class: Eq_1044
  DataType: word32
  OrigDataType: word32
T_1055: (in 0x0000007F : word32)
  Class: Eq_1055
  DataType: word32
  OrigDataType: word32
T_1056: (in ecx_16 & 0x0000007F : word32)
  Class: Eq_1056
  DataType: word32
  OrigDataType: word32
T_1057: (in 0x00000007 : word32)
  Class: Eq_1057
  DataType: word32
  OrigDataType: word32
T_1058: (in dwLoc08_12 << 0x00000007 : word32)
  Class: Eq_1058
  DataType: ui32
  OrigDataType: ui32
T_1059: (in ecx_16 & 0x0000007F | dwLoc08_12 << 0x00000007 : word32)
  Class: Eq_1044
  DataType: word32
  OrigDataType: word32
T_1060: (in edx_29 : word32)
  Class: Eq_1046
  DataType: word32
  OrigDataType: word32
T_1061: (in 0x00000001 : word32)
  Class: Eq_1061
  DataType: word32
  OrigDataType: word32
T_1062: (in dwLoc10_13 + 0x00000001 : word32)
  Class: Eq_1046
  DataType: word32
  OrigDataType: word32
T_1063: (in 0x00000001 : word32)
  Class: Eq_1063
  DataType: word32
  OrigDataType: word32
T_1064: (in dwArg08 + 0x00000001 : word32)
  Class: Eq_1049
  DataType: (ptr Eq_1049)
  OrigDataType: word32
T_1065: (in 0x00000080 : word32)
  Class: Eq_1065
  DataType: word32
  OrigDataType: word32
T_1066: (in ecx_16 & 0x00000080 : word32)
  Class: Eq_1066
  DataType: word32
  OrigDataType: word32
T_1067: (in 0x00000000 : word32)
  Class: Eq_1066
  DataType: word32
  OrigDataType: word32
T_1068: (in (ecx_16 & 0x00000080) != 0x00000000 : bool)
  Class: Eq_1068
  DataType: bool
  OrigDataType: bool
T_1069: (in dwArg04 : word32)
  Class: Eq_1069
  DataType: (ptr word32)
  OrigDataType: (ptr (struct (0 T_1072 t0000)))
T_1070: (in 0x00000000 : word32)
  Class: Eq_1070
  DataType: word32
  OrigDataType: word32
T_1071: (in dwArg04 + 0x00000000 : word32)
  Class: Eq_1071
  DataType: word32
  OrigDataType: word32
T_1072: (in Mem39[dwArg04 + 0x00000000:word32] : word32)
  Class: Eq_1044
  DataType: word32
  OrigDataType: word32
T_1073:
  Class: Eq_1073
  DataType: word16
  OrigDataType: (struct 0002 (0 T_437 t0000))
T_1074:
  Class: Eq_1073
  DataType: word16
  OrigDataType: (struct 0002 (0 T_449 t0000))
T_1075:
  Class: Eq_1073
  DataType: word16
  OrigDataType: (struct 0002 (0 T_462 t0000))
T_1076:
  Class: Eq_1076
  DataType: word16
  OrigDataType: (struct 0002 (0 T_924 t0000))
T_1077:
  Class: Eq_1076
  DataType: word16
  OrigDataType: (struct 0002 (0 T_938 t0000))
T_1078:
  Class: Eq_1076
  DataType: word16
  OrigDataType: (struct 0002 (0 T_953 t0000))
T_1079:
  Class: Eq_1079
  DataType: Eq_1079
  OrigDataType: 
T_1080:
  Class: Eq_1080
  DataType: int32
  OrigDataType: 
*/
typedef Eq_25 Eq_1Eq_25 Eq_1Eq_112 Eq_1code Eq_1struct Globals {
	up32 dw403000;	// 403000
	word32 dw403004;	// 403004
	Eq_25 t407024;	// 407024
	word32 dw407028;	// 407028
	up32 dw40702C;	// 40702C
	word32 dw407030;	// 407030
	Eq_25 t407034;	// 407034
	word32 dw407038;	// 407038
	word32 dw40703C;	// 40703C
	word32 dw407040;	// 407040
	word32 dw407044;	// 407044
	Eq_112 * ptr407048;	// 407048
	code * ptr40704C;	// 40704C
} Eq_1;

typedef union Eq_25 {
	Eq_1079* u0;
	 HANDLE u1;
	 HMODULE u2;
	 LPCSTR u3;
	 LPVOID u4;
	 SIZE_T u5;
} Eq_25;

typedef Eq_25 (Eq_26)(Eq_25);

typedef struct Eq_52 {
	word32 dwFFFFFF60;	// FFFFFF60
} Eq_52;

typedef code * (Eq_57)(word32, word32);

typedef word32 (Eq_61)(Eq_63);

typedef union Eq_63 {
	word32 u0;
	 LPCSTR u1;
} Eq_63;

typedef word32 (Eq_86)(word32);

typedef void (Eq_92)(ptr32, word32, up32);

typedef Eq_112 Eq_110struct Eq_110 {
	Eq_112 * ptr0018;	// 18
} Eq_110;

typedef union Eq_111 {
	ptr32 u0;
	Eq_112* Eq_110::* u1;
} Eq_111;

typedef Eq_813 Eq_112struct Eq_112 {
	Eq_813 * ptr0030;	// 30
} Eq_112;

typedef struct Eq_124 {
	word32 dw0008;	// 8
} Eq_124;

typedef struct Eq_131 {
	word32 dw0008;	// 8
} Eq_131;

typedef void (Eq_137)(word32, Eq_25);

typedef void (Eq_151)(word32, word32);

typedef code * (Eq_160)(Eq_25, Eq_163);

typedef union Eq_163 {
	word32 u0;
	 LPCSTR u1;
} Eq_163;

typedef Eq_300 Eq_167Eq_25 Eq_167struct Eq_167 {
	word16 w0006;	// 6
	word16 w0014;	// 14
	Eq_300 t003C;	// 3C
	Eq_25 t0050;	// 50
} Eq_167;

typedef Eq_173 Eq_173struct Eq_173 {	// size: 40 28
	word32 dw000C;	// C
	word32 dw0010;	// 10
	word32 dw0014;	// 14
	Eq_173 t0028;	// 28
} Eq_173;

typedef Eq_25 (Eq_182)(Eq_25, Eq_25, Eq_186, Eq_187);

typedef union Eq_186 {
	word32 u0;
	 DWORD u1;
} Eq_186;

typedef union Eq_187 {
	word32 u0;
	 DWORD u1;
} Eq_187;

typedef Eq_25 Eq_209Eq_25 Eq_209struct Eq_209 {
	Eq_25 tFFFFFF90;	// FFFFFF90
	word32 dwFFFFFF9C;	// FFFFFF9C
	Eq_25 tFFFFFFA4;	// FFFFFFA4
	word32 dwFFFFFFA8;	// FFFFFFA8
	word32 dwFFFFFFE4;	// FFFFFFE4
} Eq_209;

typedef void (Eq_216)(Eq_25, Eq_25, int32);

typedef union Eq_300 {
	int32 u0;
	uint32 u1;
} Eq_300;

typedef union Eq_321 {
	int32 u0;
	uint32 u1;
} Eq_321;

typedef Eq_327 Eq_327struct Eq_327 {	// size: 20 14
	word32 dw0000;	// 0
	word32 dw000C;	// C
	word32 dw0010;	// 10
	Eq_327 t0014;	// 14
} Eq_327;

typedef code Eq_336Eq_336 Eq_336struct Eq_336 {	// size: 4 4
	code * ptr0000;	// 0
	Eq_336 t0004;	// 4
} Eq_336;

typedef code Eq_337Eq_337 Eq_337struct Eq_337 {	// size: 4 4
	code * ptr0000;	// 0
	Eq_337 t0004;	// 4
} Eq_337;

typedef  Eq_398[]struct Eq_398 {
	word32 dw0000;	// 0
	word32 dw0004;	// 4
	word16 a0008[];	// 8
} Eq_398;

typedef Eq_25 Eq_553Eq_25 Eq_553Eq_25 Eq_553struct Eq_553 {
	Eq_25 tFFFFFFF8;	// FFFFFFF8
	Eq_25 tFFFFFFFC;	// FFFFFFFC
	Eq_25 t0000;	// 0
} Eq_553;

typedef word32 (Eq_559)(Eq_25);

typedef void (Eq_611)(Eq_25);

typedef void (Eq_629)(Eq_25, Eq_25);

typedef Eq_25 Eq_662Eq_25 Eq_662struct Eq_662 {
	Eq_25 tFFFFFFEC;	// FFFFFFEC
	word32 dwFFFFFFF0;	// FFFFFFF0
	word32 dwFFFFFFF4;	// FFFFFFF4
	word32 dwFFFFFFF8;	// FFFFFFF8
	word32 dwFFFFFFFC;	// FFFFFFFC
	Eq_25 t0000;	// 0
} Eq_662;

typedef Eq_25 Eq_693Eq_25 Eq_693struct Eq_693 {
	Eq_25 tFFFFFFEC;	// FFFFFFEC
	word32 dwFFFFFFF0;	// FFFFFFF0
	word32 dwFFFFFFF4;	// FFFFFFF4
	word32 dwFFFFFFF8;	// FFFFFFF8
	word32 dwFFFFFFFC;	// FFFFFFFC
	Eq_25 t0000;	// 0
} Eq_693;

typedef Eq_25 Eq_729Eq_25 Eq_729Eq_186 Eq_729Eq_187 Eq_729struct Eq_729 {
	Eq_25 tFFFFFFF4;	// FFFFFFF4
	Eq_25 tFFFFFFF8;	// FFFFFFF8
	Eq_186 tFFFFFFFC;	// FFFFFFFC
	Eq_187 t0000;	// 0
} Eq_729;

typedef Eq_25 Eq_768Eq_25 Eq_768Eq_186 Eq_768Eq_187 Eq_768struct Eq_768 {
	Eq_25 tFFFFFFF4;	// FFFFFFF4
	Eq_25 tFFFFFFF8;	// FFFFFFF8
	Eq_186 tFFFFFFFC;	// FFFFFFFC
	Eq_187 t0000;	// 0
} Eq_768;

typedef Eq_808 Eq_808struct Eq_808 {
	Eq_808 * ptr0000;	// 0
	word32 dw0018;	// 18
	word32 dw001C;	// 1C
} Eq_808;

typedef Eq_816 Eq_813struct Eq_813 {
	word32 dw0008;	// 8
	Eq_816 * ptr000C;	// C
} Eq_813;

typedef Eq_808 Eq_816struct Eq_816 {
	Eq_808 * ptr000C;	// C
} Eq_816;

typedef Eq_25 Eq_855struct Eq_855 {
	Eq_25 t0050;	// 50
	word32 dw00A0;	// A0
	word32 dw00A4;	// A4
} Eq_855;

typedef Eq_25 Eq_877Eq_25 Eq_877struct Eq_877 {
	Eq_25 tFFFFFFD4;	// FFFFFFD4
	Eq_25 tFFFFFFD8;	// FFFFFFD8
} Eq_877;

typedef  Eq_899[]struct Eq_899 {
	word32 dw0000;	// 0
	word32 dw0004;	// 4
	word16 a0008[];	// 8
} Eq_899;

typedef word32 (Eq_998)(word32, word32);

typedef Eq_1049 Eq_1049struct Eq_1049 {	// size: 1 1
	byte b0000;	// 0
	Eq_1049 t0001;	// 1
} Eq_1049;

typedef code Eq_1079Eq_25 Eq_1079Eq_25 Eq_1079struct Eq_1079 {
	code * ptr0028;	// 28
	Eq_25 t0034;	// 34
	word32 dw003C;	// 3C
	Eq_25 t0050;	// 50
	word32 dw0080;	// 80
	word32 dw00A0;	// A0
	word32 dw00A4;	// A4
} Eq_1079;

