// subject.h
// Generated on TIMESTAMP by decompiling malware_via_email/malware_0755/ia32_pe/subject.exe
// using Decompiler version VERSION

/*
// Equivalence classes ////////////
Eq_1: (struct "Globals" (402333 Eq_25 t402333) (402337 Eq_25 t402337) (406700 Eq_328 t406700) (406704 word32 dw406704) (406708 int32 dw406708) (40670C word32 dw40670C) (406710 word32 dw406710) (406714 word32 dw406714) (406718 Eq_25 t406718) (40671C (ptr Eq_196) ptr40671C) (406720 (ptr code) ptr406720))
	globals_t (in globals : (ptr (struct "Globals")))
Eq_25: (union "Eq_25" (up32 u0) (HANDLE u1) (HMODULE u2) (LPCSTR u3) (UINT u4))
	T_25 (in eax_18 : Eq_25)
	T_28 (in lpModuleName : LPCSTR)
	T_29 (in 0x00000000 : word32)
	T_30 (in GetModuleHandleA(0x00000000) : word32)
	T_41 (in uSize : UINT)
	T_45 (in 0x0000012C : word32)
	T_51 (in 0x004065B4 : word32)
	T_54 (in Mem39[fp - 0x00000164:word32] : word32)
	T_58 (in lpString2 : LPCSTR)
	T_61 (in 0x0000012C : word32)
	T_63 (in 0x00000000 : word32)
	T_66 (in Mem46[fp - 0x00000164:word32] : word32)
	T_75 (in hTemplateFile : HANDLE)
	T_89 (in 0x0000012C : word32)
	T_92 (in Mem112[fp - 0x00000164:word32] : word32)
	T_94 (in fp + 0xFFFFFEB4 : word32)
	T_97 (in Mem115[fp - 0x00000168:word32] : word32)
	T_104 (in 0x004065BC : word32)
	T_107 (in Mem122[fp - 0x00000164:word32] : word32)
	T_112 (in 0x00000000 : word32)
	T_115 (in Mem129[fp - 0x00000164:word32] : word32)
	T_145 (in eax_153 : Eq_25)
	T_147 (in Mem139[0x00402333:word32] : word32)

T_1004: (in Mem0[dwArg08 + 0x00000000:byte] : byte)
  Class: Eq_1004
  DataType: byte
  OrigDataType: byte
T_1005: (in (word32) dwArg08->b0000 : word32)
  Class: Eq_1000
  DataType: word32
  OrigDataType: word32
T_1006: (in edx_33 : word32)
  Class: Eq_996
  DataType: word32
  OrigDataType: word32
T_1007: (in 0x0000007F : word32)
  Class: Eq_1007
  DataType: word32
  OrigDataType: word32
T_1008: (in edx_23 & 0x0000007F : word32)
  Class: Eq_1008
  DataType: word32
  OrigDataType: word32
T_1009: (in 0x00000007 : word32)
  Class: Eq_1009
  DataType: word32
  OrigDataType: word32
T_1010: (in dwLoc08_19 << 0x00000007 : word32)
  Class: Eq_1010
  DataType: ui32
  OrigDataType: ui32
T_1011: (in edx_23 & 0x0000007F | dwLoc08_19 << 0x00000007 : word32)
  Class: Eq_996
  DataType: word32
  OrigDataType: word32
T_1012: (in eax_36 : word32)
  Class: Eq_998
  DataType: word32
  OrigDataType: word32
T_1013: (in 0x00000001 : word32)
  Class: Eq_1013
  DataType: word32
  OrigDataType: word32
T_1014: (in dwLoc10_20 + 0x00000001 : word32)
  Class: Eq_998
  DataType: word32
  OrigDataType: word32
T_1015: (in 0x00000001 : word32)
  Class: Eq_1015
  DataType: word32
  OrigDataType: word32
T_1016: (in dwArg08 + 0x00000001 : word32)
  Class: Eq_1001
  DataType: (ptr Eq_1001)
  OrigDataType: word32
T_1017: (in 0x00000080 : word32)
  Class: Eq_1017
  DataType: word32
  OrigDataType: word32
T_1018: (in edx_23 & 0x00000080 : word32)
  Class: Eq_1018
  DataType: word32
  OrigDataType: word32
T_1019: (in 0x00000000 : word32)
  Class: Eq_1018
  DataType: word32
  OrigDataType: word32
T_1020: (in (edx_23 & 0x00000080) != 0x00000000 : bool)
  Class: Eq_1020
  DataType: bool
  OrigDataType: bool
T_1021: (in dwArg04 : word32)
  Class: Eq_1021
  DataType: (ptr word32)
  OrigDataType: (ptr (struct (0 T_1024 t0000)))
T_1022: (in 0x00000000 : word32)
  Class: Eq_1022
  DataType: word32
  OrigDataType: word32
T_1023: (in dwArg04 + 0x00000000 : word32)
  Class: Eq_1023
  DataType: word32
  OrigDataType: word32
T_1024: (in Mem46[dwArg04 + 0x00000000:word32] : word32)
  Class: Eq_996
  DataType: word32
  OrigDataType: word32
T_1025:
  Class: Eq_1025
  DataType: word16
  OrigDataType: (struct 0002 (0 T_865 t0000))
T_1026:
  Class: Eq_1025
  DataType: word16
  OrigDataType: (struct 0002 (0 T_879 t0000))
T_1027:
  Class: Eq_1025
  DataType: word16
  OrigDataType: (struct 0002 (0 T_894 t0000))
T_1028:
  Class: Eq_1028
  DataType: int32
  OrigDataType: 
T_1029:
  Class: Eq_1029
  DataType: int32
  OrigDataType: 
T_1030:
  Class: Eq_1030
  DataType: Eq_1030
  OrigDataType: 
T_1031:
  Class: Eq_1031
  DataType: Eq_1031
  OrigDataType: 
*/
typedef Eq_25 Eq_1Eq_25 Eq_1Eq_328 Eq_1Eq_25 Eq_1Eq_196 Eq_1code Eq_1struct Globals {
	Eq_25 t402333;	// 402333
	Eq_25 t402337;	// 402337
	Eq_328 t406700;	// 406700
	word32 dw406704;	// 406704
	int32 dw406708;	// 406708
	word32 dw40670C;	// 40670C
	word32 dw406710;	// 406710
	word32 dw406714;	// 406714
	Eq_25 t406718;	// 406718
	Eq_196 * ptr40671C;	// 40671C
	code * ptr406720;	// 406720
} Eq_1;

typedef union Eq_25 {
	up32 u0;
	 HANDLE u1;
	 HMODULE u2;
	 LPCSTR u3;
	 UINT u4;
} Eq_25;

typedef Eq_25 (Eq_26)(Eq_25);

typedef word32 (Eq_31)(Eq_33, Eq_34);

typedef union Eq_33 {
	word32 u0;
	 HINSTANCE u1;
} Eq_33;

typedef union Eq_34 {
	word32 u0;
	 LPCSTR u1;
} Eq_34;

typedef word32 (Eq_38)(Eq_40, Eq_25);

typedef union Eq_40 {
	word32 u0;
	 LPSTR u1;
} Eq_40;

typedef Eq_25 Eq_42Eq_25 Eq_42struct Eq_42 {
	word32 dwFFFFFE88;	// FFFFFE88
	word32 dwFFFFFE8C;	// FFFFFE8C
	word32 dwFFFFFE90;	// FFFFFE90
	ptr32 ptrFFFFFE94;	// FFFFFE94
	Eq_25 tFFFFFE98;	// FFFFFE98
	Eq_25 tFFFFFE9C;	// FFFFFE9C
} Eq_42;

typedef word32 (Eq_55)(Eq_57, Eq_25);

typedef union Eq_57 {
	word32 u0;
	 LPSTR u1;
} Eq_57;

typedef word32 (Eq_67)(Eq_69, Eq_70, Eq_71, Eq_72, Eq_73, Eq_74, Eq_25);

typedef union Eq_69 {
	word32 u0;
	 LPCSTR u1;
} Eq_69;

typedef union Eq_70 {
	word32 u0;
	 DWORD u1;
} Eq_70;

typedef union Eq_71 {
	word32 u0;
	 DWORD u1;
} Eq_71;

typedef union Eq_72 {
	word32 u0;
	 LPSECURITY_ATTRIBUTES u1;
} Eq_72;

typedef union Eq_73 {
	word32 u0;
	 DWORD u1;
} Eq_73;

typedef union Eq_74 {
	word32 u0;
	 DWORD u1;
} Eq_74;

typedef void (Eq_86)();

typedef Eq_25 (Eq_157)(word32);

typedef void (Eq_176)(word32, word32, word32);

typedef Eq_196 Eq_194struct Eq_194 {
	Eq_196 * ptr0018;	// 18
} Eq_194;

typedef Eq_913 Eq_196struct Eq_196 {
	Eq_913 * ptr0030;	// 30
} Eq_196;

typedef void (Eq_212)(word32, word32);

typedef void (Eq_225)(word32, word32);

typedef struct Eq_241 {
	word32 dw0008;	// 8
} Eq_241;

typedef struct Eq_248 {
	word32 dw0008;	// 8
} Eq_248;

typedef code * (Eq_255)(Eq_25, Eq_258);

typedef union Eq_258 {
	word32 u0;
	 LPCSTR u1;
} Eq_258;

typedef word32 (Eq_266)(Eq_268, Eq_269);

typedef union Eq_268 {
	word32 u0;
	 LPSTR u1;
} Eq_268;

typedef union Eq_269 {
	word32 u0;
	 LPCSTR u1;
} Eq_269;

typedef Eq_402 Eq_322struct Eq_322 {
	word16 w0006;	// 6
	word16 w0014;	// 14
	Eq_402 t003C;	// 3C
} Eq_322;

typedef struct Eq_323 {
	word32 dw003C;	// 3C
} Eq_323;

typedef union Eq_328 {
	Eq_1031* u0;
	 DWORD u1;
	 HANDLE u2;
	 SIZE_T u3;
} Eq_328;

typedef struct Eq_336 {
	word32 dwFFFFFFE8;	// FFFFFFE8
} Eq_336;

typedef void (Eq_339)(Eq_328, Eq_323 *, Eq_328);

typedef Eq_377 Eq_377struct Eq_377 {	// size: 20 14
	word32 dw0000;	// 0
	word32 dw000C;	// C
	word32 dw0010;	// 10
	Eq_377 t0014;	// 14
} Eq_377;

typedef union Eq_402 {
	int32 u0;
	uint32 u1;
} Eq_402;

typedef union Eq_423 {
	int32 u0;
	uint32 u1;
} Eq_423;

typedef union Eq_429 {
	word32 u0;
	 DWORD u1;
	 LPCVOID u2;
	 LPVOID u3;
} Eq_429;

typedef Eq_429 Eq_433Eq_654 Eq_433Eq_429 Eq_433Eq_328 Eq_433Eq_429 Eq_433struct Eq_433 {
	Eq_429 tFFFFFFE0;	// FFFFFFE0
	Eq_654 tFFFFFFE4;	// FFFFFFE4
	Eq_429 tFFFFFFE8;	// FFFFFFE8
	Eq_328 tFFFFFFEC;	// FFFFFFEC
	word32 dwFFFFFFF0;	// FFFFFFF0
	word32 dwFFFFFFF4;	// FFFFFFF4
	word32 dwFFFFFFF8;	// FFFFFFF8
	word32 dwFFFFFFFC;	// FFFFFFFC
	Eq_429 t0000;	// 0
} Eq_433;

typedef Eq_466 Eq_466struct Eq_466 {	// size: 4 4
	word32 dw0000;	// 0
	Eq_466 t0004;	// 4
} Eq_466;

typedef Eq_467 Eq_467struct Eq_467 {	// size: 4 4
	word32 dw0000;	// 0
	Eq_467 t0004;	// 4
} Eq_467;

typedef Eq_328 Eq_518Eq_328 Eq_518Eq_328 Eq_518struct Eq_518 {
	Eq_328 tFFFFFFF8;	// FFFFFFF8
	Eq_328 tFFFFFFFC;	// FFFFFFFC
	Eq_328 t0000;	// 0
} Eq_518;

typedef word32 (Eq_524)(Eq_328);

typedef void (Eq_554)(Eq_328);

typedef word32 (Eq_580)(Eq_429);

typedef Eq_328 Eq_588Eq_609 Eq_588Eq_429 Eq_588Eq_328 Eq_588Eq_597 Eq_588Eq_429 Eq_588struct Eq_588 {
	Eq_328 tFFFFFFEC;	// FFFFFFEC
	Eq_609 tFFFFFFF0;	// FFFFFFF0
	Eq_429 tFFFFFFF4;	// FFFFFFF4
	Eq_328 tFFFFFFF8;	// FFFFFFF8
	Eq_597 tFFFFFFFC;	// FFFFFFFC
	Eq_429 t0000;	// 0
} Eq_588;

typedef union Eq_597 {
	word32 u0;
	 DWORD u1;
	 SIZE_T u2;
} Eq_597;

typedef union Eq_609 {
	word32 u0;
	 DWORD u1;
} Eq_609;

typedef Eq_328 (Eq_616)(Eq_328, Eq_609, Eq_429, Eq_328, Eq_597, Eq_429);

typedef union Eq_654 {
	word32 u0;
	 SIZE_T u1;
} Eq_654;

typedef word32 (Eq_666)(Eq_429, Eq_654, Eq_429);

typedef Eq_377 Eq_691struct Eq_691 {
	Eq_377 * ptrFFFFFFFC;	// FFFFFFFC
	word32 dw0000;	// 0
	word32 dw0004;	// 4
} Eq_691;

typedef word32 (Eq_706)(Eq_328, Eq_323 *);

typedef Eq_377 Eq_716struct Eq_716 {
	Eq_377 * ptrFFFFFFFC;	// FFFFFFFC
	word32 dw0000;	// 0
	word32 dw0004;	// 4
} Eq_716;

typedef Eq_328 (Eq_775)(Eq_429, Eq_328, Eq_597, Eq_429);

typedef  Eq_840[]struct Eq_840 {
	word32 dw0000;	// 0
	word32 dw0004;	// 4
	word16 a0008[];	// 8
} Eq_840;

typedef struct Eq_913 {
	word32 dw0008;	// 8
} Eq_913;

typedef word32 (Eq_945)(word32, word32);

typedef Eq_1001 Eq_1001struct Eq_1001 {	// size: 1 1
	byte b0000;	// 0
	Eq_1001 t0001;	// 1
} Eq_1001;

typedef DWORDLPVOIDBOOLstruct _SECURITY_ATTRIBUTES {
	DWORD;	// 0
	LPVOID;	// 4
	BOOL;	// 8
} Eq_1030;

typedef code Eq_1031Eq_429 Eq_1031Eq_328 Eq_1031struct Eq_1031 {	// size: 40 28
	word32 dw000C;	// C
	word32 dw0010;	// 10
	word32 dw0014;	// 14
	code * ptr0028;	// 28
	Eq_429 t0034;	// 34
	word32 dw003C;	// 3C
	Eq_328 t0050;	// 50
	word32 dw0080;	// 80
	word32 dw00A0;	// A0
	word32 dw00A4;	// A4
} Eq_1031;

