// subject.h
// Generated on TIMESTAMP by decompiling malware_via_email/malware_1193/ia32_pe/subject.exe
// using Decompiler version VERSION

/*
// Equivalence classes ////////////
Eq_1: (struct "Globals" (5200 Eq_180 t5200) (402001 (arr Eq_1175 2624) a402001) (4072E0 Eq_28 t4072E0) (4072E4 word32 dw4072E4) (4072E8 int32 dw4072E8) (4072EC word32 dw4072EC) (4072F0 Eq_28 t4072F0) (4072F4 (ptr Eq_232) ptr4072F4) (4072F8 word32 dw4072F8) (4072FC Eq_28 t4072FC) (407300 word32 dw407300) (407304 Eq_28 t407304) (407308 (ptr Eq_228) ptr407308) (407320 (ptr code) ptr407320) (407324 (ptr code) ptr407324) (407328 (ptr code) ptr407328) (40732C (ptr code) ptr40732C) (407330 (ptr code) ptr407330) (407334 (ptr code) ptr407334) (407338 (ptr code) ptr407338) (40733C (ptr code) ptr40733C))
	globals_t (in globals : (ptr (struct "Globals")))
Eq_28: (union "Eq_28" ((ptr Eq_1185) u0) (HANDLE u1) (LPCSTR u2) (PDWORD u3) (SIZE_T u4) (UINT u5))
	T_28 (in dwLoc18_20 : Eq_28)
	T_31 (in lpModuleName : LPCSTR)
	T_32 (in 0x00000000 : word32)
	T_33 (in GetModuleHandleA(0x00000000) : word32)
	T_44 (in dwArg04 : word32)
	T_46 (in Mem30[0x004072F0:word32] : word32)
	T_48 (in Mem30[0x004072F0:word32] : word32)
	T_60 (in Mem30[0x004072F0:word32] : word32)
	T_61 (in 0x00000000 : word32)
	T_70 (in 0x000000E6 : word32)
	T_74 (in Mem42[fp - 0x0000015C:word32] : word32)
	T_83 (in uSize : UINT)
	T_85 (in 0x00007F00 : word32)
	T_87 (in 0x00407290 : word32)
	T_90 (in Mem49[fp - 0x0000015C:word32] : word32)

  OrigDataType: word32
T_1160: (in 0x00000004 : word32)
  Class: Eq_1160
  DataType: word32
  OrigDataType: word32
T_1161: (in dwLoc0C_107 + 0x00000004 : word32)
  Class: Eq_1161
  DataType: word32
  OrigDataType: word32
T_1162: (in Mem32[dwLoc0C_107 + 0x00000004:word32] : word32)
  Class: Eq_1106
  DataType: word32
  OrigDataType: word32
T_1163: (in 0x00000000 : word32)
  Class: Eq_1106
  DataType: word32
  OrigDataType: word32
T_1164: (in dwLoc0C_107->dw0004 == 0x00000000 : bool)
  Class: Eq_1164
  DataType: bool
  OrigDataType: bool
T_1165: (in edx_7 : (ptr Eq_228))
  Class: Eq_228
  DataType: (ptr Eq_228)
  OrigDataType: (ptr (struct (30 T_1171 t0030)))
T_1166: (in 0x00407308 : ptr32)
  Class: Eq_1166
  DataType: (ptr (ptr Eq_228))
  OrigDataType: (ptr (struct (0 T_1167 t0000)))
T_1167: (in Mem0[0x00407308:word32] : word32)
  Class: Eq_228
  DataType: (ptr Eq_228)
  OrigDataType: word32
T_1168: (in dwArg04 : word32)
  Class: Eq_1168
  DataType: word32
  OrigDataType: word32
T_1169: (in 0x00000030 : word32)
  Class: Eq_1169
  DataType: word32
  OrigDataType: word32
T_1170: (in edx_7 + 0x00000030 : word32)
  Class: Eq_1170
  DataType: word32
  OrigDataType: word32
T_1171: (in Mem0[edx_7 + 0x00000030:word32] : word32)
  Class: Eq_1019
  DataType: (ptr Eq_1019)
  OrigDataType: (ptr (struct (8 T_1174 t0008)))
T_1172: (in 0x00000008 : word32)
  Class: Eq_1172
  DataType: word32
  OrigDataType: word32
T_1173: (in Mem0[edx_7 + 0x00000030:word32] + 0x00000008 : word32)
  Class: Eq_1173
  DataType: word32
  OrigDataType: word32
T_1174: (in Mem12[Mem0[edx_7 + 0x00000030:word32] + 0x00000008:word32] : word32)
  Class: Eq_1168
  DataType: word32
  OrigDataType: word32
T_1175:
  Class: Eq_1175
  DataType: Eq_1175
  OrigDataType: (struct 0008 (0 T_253 t0000))
T_1176:
  Class: Eq_1175
  DataType: Eq_1175
  OrigDataType: (struct 0008 (0 T_257 t0000))
T_1177:
  Class: Eq_1175
  DataType: Eq_1175
  OrigDataType: (struct 0008 (0 T_262 t0000))
T_1178:
  Class: Eq_1175
  DataType: Eq_1175
  OrigDataType: (struct 0008 (0 T_266 t0000))
T_1179:
  Class: Eq_1179
  DataType: word16
  OrigDataType: (struct 0002 (0 T_974 t0000))
T_1180:
  Class: Eq_1179
  DataType: word16
  OrigDataType: (struct 0002 (0 T_986 t0000))
T_1181:
  Class: Eq_1179
  DataType: word16
  OrigDataType: (struct 0002 (0 T_999 t0000))
T_1182:
  Class: Eq_1182
  DataType: word16
  OrigDataType: (struct 0002 (0 T_1123 t0000))
T_1183:
  Class: Eq_1182
  DataType: word16
  OrigDataType: (struct 0002 (0 T_1137 t0000))
T_1184:
  Class: Eq_1182
  DataType: word16
  OrigDataType: (struct 0002 (0 T_1152 t0000))
T_1185:
  Class: Eq_1185
  DataType: Eq_1185
  OrigDataType: 
T_1186:
  Class: Eq_1186
  DataType: int32
  OrigDataType: 
T_1187:
  Class: Eq_1187
  DataType: Eq_1187
  OrigDataType: 
T_1188:
  Class: Eq_1188
  DataType: int32
  OrigDataType: 
T_1189:
  Class: Eq_1189
  DataType: Eq_1189
  OrigDataType: 
*/
typedef Eq_180 Eq_1Eq_1175 Eq_1[2624]Eq_28Eq_28Eq_232Eq_28Eq_28Eq_228codecodecodecodecodecodecodecodestruct Globals {
	Eq_180 t5200;	// 5200
	Eq_1175 a402001[2624];	// 402001
	Eq_28 t4072E0;	// 4072E0
	word32 dw4072E4;	// 4072E4
	int32 dw4072E8;	// 4072E8
	word32 dw4072EC;	// 4072EC
	Eq_28 t4072F0;	// 4072F0
	Eq_232 * ptr4072F4;	// 4072F4
	word32 dw4072F8;	// 4072F8
	Eq_28 t4072FC;	// 4072FC
	word32 dw407300;	// 407300
	Eq_28 t407304;	// 407304
	Eq_228 * ptr407308;	// 407308
	code * ptr407320;	// 407320
	code * ptr407324;	// 407324
	code * ptr407328;	// 407328
	code * ptr40732C;	// 40732C
	code * ptr407330;	// 407330
	code * ptr407334;	// 407334
	code * ptr407338;	// 407338
	code * ptr40733C;	// 40733C
} Eq_1;

typedef union Eq_28 {
	Eq_1185* u0;
	 HANDLE u1;
	 LPCSTR u2;
	 PDWORD u3;
	 SIZE_T u4;
	 UINT u5;
} Eq_28;

typedef Eq_28 (Eq_29)(Eq_28);

typedef word32 (Eq_34)(Eq_36, Eq_37);

typedef union Eq_36 {
	word32 u0;
	 HINSTANCE u1;
} Eq_36;

typedef union Eq_37 {
	word32 u0;
	 LPCSTR u1;
} Eq_37;

typedef Eq_28 Eq_71Eq_76 Eq_71Eq_28 Eq_71struct Eq_71 {
	word32 dwFFFFFE90;	// FFFFFE90
	word32 dwFFFFFE94;	// FFFFFE94
	word32 dwFFFFFE98;	// FFFFFE98
	Eq_28 tFFFFFE9C;	// FFFFFE9C
	Eq_76 tFFFFFEA0;	// FFFFFEA0
	Eq_28 tFFFFFEA4;	// FFFFFEA4
} Eq_71;

typedef union Eq_76 {
	ptr32 u0;
	 DWORD u1;
	 LPSTR u2;
} Eq_76;

typedef word32 (Eq_80)(Eq_76, Eq_28);

typedef word32 (Eq_96)(Eq_76, Eq_28);

typedef word32 (Eq_109)(Eq_111, Eq_112, Eq_113, Eq_114, Eq_115, Eq_76, Eq_28);

typedef union Eq_111 {
	word32 u0;
	 LPCSTR u1;
} Eq_111;

typedef union Eq_112 {
	word32 u0;
	 DWORD u1;
} Eq_112;

typedef union Eq_113 {
	word32 u0;
	 DWORD u1;
} Eq_113;

typedef union Eq_114 {
	word32 u0;
	 LPSECURITY_ATTRIBUTES u1;
} Eq_114;

typedef union Eq_115 {
	word32 u0;
	 DWORD u1;
} Eq_115;

typedef Eq_180 Eq_180struct Eq_180 {	// size: 8 8
	Eq_180 t0008;	// 8
	word32 dw402001;	// 402001
} Eq_180;

typedef Eq_28 (Eq_188)(word32);

typedef word32 (Eq_208)(Eq_28, Eq_211 *, Eq_28);

typedef struct Eq_211 {
	word32 dw003C;	// 3C
} Eq_211;

typedef Eq_228 Eq_226struct Eq_226 {
	Eq_228 * ptr0018;	// 18
} Eq_226;

typedef Eq_1019 Eq_228struct Eq_228 {
	Eq_1019 * ptr0030;	// 30
} Eq_228;

typedef Eq_28 Eq_232struct Eq_232 {
	Eq_28 t0008;	// 8
} Eq_232;

typedef union Eq_243 {
	int32 u0;
	up32 u1;
} Eq_243;

typedef word32 (Eq_275)(word32, Eq_28);

typedef void (Eq_286)(word32, word32);

typedef code * (Eq_299)(Eq_28, Eq_211 *);

typedef word32 (Eq_324)(Eq_326, Eq_327);

typedef union Eq_326 {
	word32 u0;
	 HMODULE u1;
} Eq_326;

typedef union Eq_327 {
	word32 u0;
	 LPCSTR u1;
} Eq_327;

typedef Eq_28 (Eq_344)();

typedef struct Eq_350 {
	word32 dwFFFFFFEC;	// FFFFFFEC
} Eq_350;

typedef Eq_364 Eq_364struct Eq_364 {	// size: 40 28
	word32 dw000C;	// C
	word32 dw0010;	// 10
	word32 dw0014;	// 14
	Eq_364 t0028;	// 28
} Eq_364;

typedef union Eq_398 {
	int32 u0;
	uint32 u1;
} Eq_398;

typedef word32 (Eq_414)(Eq_28);

typedef union Eq_468 {
	int32 u0;
	uint32 u1;
} Eq_468;

typedef code Eq_488Eq_488 Eq_488struct Eq_488 {	// size: 4 4
	code * ptr0000;	// 0
	Eq_488 t0004;	// 4
} Eq_488;

typedef code Eq_489Eq_489 Eq_489struct Eq_489 {	// size: 4 4
	code * ptr0000;	// 0
	Eq_489 t0004;	// 4
} Eq_489;

typedef Eq_28 Eq_540Eq_28 Eq_540struct Eq_540 {
	Eq_28 tFFFFFFEC;	// FFFFFFEC
	word32 dwFFFFFFF0;	// FFFFFFF0
	word32 dwFFFFFFF4;	// FFFFFFF4
	word32 dwFFFFFFF8;	// FFFFFFF8
	word32 dwFFFFFFFC;	// FFFFFFFC
	Eq_28 t0000;	// 0
} Eq_540;

typedef Eq_28 Eq_602Eq_28 Eq_602struct Eq_602 {
	Eq_28 tFFFFFFF4;	// FFFFFFF4
	word32 dwFFFFFFF8;	// FFFFFFF8
	word32 dwFFFFFFFC;	// FFFFFFFC
	Eq_28 t0000;	// 0
} Eq_602;

typedef Eq_28 Eq_623struct Eq_623 {
	Eq_28 tFFFFFFFC;	// FFFFFFFC
	word32 dw0000;	// 0
	word32 dw0004;	// 4
} Eq_623;

typedef Eq_28 Eq_646struct Eq_646 {
	Eq_28 tFFFFFFFC;	// FFFFFFFC
	word32 dw0000;	// 0
	word32 dw0004;	// 4
} Eq_646;

typedef Eq_28 Eq_682Eq_28 Eq_682Eq_28 Eq_682struct Eq_682 {
	Eq_28 tFFFFFFF8;	// FFFFFFF8
	Eq_28 tFFFFFFFC;	// FFFFFFFC
	Eq_28 t0000;	// 0
} Eq_682;

typedef void (Eq_713)(Eq_28);

typedef Eq_28 Eq_762struct Eq_762 {
	Eq_28 tFFFFFFF4;	// FFFFFFF4
	word32 dwFFFFFFF8;	// FFFFFFF8
	word32 dwFFFFFFFC;	// FFFFFFFC
	word32 dw0000;	// 0
} Eq_762;

typedef Eq_28 Eq_786Eq_28 Eq_786Eq_28 Eq_786Eq_28 Eq_786struct Eq_786 {
	Eq_28 tFFFFFFDC;	// FFFFFFDC
	Eq_28 tFFFFFFE0;	// FFFFFFE0
	word32 dwFFFFFFE4;	// FFFFFFE4
	word32 dwFFFFFFE8;	// FFFFFFE8
	Eq_28 tFFFFFFEC;	// FFFFFFEC
	word32 dwFFFFFFF0;	// FFFFFFF0
	word32 dwFFFFFFF4;	// FFFFFFF4
	word32 dwFFFFFFF8;	// FFFFFFF8
	word32 dwFFFFFFFC;	// FFFFFFFC
	Eq_28 t0000;	// 0
} Eq_786;

typedef union Eq_855 {
	Eq_1189* u0;
	 LPVOID u1;
} Eq_855;

typedef Eq_855 Eq_870Eq_28 Eq_870Eq_878 Eq_870Eq_28 Eq_870struct Eq_870 {
	Eq_855 tFFFFFFF4;	// FFFFFFF4
	Eq_28 tFFFFFFF8;	// FFFFFFF8
	Eq_878 tFFFFFFFC;	// FFFFFFFC
	Eq_28 t0000;	// 0
} Eq_870;

typedef union Eq_878 {
	word32 u0;
	 DWORD u1;
} Eq_878;

typedef word32 (Eq_889)(Eq_855, Eq_28, Eq_878, Eq_28);

typedef void (Eq_943)(Eq_28, Eq_211 *, Eq_28);

typedef  Eq_949[]struct Eq_949 {
	word32 dw0000;	// 0
	word32 dw0004;	// 4
	word16 a0008[];	// 8
} Eq_949;

typedef Eq_1014 Eq_1014struct Eq_1014 {
	Eq_1014 * ptr0000;	// 0
	word32 dw0018;	// 18
	word32 dw001C;	// 1C
} Eq_1014;

typedef Eq_1022 Eq_1019struct Eq_1019 {
	word32 dw0008;	// 8
	Eq_1022 * ptr000C;	// C
} Eq_1019;

typedef Eq_1014 Eq_1022struct Eq_1022 {
	Eq_1014 * ptr000C;	// C
} Eq_1022;

typedef word32 (Eq_1053)(Eq_1055, Eq_1056, Eq_1057);

typedef union Eq_1055 {
	word32 u0;
	 HANDLE u1;
} Eq_1055;

typedef union Eq_1056 {
	word32 u0;
	 DWORD u1;
} Eq_1056;

typedef union Eq_1057 {
	word32 u0;
	 SIZE_T u1;
} Eq_1057;

typedef Eq_1055 (Eq_1058)();

typedef  Eq_1098[]struct Eq_1098 {
	word32 dw0000;	// 0
	word32 dw0004;	// 4
	word16 a0008[];	// 8
} Eq_1098;

typedef struct Eq_1175 {	// size: 8 8
	word32 dw0000;	// 0
} Eq_1175;

typedef code Eq_1185Eq_28 Eq_1185Eq_398 Eq_1185Eq_28 Eq_1185struct Eq_1185 {	// size: 20 14
	word32 dw0000;	// 0
	word16 w0006;	// 6
	word32 dw000C;	// C
	word32 dw0010;	// 10
	word16 w0014;	// 14
	word16 w0016;	// 16
	code * ptr0028;	// 28
	Eq_28 t0034;	// 34
	Eq_398 t003C;	// 3C
	Eq_28 t0050;	// 50
	word32 dw00A0;	// A0
	word32 dw00A4;	// A4
} Eq_1185;

typedef DWORDLPVOIDBOOLstruct _SECURITY_ATTRIBUTES {
	DWORD;	// 0
	LPVOID;	// 4
	BOOL;	// 8
} Eq_1187;

typedef code Eq_1189struct Eq_1189 {
	byte b0000;	// 0
	code * ptr0001;	// 1
	byte b0005;	// 5
} Eq_1189;

