// subject.h
// Generated on TIMESTAMP by decompiling from_pouet.net/with_source_291/ia32_com/subject.exe
// using Decompiler version VERSION

/*
// Equivalence classes ////////////
Eq_1: (struct "Globals" (FFFA0000 (ptr Eq_38) ptrFFFA0000))
	globals_t (in globals : (ptr (struct "Globals")))
Eq_2: (fn void (byte))
	T_2 (in bios_video_set_mode : ptr32)
	T_3 (in signature of bios_video_set_mode : void)
Eq_11: (fn void (word16, uint8))
	T_11 (in __outb : ptr32)
Eq_14: (union "Eq_14" (uint8 u0) (uint16 u1))
	T_14 (in al_12 : Eq_14)
	T_16 (in al_17 >>u 0x02 : word16)
Eq_17: (fn void (word16, Eq_14))
	T_17 (in __outb : ptr32)
Eq_22: (fn void (word16, byte))
	T_22 (in __outb : ptr32)
Eq_31: (fn void (word16, uint8))
	T_31 (in __outb : ptr32)
Eq_38: (segment "Eq_38" (0 (arr word16) a0000) (C0 (arr byte) a00C0) (188 word16 w0188) (1F6 Eq_80 t01F6) (1F8 int16 w01F8) (1FA word16 w01FA) (1FB word16 w01FB) (1FD word16 w01FD) (1FF (arr byte) a01FF) (200 (arr byte) a0200) (201 (arr byte) a0201) (340 (arr Eq_261) a0340))
	T_38 (in ds : (ptr Eq_38))
	T_43 (in Mem48[ss:fp - 0x0002:word16] : word16)
	T_139 (in 0xA000 : selector)
Eq_39: (segment "Eq_39")
	T_39 (in ss : selector)
Eq_40: (union "Eq_40" (ptr16 u0) ((memptr (ptr Eq_39) Eq_265) u1))
	T_40 (in fp : ptr16)
Eq_65: (fn Eq_113 (real64))
	T_65 (in cos : ptr32)
Eq_66: (fn real64 (real64))
	T_66 (in sqrt : ptr32)
Eq_67: (fn real64 (real64))
	T_67 (in sqrt : ptr32)
Eq_75: (fn real64 (real64))
	T_75 (in sin : ptr32)

  Class: Eq_235
  DataType: (ptr Eq_235)
  OrigDataType: (ptr (fn T_239 (T_238)))
T_236: (in signature of bios_kbd_check_keystroke : void)
  Class: Eq_235
  DataType: (ptr Eq_235)
  OrigDataType: 
T_237: (in alOut : ptr16)
  Class: Eq_237
  DataType: (ptr byte)
  OrigDataType: ptr16
T_238: (in out al_184 : ptr16)
  Class: Eq_237
  DataType: (ptr byte)
  OrigDataType: (ptr byte)
T_239: (in bios_kbd_check_keystroke(out al_184) : byte)
  Class: Eq_239
  DataType: byte
  OrigDataType: byte
T_240: (in 0x0000 : word16)
  Class: Eq_240
  DataType: word16
  OrigDataType: word16
T_241: (in 0x0000 : word16)
  Class: Eq_240
  DataType: word16
  OrigDataType: word16
T_242: (in 0x0000 == 0x0000 : bool)
  Class: Eq_242
  DataType: bool
  OrigDataType: bool
T_243: (in 0x0000 : word16)
  Class: Eq_243
  DataType: word16
  OrigDataType: word16
T_244: (in si_169 + 0x0000 : word16)
  Class: Eq_244
  DataType: word16
  OrigDataType: word16
T_245: (in Mem157[ds:si_169 + 0x0000:word16] : word16)
  Class: Eq_245
  DataType: word16
  OrigDataType: word16
T_246: (in 0x0000 : word16)
  Class: Eq_246
  DataType: word16
  OrigDataType: word16
T_247: (in di_170 + 0x0000 : word16)
  Class: Eq_247
  DataType: word16
  OrigDataType: word16
T_248: (in Mem180[0xA000:di_170 + 0x0000:word16] : word16)
  Class: Eq_245
  DataType: word16
  OrigDataType: word16
T_249: (in 0x0002 : word16)
  Class: Eq_249
  DataType: word16
  OrigDataType: word16
T_250: (in si_169 + 0x0002 : word16)
  Class: Eq_228
  DataType: (memptr (ptr Eq_38) word16)
  OrigDataType: word16
T_251: (in 0x0002 : word16)
  Class: Eq_251
  DataType: word16
  OrigDataType: word16
T_252: (in di_170 + 0x0002 : word16)
  Class: Eq_230
  DataType: (memptr (ptr Eq_38) word16)
  OrigDataType: word16
T_253: (in 0x0001 : word16)
  Class: Eq_253
  DataType: word16
  OrigDataType: word16
T_254: (in cx_175 - 0x0001 : word16)
  Class: Eq_232
  DataType: word16
  OrigDataType: word16
T_255: (in 0x0000 : word16)
  Class: Eq_232
  DataType: word16
  OrigDataType: word16
T_256: (in cx_175 == 0x0000 : bool)
  Class: Eq_256
  DataType: bool
  OrigDataType: bool
T_257:
  Class: Eq_257
  DataType: byte
  OrigDataType: (struct 0001 (0 T_185 t0000))
T_258:
  Class: Eq_258
  DataType: byte
  OrigDataType: (struct 0001 (0 T_191 t0000))
T_259:
  Class: Eq_259
  DataType: byte
  OrigDataType: (struct 0001 (0 T_196 t0000))
T_260:
  Class: Eq_260
  DataType: byte
  OrigDataType: (struct 0001 (0 T_201 t0000))
T_261:
  Class: Eq_261
  DataType: Eq_261
  OrigDataType: (struct 0001 (0 T_206 t0000))
T_262:
  Class: Eq_257
  DataType: byte
  OrigDataType: (struct 0001 (0 T_214 t0000))
T_263:
  Class: Eq_261
  DataType: Eq_261
  OrigDataType: (struct 0002 (0 word16 w0000))
T_264:
  Class: Eq_264
  DataType: word16
  OrigDataType: (struct 0002 (0 T_248 t0000))
T_265:
  Class: Eq_265
  DataType: Eq_265
  OrigDataType: 
*/
typedef Eq_38 Eq_1struct Globals {
	Eq_38 * ptrFFFA0000;	// FFFA0000
} Eq_1;

typedef void (Eq_2)(byte);

typedef void (Eq_11)(word16, uint8);

typedef union Eq_14 {
	uint8 u0;
	uint16 u1;
} Eq_14;

typedef void (Eq_17)(word16, Eq_14);

typedef void (Eq_22)(word16, byte);

typedef void (Eq_31)(word16, uint8);

typedef  Eq_38[][]Eq_80[][][]Eq_261[]struct Eq_38 {
	word16 a0000[];	// 0
	byte a00C0[];	// C0
	word16 w0188;	// 188
	Eq_80 t01F6;	// 1F6
	int16 w01F8;	// 1F8
	word16 w01FA;	// 1FA
	word16 w01FB;	// 1FB
	word16 w01FD;	// 1FD
	byte a01FF[];	// 1FF
	byte a0200[];	// 200
	byte a0201[];	// 201
	Eq_261 a0340[];	// 340
} Eq_38;

typedef struct Eq_39 {
} Eq_39;

typedef union Eq_40 {
	ptr16 u0;
	Eq_265 Eq_39::* u1;
} Eq_40;

typedef Eq_113 (Eq_65)(real64);

typedef real64 (Eq_66)(real64);

typedef real64 (Eq_67)(real64);

typedef real64 (Eq_75)(real64);

typedef real64 (Eq_76)(real64, real64);

typedef real64 (Eq_78)(real16);

typedef union Eq_80 {
	int16 u0;
	byte u1;
} Eq_80;

typedef union Eq_81 {
	real16 u0;
	real64 u1;
} Eq_81;

typedef union Eq_84 {
	real16 u0;
	real64 u1;
} Eq_84;

typedef union Eq_90 {
	real16 u0;
	real64 u1;
} Eq_90;

typedef union Eq_93 {
	real16 u0;
	real64 u1;
} Eq_93;

typedef union Eq_94 {
	real16 u0;
	real64 u1;
} Eq_94;

typedef real64 (Eq_97)(real16);

typedef union Eq_100 {
	real16 u0;
	real64 u1;
} Eq_100;

typedef union Eq_103 {
	real16 u0;
	real64 u1;
} Eq_103;

typedef union Eq_110 {
	64 u0;
	real64 u1;
} Eq_110;

typedef union Eq_111 {
	64 u0;
	real64 u1;
} Eq_111;

typedef union Eq_113 {
	real16 u0;
	real64 u1;
} Eq_113;

typedef union Eq_116 {
	real16 u0;
	real64 u1;
} Eq_116;

typedef void (Eq_160)(byte, byte);

typedef void (Eq_163)(byte, byte);

typedef void (Eq_173)(byte, byte);

typedef void (Eq_176)(byte, byte);

typedef struct Eq_179 {	// size: 1 1
	byte bFFFFFEC0;	// FFFFFEC0
	byte bFFFFFFFF;	// FFFFFFFF
	byte b0000;	// 0
	byte b0001;	// 1
	byte b0140;	// 140
} Eq_179;

typedef byte (Eq_221)(word16);

typedef byte (Eq_235)(byte *);

typedef union Eq_261 {
	byte u0;
	word16 u1;
} Eq_261;

typedef Eq_38 Eq_265struct Eq_265 {
	Eq_38 * ptrFFFFFFFE;	// FFFFFFFE
} Eq_265;

