// subject.h
// Generated on TIMESTAMP by decompiling malware_via_email/malware_1188/ia32_pe/subject.exe
// using Decompiler version VERSION

/*
// Equivalence classes ////////////

T_1382: (in esp_1220 : word32)
  Class: Eq_1346
  DataType: (ptr Eq_1346)
  OrigDataType: word32
T_1383: (in 0x00000004 : word32)
  Class: Eq_1383
  DataType: word32
  OrigDataType: word32
T_1384: (in esp_1207 - 0x00000004 : word32)
  Class: Eq_1346
  DataType: (ptr Eq_1346)
  OrigDataType: word32
T_1385: (in 0x13EC27D9 : word32)
  Class: Eq_1324
  DataType: word32
  OrigDataType: word32
T_1386: (in 0x00000000 : word32)
  Class: Eq_1386
  DataType: word32
  OrigDataType: word32
T_1387: (in esp_1242 + 0x00000000 : word32)
  Class: Eq_1387
  DataType: word32
  OrigDataType: word32
T_1388: (in Mem1243[esp_1242 + 0x00000000:word32] : word32)
  Class: Eq_1324
  DataType: word32
  OrigDataType: word32
T_1389: (in PHI(edx_1213, edx_1227) : word32)
  Class: Eq_1373
  DataType: word32
  OrigDataType: word32
T_1390: (in edx_1227 : word32)
  Class: Eq_1373
  DataType: word32
  OrigDataType: word32
T_1391: (in edx_1225 : word32)
  Class: Eq_1373
  DataType: word32
  OrigDataType: word32
T_1392: (in 0x00409004 : ptr32)
  Class: Eq_1392
  DataType: (ptr Eq_1392)
  OrigDataType: (ptr (struct (0 T_1393 t0000)))
T_1393: (in Mem1209[0x00409004:word32] : word32)
  Class: Eq_1393
  DataType: word32
  OrigDataType: word32
T_1394: (in esi_1226 : word32)
  Class: Eq_1393
  DataType: word32
  OrigDataType: word32
T_1395: (in 0x00000006 : word32)
  Class: Eq_1395
  DataType: word32
  OrigDataType: word32
T_1396: (in edx_1225 - 0x00000006 : word32)
  Class: Eq_1373
  DataType: word32
  OrigDataType: word32
T_1397: (in 0x00409004 : ptr32)
  Class: Eq_1397
  DataType: (ptr Eq_1397)
  OrigDataType: (ptr (struct (0 T_1398 t0000)))
T_1398: (in Mem1209[0x00409004:word32] : word32)
  Class: Eq_1393
  DataType: word32
  OrigDataType: word32
T_1399: (in esi_1226 != Mem1209[0x00409004:word32] : bool)
  Class: Eq_1399
  DataType: bool
  OrigDataType: bool
T_1400: (in __rol : ptr32)
  Class: Eq_1400
  DataType: (ptr Eq_1400)
  OrigDataType: (ptr (fn T_1402 (T_1390, T_1401)))
T_1401: (in 0xE1 : byte)
  Class: Eq_1401
  DataType: byte
  OrigDataType: byte
T_1402: (in __rol(edx_1227, 0xE1) : word32)
  Class: Eq_1402
  DataType: word32
  OrigDataType: word32
T_1403: (in 0x00000004 : word32)
  Class: Eq_1403
  DataType: word32
  OrigDataType: word32
T_1404: (in esp_1220 - 0x00000004 : word32)
  Class: Eq_1404
  DataType: (ptr Eq_1404)
  OrigDataType: word32
T_1405: (in esp_1237 : word32)
  Class: Eq_1404
  DataType: (ptr Eq_1404)
  OrigDataType: (ptr (struct (0 T_1409 t0000)))
T_1406: (in 0x004076B7 : word32)
  Class: Eq_1406
  DataType: word32
  OrigDataType: word32
T_1407: (in 0x00000000 : word32)
  Class: Eq_1407
  DataType: word32
  OrigDataType: word32
T_1408: (in esp_1237 + 0x00000000 : word32)
  Class: Eq_1408
  DataType: word32
  OrigDataType: word32
T_1409: (in Mem1238[esp_1237 + 0x00000000:word32] : word32)
  Class: Eq_1406
  DataType: word32
  OrigDataType: word32
*/
typedef  Eq_1INT Eq_1code Eq_1word32 Eq_1 Eq_1 Eq_1 Eq_1byte Eq_1code Eq_1code Eq_1struct Globals {
	int64 qw0000;	// 0
	 t003C;	// 3C
	INT t00EF;	// EF
	code t4076D0;	// 4076D0
	word32 t409000;	// 409000
	word32 dw409004;	// 409004
	word32 dw409010;	// 409010
	word32 dw409019;	// 409019
	word32 dw40902F;	// 40902F
	word32 dw409051;	// 409051
	word32 dw409053;	// 409053
	word32 dw409058;	// 409058
	word32 dw409064;	// 409064
	word32 dw409072;	// 409072
	word32 dw409078;	// 409078
	word32 dw40909C;	// 40909C
	word32 dw4090A4;	// 4090A4
	word32 dw4090B0;	// 4090B0
	word32 dw4090B2;	// 4090B2
	word32 dw4090DC;	// 4090DC
	word32 dw4090DE;	// 4090DE
	word32 dw4090E4;	// 4090E4
	word32 dw4090FB;	// 4090FB
	word32 dw409108;	// 409108
	word32 dw409111;	// 409111
	word32 dw409128;	// 409128
	word32 dw409129;	// 409129
	word32 dw40914E;	// 40914E
	word32 dw409177;	// 409177
	word32 dw409179;	// 409179
	word32 dw40917C;	// 40917C
	word32 dw409181;	// 409181
	word32 dw409188;	// 409188
	word32 dw40918F;	// 40918F
	word32 dw4091AC;	// 4091AC
	word32 dw4091D1;	// 4091D1
	word32 dw4091D4;	// 4091D4
	word32 dw4091EB;	// 4091EB
	word32 dw4091F9;	// 4091F9
	word32 dw40923A;	// 40923A
	word32 dw409252;	// 409252
	word32 dw409258;	// 409258
	word32 dw4092A5;	// 4092A5
	word32 dw4092C6;	// 4092C6
	 t4092CC;	// 4092CC
	word32 dw4092FC;	// 4092FC
	word32 dw40930B;	// 40930B
	word32 dw40930E;	// 40930E
	word32 dw409325;	// 409325
	word32 dw409326;	// 409326
	 t409328;	// 409328
	word32 dw409345;	// 409345
	 t409382;	// 409382
	word32 dw4093A3;	// 4093A3
	word32 dw4093B4;	// 4093B4
	word32 dw4093C2;	// 4093C2
	word32 dw4093D1;	// 4093D1
	word32 dw4093F7;	// 4093F7
	word32 dw409405;	// 409405
	byte t409456;	// 409456
	word32 dw409458;	// 409458
	code * ptr12EBB0C;	// 12EBB0C
	code t48FED1FE;	// 48FED1FE
} Eq_1;

typedef  Eq_4struct  {
	word32 dw0000;	// 0
	 t0004;	// 4
} Eq_4;

typedef word32 Eq_11;

typedef word32 Eq_47;

typedef word32 Eq_56;

typedef  Eq_60struct  {
	word32 dw0000;	// 0
	 t0001;	// 1
} Eq_60;

typedef word32 Eq_82;

typedef code Eq_88 Eq_88struct  {
	code * ptr0000;	// 0
	 t0004;	// 4
} Eq_88;

typedef union  {
	struct <anonymous>* u0;
	 HDC u1;
} Eq_102union  {
	int32 u0;
	Eq_102 u1;
} Eq_102UINTRECT Eq_102LPCSTRUINTINT Eq_102struct  {
	union  {
		struct <anonymous>* u0;
		 HDC u1;
	} u0000;	// 0
	union  {
		int32 u0;
		Eq_102 u1;
	} u0004;	// 4
	int32 dw0008;	// 8
	UINT;	// C
	RECT * ptr0010;	// 10
	LPCSTR;	// 14
	UINT;	// 18
	INT * ptr001C;	// 1C
} Eq_102;

typedef word32 Eq_104;

typedef code Eq_106struct  {
	code * ptr0018;	// 18
} Eq_106;

typedef union  {
	struct <anonymous>* u0;
	 HDC u1;
} Eq_116;

typedef word32 (Eq_122)(, int32, int32, UINT, RECT *, LPCSTR, UINT, INT *);

typedef UINT;

typedef RECT;

typedef LPCSTR;

typedef UINT;

typedef INT;

typedef byte Eq_163;

typedef word32 Eq_165;

typedef code Eq_167struct  {
	code * ptr0010;	// 10
} Eq_167;

typedef word32 Eq_169;

typedef word32 Eq_178;

typedef word32 Eq_184;

typedef code * Eq_193;

typedef word32 Eq_206;

typedef struct  {
	word32 dwFFFFFFF4;	// FFFFFFF4
	word32 dwFFFFFFF8;	// FFFFFFF8
	word32 dwFFFFFFFC;	// FFFFFFFC
	word32 dw0000;	// 0
} Eq_220;

typedef struct  {
	word32 dw0000;	// 0
} Eq_277;

typedef word32 Eq_278;

typedef word32 Eq_283;

typedef int64 Eq_287;

typedef word32 Eq_293;

typedef word32 Eq_306;

typedef  Eq_315struct  {
	word32 dwFFFFFFFC;	// FFFFFFFC
	 t0004;	// 4
} Eq_315;

typedef word32 Eq_336;

typedef word32 Eq_348;

typedef word32 Eq_366;

typedef word32 Eq_379;

typedef word32 Eq_392;

typedef  Eq_403 Eq_403struct  {
	int32 dw0000;	// 0
	 t0004;	// 4
	word32 dw0004;	// 4
	 t0008;	// 8
} Eq_403;

typedef struct  {
	word32 dw0000;	// 0
} Eq_437;

typedef struct  {
	word32 dw0000;	// 0
} Eq_450;

typedef struct  {
	word32 dw0000;	// 0
} Eq_465;

typedef struct  {
	word32 dw0000;	// 0
} Eq_474;

