// subject.h
// Generated on TIMESTAMP by decompiling from_pouet.net/with_source_315/ia32_com/subject.exe
// using Decompiler version VERSION

/*
// Equivalence classes ////////////
Eq_1: (struct "Globals" (FFFA0000 (ptr Eq_16) ptrFFFA0000))
	globals_t (in globals : (ptr (struct "Globals")))
Eq_2: (fn void (byte))
	T_2 (in bios_video_set_mode : ptr32)
	T_3 (in signature of bios_video_set_mode : void)
Eq_16: (segment "Eq_16" (0 byte b0000))
	T_16 (in 0xA000 : selector)
	T_84 (in es : (ptr Eq_16))
	T_110 (in es : (ptr Eq_16))
Eq_27: (segment "Eq_27" (1A1 Eq_81 t01A1) (1A3 Eq_81 t01A3) (1A5 word16 w01A5) (1A7 Eq_82 t01A7) (1A9 Eq_81 t01A9) (1AB word16 w01AB) (1AD word16 w01AD) (1AF Eq_82 t01AF) (1B1 Eq_81 t01B1) (1B3 word16 w01B3) (1B5 word16 w01B5) (1B7 word16 w01B7) (1B9 uint16 w01B9) (36D1 uint16 w36D1))
	T_27 (in ds : (ptr Eq_27))
	T_58 (in ds : (ptr Eq_27))
	T_85 (in ds : (ptr Eq_27))
	T_111 (in ds : (ptr Eq_27))
	T_194 (in ds : (ptr Eq_27))
Eq_30: (fn void (byte))
	T_30 (in __syscall : ptr32)
Eq_56: (fn void ((ptr Eq_27)))
	T_56 (in fn0C00_0219 : ptr32)
	T_57 (in signature of fn0C00_0219 : void)
Eq_65: (fn byte (word16))
	T_65 (in __inb : ptr32)
Eq_72: (fn byte (word16))
	T_72 (in __inb : ptr32)
Eq_79: (fn byte (Eq_81, Eq_82, byte, (ptr Eq_16), (ptr Eq_27)))
	T_79 (in fn0C00_01BB : ptr32)
	T_80 (in signature of fn0C00_01BB : void)
	T_102 (in fn0C00_01BB : ptr32)
	T_130 (in fn0C00_01BB : ptr32)
	T_149 (in fn0C00_01BB : ptr32)
	T_179 (in fn0C00_01BB : ptr32)

  Class: Eq_309
  DataType: (memptr (ptr Eq_27) Eq_81)
  OrigDataType: (memptr T_58 (struct (0 T_310 t0000)))
T_310: (in Mem49[ds:0x01A3:word16] : word16)
  Class: Eq_81
  DataType: Eq_81
  OrigDataType: word16
T_311: (in 0x013D : word16)
  Class: Eq_82
  DataType: int16
  OrigDataType: word16
T_312: (in cx_48 != 0x013D : bool)
  Class: Eq_312
  DataType: bool
  OrigDataType: bool
T_313: (in ax_41 < bx_18 : bool)
  Class: Eq_313
  DataType: bool
  OrigDataType: bool
T_314: (in 0x000A : word16)
  Class: Eq_314
  DataType: word16
  OrigDataType: word16
T_315: (in bx_18 + 0x000A : word16)
  Class: Eq_81
  DataType: Eq_81
  OrigDataType: int16
T_316: (in ax_41 >= bx_18.u0 : bool)
  Class: Eq_316
  DataType: bool
  OrigDataType: bool
T_317: (in 0x0001 : word16)
  Class: Eq_299
  DataType: word16
  OrigDataType: word16
T_318: (in 0x01AB : word16)
  Class: Eq_318
  DataType: (memptr (ptr Eq_27) word16)
  OrigDataType: (memptr T_58 (struct (0 T_319 t0000)))
T_319: (in Mem75[ds:0x01AB:word16] : word16)
  Class: Eq_299
  DataType: word16
  OrigDataType: word16
T_320: (in 0x0000 : word16)
  Class: Eq_82
  DataType: int16
  OrigDataType: word16
T_321: (in cx_48 != 0x0000 : bool)
  Class: Eq_321
  DataType: bool
  OrigDataType: bool
T_322: (in ax_41 < bx_53 : bool)
  Class: Eq_322
  DataType: bool
  OrigDataType: bool
T_323: (in 0x000A : word16)
  Class: Eq_323
  DataType: word16
  OrigDataType: word16
T_324: (in bx_53 + 0x000A : word16)
  Class: Eq_81
  DataType: Eq_81
  OrigDataType: int16
T_325: (in ax_41 >= bx_53.u0 : bool)
  Class: Eq_325
  DataType: bool
  OrigDataType: bool
T_326: (in 0xFFFF : word16)
  Class: Eq_299
  DataType: word16
  OrigDataType: word16
T_327: (in 0x01AB : word16)
  Class: Eq_327
  DataType: (memptr (ptr Eq_27) word16)
  OrigDataType: (memptr T_58 (struct (0 T_328 t0000)))
T_328: (in Mem69[ds:0x01AB:word16] : word16)
  Class: Eq_299
  DataType: word16
  OrigDataType: word16
T_329: (in 0x013F : word16)
  Class: Eq_82
  DataType: int16
  OrigDataType: word16
T_330: (in cx_48 != 0x013F : bool)
  Class: Eq_330
  DataType: bool
  OrigDataType: bool
T_331: (in fn0C00_01E0 : ptr32)
  Class: Eq_331
  DataType: (ptr Eq_331)
  OrigDataType: (ptr (fn T_334 (T_275, T_333, T_58)))
T_332: (in signature of fn0C00_01E0 : void)
  Class: Eq_331
  DataType: (ptr Eq_331)
  OrigDataType: 
T_333: (in 0x01B7 : word16)
  Class: Eq_195
  DataType: (memptr (ptr Eq_27) int16)
  OrigDataType: word16
T_334: (in fn0C00_01E0(ax_41, &Eq_27::w01B7, ds) : void)
  Class: Eq_334
  DataType: void
  OrigDataType: void
T_335: (in fn0C00_01E0 : ptr32)
  Class: Eq_331
  DataType: (ptr Eq_331)
  OrigDataType: (ptr (fn T_337 (T_275, T_336, T_58)))
T_336: (in 0x01B5 : word16)
  Class: Eq_195
  DataType: (memptr (ptr Eq_27) int16)
  OrigDataType: word16
T_337: (in fn0C00_01E0(ax_41, &Eq_27::w01B5, ds) : void)
  Class: Eq_334
  DataType: void
  OrigDataType: void
*/
typedef Eq_16 Eq_1struct Globals {
	Eq_16 * ptrFFFA0000;	// FFFA0000
} Eq_1;

typedef void (Eq_2)(byte);

typedef struct Eq_16 {
	byte b0000;	// 0
} Eq_16;

typedef Eq_81 Eq_27Eq_81 Eq_27Eq_82 Eq_27Eq_81 Eq_27Eq_82 Eq_27Eq_81 Eq_27struct Eq_27 {
	Eq_81 t01A1;	// 1A1
	Eq_81 t01A3;	// 1A3
	word16 w01A5;	// 1A5
	Eq_82 t01A7;	// 1A7
	Eq_81 t01A9;	// 1A9
	word16 w01AB;	// 1AB
	word16 w01AD;	// 1AD
	Eq_82 t01AF;	// 1AF
	Eq_81 t01B1;	// 1B1
	word16 w01B3;	// 1B3
	word16 w01B5;	// 1B5
	word16 w01B7;	// 1B7
	uint16 w01B9;	// 1B9
	uint16 w36D1;	// 36D1
} Eq_27;

typedef void (Eq_30)(byte);

typedef void (Eq_56)(Eq_27 *);

typedef byte (Eq_65)(word16);

typedef byte (Eq_72)(word16);

typedef byte (Eq_79)(Eq_81, Eq_82, byte, Eq_16 *, Eq_27 *);

typedef union Eq_81 {
	int16 u0;
	uint16 u1;
} Eq_81;

typedef union Eq_82 {
	int16 u0;
	byte Eq_16::* u1;
} Eq_82;

typedef void (Eq_105)(Eq_81, Eq_82, byte, Eq_16 *, Eq_27 *);

typedef byte (Eq_158)(byte *);

typedef void (Eq_165)();

typedef Eq_81 (Eq_242)(Eq_81);

typedef void (Eq_331)(Eq_81, int16 Eq_27::*, Eq_27 *);

