// subject.h
// Generated on TIMESTAMP by decompiling malware_via_email/malware_0789/ia32_pe/subject.exe
// using Decompiler version VERSION

/*
// Equivalence classes ////////////
Eq_1: (struct "Globals" (4040DC (struct "Eq_2200" (0 up32 dw0000) (4 Eq_29 t0004) (3C word32 dw003C)) t4040DC) (404164 word32 dw404164) (404168 int32 dw404168) (40416C int32 dw40416C) (404170 int32 dw404170) (404174 word32 dw404174) (404178 Eq_29 t404178) (40417C (ptr Eq_1004) ptr40417C) (404180 word32 dw404180) (404184 int32 dw404184) (404188 Eq_29 t404188) (40418C word32 dw40418C) (404190 int32 dw404190) (404194 int32 dw404194) (404198 Eq_29 t404198) (40419C (ptr Eq_1043) ptr40419C) (4041A0 (ptr code) ptr4041A0) (4041A4 int32 dw4041A4))
	globals_t (in globals : (ptr (struct "Globals")))
Eq_6: (fn word32 (Eq_8))
	T_6 (in AddAtomA : ptr32)
	T_7 (in signature of AddAtomA : void)
	T_903 (in AddAtomA : ptr32)
Eq_8: (union "Eq_8" (word32 u0) (LPCSTR u1))
	T_8 (in lpString : LPCSTR)
	T_9 (in 0x00404000 : word32)
	T_904 (in 0x00404150 : word32)
Eq_23: (struct "Eq_23" (FFFFFFE0 word32 dwFFFFFFE0) (FFFFFFF0 word32 dwFFFFFFF0))
	T_23 (in fp : ptr32)
Eq_27: (fn void (Eq_29))
	T_27 (in ExitProcess : ptr32)
	T_28 (in signature of ExitProcess : void)
	T_83 (in ExitProcess : ptr32)
	T_447 (in ExitProcess : ptr32)
	T_876 (in ExitProcess : ptr32)
	T_918 (in ExitProcess : ptr32)
	T_948 (in ExitProcess : ptr32)
	T_1090 (in ExitProcess : ptr32)
	T_1223 (in ExitProcess : ptr32)

  OrigDataType: DWORD
T_2188: (in dwBytes : SIZE_T)
  Class: Eq_2188
  DataType: Eq_2188
  OrigDataType: SIZE_T
T_2189: (in GetProcessHeap : ptr32)
  Class: Eq_2177
  DataType: (ptr Eq_2177)
  OrigDataType: (ptr (fn T_2190 ()))
T_2190: (in GetProcessHeap() : word32)
  Class: Eq_2174
  DataType: Eq_2174
  OrigDataType: word32
T_2191: (in 0x00000000 : word32)
  Class: Eq_2187
  DataType: word32
  OrigDataType: word32
T_2192: (in dwArg04 : word32)
  Class: Eq_2188
  DataType: Eq_2188
  OrigDataType: word32
T_2193: (in HeapAlloc(GetProcessHeap(), 0x00000000, dwArg04) : word32)
  Class: Eq_2193
  DataType: word32
  OrigDataType: word32
T_2194:
  Class: Eq_2194
  DataType: word16
  OrigDataType: (struct 0002 (0 T_1369 t0000))
T_2195:
  Class: Eq_2194
  DataType: word16
  OrigDataType: (struct 0002 (0 T_1383 t0000))
T_2196:
  Class: Eq_2194
  DataType: word16
  OrigDataType: (struct 0002 (0 T_1398 t0000))
T_2197:
  Class: Eq_2197
  DataType: word16
  OrigDataType: (struct 0002 (0 T_1700 t0000))
T_2198:
  Class: Eq_2197
  DataType: word16
  OrigDataType: (struct 0002 (0 T_1712 t0000))
T_2199:
  Class: Eq_2197
  DataType: word16
  OrigDataType: (struct 0002 (0 T_1725 t0000))
T_2200:
  Class: Eq_2200
  DataType: Eq_2200
  OrigDataType: 
T_2201:
  Class: Eq_2201
  DataType: int32
  OrigDataType: 
T_2202:
  Class: Eq_2202
  DataType: int32
  OrigDataType: 
T_2203:
  Class: Eq_2203
  DataType: int32
  OrigDataType: 
T_2204:
  Class: Eq_2204
  DataType: Eq_2204
  OrigDataType: 
T_2205:
  Class: Eq_2205
  DataType: int32
  OrigDataType: 
T_2206:
  Class: Eq_2206
  DataType: int32
  OrigDataType: 
T_2207:
  Class: Eq_2207
  DataType: int32
  OrigDataType: 
T_2208:
  Class: Eq_2208
  DataType: int32
  OrigDataType: 
T_2209:
  Class: Eq_2209
  DataType: int32
  OrigDataType: 
T_2210:
  Class: Eq_2210
  DataType: int32
  OrigDataType: 
T_2211:
  Class: Eq_2211
  DataType: int32
  OrigDataType: 
T_2212:
  Class: Eq_2212
  DataType: Eq_2212
  OrigDataType: 
T_2213:
  Class: Eq_2213
  DataType: Eq_2213
  OrigDataType: 
T_2214:
  Class: Eq_2214
  DataType: Eq_2214
  OrigDataType: 
T_2215:
  Class: Eq_2215
  DataType: Eq_2215
  OrigDataType: 
T_2216:
  Class: Eq_2216
  DataType: int32
  OrigDataType: 
T_2217:
  Class: Eq_2217
  DataType: Eq_2217
  OrigDataType: 
T_2218:
  Class: Eq_2218
  DataType: Eq_2218
  OrigDataType: 
*/
typedef struct Eq_2200;
Eq_29 Eq_1Eq_1004 Eq_1Eq_29 Eq_1Eq_29 Eq_1Eq_1043 Eq_1code Eq_1struct Globals {
	struct Eq_2200 t4040DC;	// 4040DC
	word32 dw404164;	// 404164
	int32 dw404168;	// 404168
	int32 dw40416C;	// 40416C
	int32 dw404170;	// 404170
	word32 dw404174;	// 404174
	Eq_29 t404178;	// 404178
	Eq_1004 * ptr40417C;	// 40417C
	word32 dw404180;	// 404180
	int32 dw404184;	// 404184
	Eq_29 t404188;	// 404188
	word32 dw40418C;	// 40418C
	int32 dw404190;	// 404190
	int32 dw404194;	// 404194
	Eq_29 t404198;	// 404198
	Eq_1043 * ptr40419C;	// 40419C
	code * ptr4041A0;	// 4041A0
	int32 dw4041A4;	// 4041A4
} Eq_1;

typedef word32 (Eq_6)(Eq_8);

typedef union Eq_8 {
	word32 u0;
	 LPCSTR u1;
} Eq_8;

typedef struct Eq_23 {
	word32 dwFFFFFFE0;	// FFFFFFE0
	word32 dwFFFFFFF0;	// FFFFFFF0
} Eq_23;

typedef void (Eq_27)(Eq_29);

typedef union Eq_29 {
	Eq_2200* u0;
	 DWORD u1;
	 HANDLE u2;
	 HDC u3;
	 HINSTANCE u4;
	 HMODULE u5;
	 HWND u6;
	 LPCSTR u7;
	 LPCVOID u8;
	 LPSTR u9;
	 LPVOID u10;
	 UINT u11;
} Eq_29;

typedef word32 (Eq_50)(Eq_52);

typedef union Eq_52 {
	word32 u0;
	 LPCWSTR u1;
} Eq_52;

typedef struct Eq_69 {
	word32 dwFFFFFFC4;	// FFFFFFC4
	ui32 dwFFFFFFCC;	// FFFFFFCC
} Eq_69;

typedef word32 (Eq_121)(word32, word32);

typedef Eq_170 Eq_170struct Eq_170 {	// size: 1 1
	byte b0000;	// 0
	Eq_170 t0001;	// 1
} Eq_170;

typedef word32 (Eq_216)(Eq_218, Eq_219, Eq_220, Eq_221, Eq_222, Eq_223, Eq_224);

typedef union Eq_218 {
	word32 u0;
	 LPCSTR u1;
} Eq_218;

typedef union Eq_219 {
	word32 u0;
	 DWORD u1;
} Eq_219;

typedef union Eq_220 {
	word32 u0;
	 DWORD u1;
} Eq_220;

typedef union Eq_221 {
	word32 u0;
	 LPSECURITY_ATTRIBUTES u1;
} Eq_221;

typedef union Eq_222 {
	word32 u0;
	 DWORD u1;
} Eq_222;

typedef union Eq_223 {
	word32 u0;
	 DWORD u1;
} Eq_223;

typedef union Eq_224 {
	word32 u0;
	 HANDLE u1;
} Eq_224;

typedef Eq_29 (Eq_304)(Eq_29);

typedef word32 (Eq_312)(Eq_29, Eq_315);

typedef union Eq_315 {
	word32 u0;
	 LPCSTR u1;
} Eq_315;

typedef word32 (Eq_331)(Eq_333, Eq_334);

typedef union Eq_333 {
	word32 u0;
	 HINSTANCE u1;
} Eq_333;

typedef union Eq_334 {
	word32 u0;
	 LPCSTR u1;
} Eq_334;

typedef word32 (Eq_343)(WNDCLASSA *);

typedef WNDCLASSA;

typedef Eq_29 Eq_346Eq_29 Eq_346Eq_29 Eq_346Eq_29 Eq_346Eq_29 Eq_346RECT Eq_346struct Eq_346 {
	word32 dwFFFFFE18;	// FFFFFE18
	word32 dwFFFFFE1C;	// FFFFFE1C
	word32 dwFFFFFE20;	// FFFFFE20
	word32 dwFFFFFE24;	// FFFFFE24
	word32 dwFFFFFE28;	// FFFFFE28
	word32 dwFFFFFE2C;	// FFFFFE2C
	word32 dwFFFFFE30;	// FFFFFE30
	Eq_29 tFFFFFE34;	// FFFFFE34
	Eq_29 tFFFFFE38;	// FFFFFE38
	Eq_29 tFFFFFE3C;	// FFFFFE3C
	Eq_29 tFFFFFE40;	// FFFFFE40
	Eq_29 tFFFFFE44;	// FFFFFE44
	RECT tFFFFFF78;	// FFFFFF78
	int32 dwFFFFFFF4;	// FFFFFFF4
} Eq_346;

typedef word32 (Eq_386)(Eq_388, Eq_389, Eq_390, Eq_391, int32, int32, int32, int32, Eq_396, Eq_397, Eq_29, Eq_399);

typedef union Eq_388 {
	word32 u0;
	 DWORD u1;
} Eq_388;

typedef union Eq_389 {
	word32 u0;
	 LPCSTR u1;
} Eq_389;

typedef union Eq_390 {
	word32 u0;
	 LPCSTR u1;
} Eq_390;

typedef union Eq_391 {
	word32 u0;
	 DWORD u1;
} Eq_391;

typedef union Eq_396 {
	word32 u0;
	 HWND u1;
} Eq_396;

typedef union Eq_397 {
	word32 u0;
	 HMENU u1;
} Eq_397;

typedef union Eq_399 {
	word32 u0;
	 LPVOID u1;
} Eq_399;

typedef word32 (Eq_428)(Eq_29, Eq_431);

typedef union Eq_431 {
	word32 u0;
	 LPDWORD u1;
} Eq_431;

typedef word32 (Eq_482)(RECT *);

typedef RECT;

typedef Eq_613 Eq_502struct Eq_502 {
	word16 w0006;	// 6
	word16 w0014;	// 14
	Eq_613 t003C;	// 3C
} Eq_502;

typedef struct Eq_588 {
	word32 dw0010;	// 10
	word32 dw0014;	// 14
} Eq_588;

typedef union Eq_613 {
	int32 u0;
	uint32 u1;
} Eq_613;

typedef union Eq_615 {
	word32 u0;
	 LONG u1;
} Eq_615;

typedef union Eq_626 {
	int32 u0;
	uint32 u1;
} Eq_626;

typedef Eq_29 (Eq_645)(word32);

typedef word32 (Eq_665)(Eq_29, Eq_29, Eq_29);

typedef Eq_29 (Eq_676)();

typedef Eq_29 (Eq_682)(Eq_29);

typedef word32 (Eq_689)(Eq_29, int32, Eq_29);

typedef Eq_29 (Eq_704)(Eq_29);

typedef union Eq_732 {
	word32 u0;
	 DWORD u1;
} Eq_732;

typedef word32 (Eq_733)(Eq_735, Eq_736);

typedef union Eq_735 {
	word32 u0;
	 HANDLE u1;
} Eq_735;

typedef union Eq_736 {
	word32 u0;
	 LPDWORD u1;
} Eq_736;

typedef word32 (Eq_769)(Eq_29, Eq_615, Eq_773, Eq_774);

typedef union Eq_773 {
	word32 u0;
	 PLONG u1;
} Eq_773;

typedef union Eq_774 {
	word32 u0;
	 DWORD u1;
} Eq_774;

typedef word32 (Eq_784)(Eq_29, Eq_29, Eq_732, Eq_789, Eq_790);

typedef union Eq_789 {
	word32 u0;
	 LPDWORD u1;
} Eq_789;

typedef union Eq_790 {
	word32 u0;
	 LPOVERLAPPED u1;
} Eq_790;

typedef word32 (Eq_812)(Eq_814);

typedef union Eq_814 {
	word32 u0;
	 HANDLE u1;
} Eq_814;

typedef word32 (Eq_829)(Eq_29, Eq_832);

typedef union Eq_832 {
	word32 u0;
	 LPPOINT u1;
} Eq_832;

typedef word32 (Eq_851)(Eq_853, Eq_854);

typedef union Eq_853 {
	word32 u0;
	 LPCWSTR u1;
} Eq_853;

typedef union Eq_854 {
	word32 u0;
	 LPDWORD u1;
} Eq_854;

typedef void (Eq_885)(Eq_29, Eq_29, Eq_29);

typedef word32 (Eq_934)(Eq_936);

typedef union Eq_936 {
	word32 u0;
	 HDC u1;
} Eq_936;

typedef struct Eq_991 {
	word32 dw0008;	// 8
} Eq_991;

typedef struct Eq_997 {
	word32 dw0008;	// 8
} Eq_997;

typedef Eq_29 Eq_1004struct Eq_1004 {
	int32 dwFFFFFFE0;	// FFFFFFE0
	int32 dwFFFFFFEC;	// FFFFFFEC
	int32 dwFFFFFFF0;	// FFFFFFF0
	Eq_29 tFFFFFFF4;	// FFFFFFF4
	int32 dwFFFFFFF8;	// FFFFFFF8
} Eq_1004;

typedef Eq_1004 * (Eq_1005)(word32 *, word32, Eq_29, up32);

typedef Eq_1043 Eq_1041struct Eq_1041 {
	Eq_1043 * ptr0018;	// 18
} Eq_1041;

typedef Eq_2099 Eq_1043struct Eq_1043 {
	Eq_2099 * ptr0030;	// 30
} Eq_1043;

typedef void (Eq_1108)(word32);

typedef word32 (Eq_1136)(word32);

typedef void (Eq_1215)(word32);

typedef Eq_1258 Eq_1253struct Eq_1253 {
	Eq_1258 t0050;	// 50
	word32 dw00A0;	// A0
	word32 dw00A4;	// A4
} Eq_1253;

typedef union Eq_1258 {
	word32 u0;
	 SIZE_T u1;
} Eq_1258;

typedef Eq_29 Eq_1259Eq_1258 Eq_1259struct Eq_1259 {
	Eq_29 tFFFFFFB8;	// FFFFFFB8
	Eq_1258 tFFFFFFBC;	// FFFFFFBC
} Eq_1259;

typedef Eq_29 (Eq_1263)(Eq_29, Eq_1258, Eq_1267, Eq_29);

typedef union Eq_1267 {
	Eq_2217* u0;
	 DWORD u1;
} Eq_1267;

typedef  Eq_1312[]struct Eq_1312 {
	word32 dw0000;	// 0
	word32 dw0004;	// 4
	word16 a0008[];	// 8
} Eq_1312;

typedef Eq_1522 Eq_1413Eq_1258 Eq_1413struct Eq_1413 {
	word16 w0006;	// 6
	word16 w0014;	// 14
	Eq_1522 t003C;	// 3C
	Eq_1258 t0050;	// 50
} Eq_1413;

typedef Eq_1419 Eq_1419struct Eq_1419 {	// size: 40 28
	word32 dw000C;	// C
	word32 dw0010;	// 10
	word32 dw0014;	// 14
	Eq_1419 t0028;	// 28
} Eq_1419;

typedef Eq_1627 Eq_1458Eq_1831 Eq_1458Eq_29 Eq_1458Eq_29 Eq_1458Eq_1267 Eq_1458Eq_29 Eq_1458struct Eq_1458 {
	Eq_1627 tFFFFFF90;	// FFFFFF90
	Eq_1831 tFFFFFF94;	// FFFFFF94
	Eq_29 tFFFFFF98;	// FFFFFF98
	Eq_29 tFFFFFF9C;	// FFFFFF9C
	Eq_1267 tFFFFFFA0;	// FFFFFFA0
	Eq_29 tFFFFFFA4;	// FFFFFFA4
	word32 dwFFFFFFEC;	// FFFFFFEC
} Eq_1458;

typedef code Eq_1477Eq_29 Eq_1477Eq_29 Eq_1477struct Eq_1477 {
	code * ptr0028;	// 28
	Eq_29 t0034;	// 34
	Eq_29 t0050;	// 50
	word32 dw0080;	// 80
	word32 dw00A0;	// A0
	word32 dw00A4;	// A4
} Eq_1477;

typedef Eq_1482 Eq_1482struct Eq_1482 {	// size: 20 14
	word32 dw0000;	// 0
	word32 dw000C;	// C
	word32 dw0010;	// 10
	Eq_1482 t0014;	// 14
} Eq_1482;

typedef union Eq_1522 {
	int32 u0;
	uint32 u1;
} Eq_1522;

typedef union Eq_1543 {
	int32 u0;
	uint32 u1;
} Eq_1543;

typedef Eq_1563 Eq_1563struct Eq_1563 {	// size: 4 4
	word32 dw0000;	// 0
	Eq_1563 t0004;	// 4
} Eq_1563;

typedef Eq_1564 Eq_1564struct Eq_1564 {	// size: 4 4
	word32 dw0000;	// 0
	Eq_1564 t0004;	// 4
} Eq_1564;

typedef Eq_29 (Eq_1580)(Eq_1582);

typedef union Eq_1582 {
	word32 u0;
	 LPCSTR u1;
} Eq_1582;

typedef union Eq_1627 {
	word32 u0;
	 HANDLE u1;
} Eq_1627;

typedef Eq_1627 (Eq_1628)(Eq_1630, Eq_1631, Eq_1632, Eq_1633, Eq_29, Eq_1635);

typedef union Eq_1630 {
	word32 u0;
	 HANDLE u1;
} Eq_1630;

typedef union Eq_1631 {
	word32 u0;
	 LPSECURITY_ATTRIBUTES u1;
} Eq_1631;

typedef union Eq_1632 {
	word32 u0;
	 DWORD u1;
} Eq_1632;

typedef union Eq_1633 {
	word32 u0;
	 DWORD u1;
} Eq_1633;

typedef union Eq_1635 {
	word32 u0;
	 LPCSTR u1;
} Eq_1635;

typedef  Eq_1656[]struct Eq_1656 {
	word32 dw0000;	// 0
	word32 dw0004;	// 4
	word16 a0008[];	// 8
} Eq_1656;

typedef word32 (Eq_1749)(Eq_29, Eq_1752);

typedef union Eq_1752 {
	word32 u0;
	 LPCSTR u1;
} Eq_1752;

typedef union Eq_1831 {
	word32 u0;
	 DWORD u1;
} Eq_1831;

typedef Eq_29 (Eq_1838)(Eq_1627, Eq_1831, Eq_29, Eq_1843, Eq_1844, Eq_29);

typedef union Eq_1843 {
	word32 u0;
	 DWORD u1;
} Eq_1843;

typedef union Eq_1844 {
	word32 u0;
	 SIZE_T u1;
} Eq_1844;

typedef word32 (Eq_1910)(Eq_29);

typedef word32 (Eq_1934)(Eq_29, Eq_1844, Eq_1938);

typedef union Eq_1938 {
	word32 u0;
	 DWORD u1;
} Eq_1938;

typedef void (Eq_1945)(Eq_29);

typedef void (Eq_1951)(Eq_29, word32);

typedef Eq_2094 Eq_2094struct Eq_2094 {
	Eq_2094 * ptr0000;	// 0
	word32 dw0018;	// 18
	word32 dw001C;	// 1C
} Eq_2094;

typedef Eq_2102 Eq_2099struct Eq_2099 {
	word32 dw0008;	// 8
	Eq_2102 * ptr000C;	// C
} Eq_2099;

typedef Eq_2094 Eq_2102struct Eq_2102 {
	Eq_2094 * ptr000C;	// C
} Eq_2102;

typedef word32 (Eq_2172)(Eq_2174, Eq_2175, Eq_2176);

typedef union Eq_2174 {
	word32 u0;
	 HANDLE u1;
} Eq_2174;

typedef union Eq_2175 {
	word32 u0;
	 DWORD u1;
} Eq_2175;

typedef union Eq_2176 {
	word32 u0;
	 LPVOID u1;
} Eq_2176;

typedef Eq_2174 (Eq_2177)();

typedef word32 (Eq_2184)(Eq_2174, Eq_2187, Eq_2188);

typedef union Eq_2187 {
	word32 u0;
	 DWORD u1;
} Eq_2187;

typedef union Eq_2188 {
	word32 u0;
	 SIZE_T u1;
} Eq_2188;

typedef struct Eq_2200 Eq_2200;

typedef DWORDLPVOIDBOOLstruct _SECURITY_ATTRIBUTES {
	DWORD;	// 0
	LPVOID;	// 4
	BOOL;	// 8
} Eq_2204;

typedef DWORDDWORDstruct struct_61 {
	DWORD;	// 0
	DWORD;	// 4
} Eq_2212;

typedef union Eq_2213 {
	 <anonymous> u0;
	 PVOID u1;
} Eq_2213;

typedef ULONG_PTRULONG_PTREq_2213 Eq_2214HANDLEstruct _OVERLAPPED {
	ULONG_PTR;	// 0
	ULONG_PTR;	// 4
	Eq_2213 t0008;	// 8
	HANDLE;	// 10
} Eq_2214;

typedef LONGLONGstruct tagPOINT {
	LONG;	// 0
	LONG;	// 4
} Eq_2215;

typedef struct Eq_2217 {
	word32 dw003C;	// 3C
} Eq_2217;

typedef DWORDLPVOIDBOOLstruct _SECURITY_ATTRIBUTES {
	DWORD;	// 0
	LPVOID;	// 4
	BOOL;	// 8
} Eq_2218;

