// subject.h
// Generated on TIMESTAMP by decompiling malware_via_email/malware_0856/ia32_pe/subject.exe
// using Decompiler version VERSION

/*
// Equivalence classes ////////////
Eq_1: (struct "Globals" (3000 Eq_316 t3000) (404000 up32 dw404000) (404004 word32 dw404004) (4080C0 (ptr Eq_316) ptr4080C0) (4080C4 word32 dw4080C4) (4080C8 word32 dw4080C8) (4080CC (ptr Eq_208) ptr4080CC) (4080D0 word32 dw4080D0) (4080D4 word32 dw4080D4) (4080D8 (ptr Eq_225) ptr4080D8) (4080DC (ptr code) ptr4080DC))
	globals_t (in globals : (ptr (struct "Globals")))
Eq_15: (fn word32 (Eq_17, Eq_18, Eq_19))
	T_15 (in RegOpenKeyA : ptr32)
	T_16 (in signature of RegOpenKeyA : void)
	T_153 (in RegOpenKeyA : ptr32)
Eq_17: (union "Eq_17" (word32 u0) (HKEY u1))
	T_17 (in hKey : HKEY)
	T_20 (in 0x80000002 : word32)
	T_154 (in 0x80000002 : word32)
Eq_18: (union "Eq_18" (word32 u0) (LPCSTR u1))
	T_18 (in lpSubKey : LPCSTR)
	T_21 (in 0x00408070 : word32)
	T_155 (in 0x004080A8 : word32)
Eq_19: (union "Eq_19" (word32 u0) (PHKEY u1))
	T_19 (in phkResult : PHKEY)
	T_24 (in fp - 0x00000020 : word32)
	T_158 (in fp - 0x00000028 : word32)
Eq_53: (fn word32 (word32, word32))
	T_53 (in fn004011D0 : ptr32)
	T_54 (in signature of fn004011D0 : void)
	T_62 (in fn004011D0 : ptr32)
Eq_98: (fn word32 (Eq_100, Eq_101))
	T_98 (in LoadIconA : ptr32)
	T_99 (in signature of LoadIconA : void)
Eq_100: (union "Eq_100" (word32 u0) (HINSTANCE u1))
	T_100 (in hInstance : HINSTANCE)
	T_102 (in 0x00000000 : word32)

  DataType: (ptr (ptr Eq_225))
  OrigDataType: (ptr (struct (0 T_820 t0000)))
T_820: (in Mem0[0x004080D8:word32] : word32)
  Class: Eq_225
  DataType: (ptr Eq_225)
  OrigDataType: word32
T_821: (in dwArg04 : word32)
  Class: Eq_821
  DataType: word32
  OrigDataType: word32
T_822: (in 0x00000030 : word32)
  Class: Eq_822
  DataType: word32
  OrigDataType: word32
T_823: (in eax_11 + 0x00000030 : word32)
  Class: Eq_823
  DataType: word32
  OrigDataType: word32
T_824: (in Mem0[eax_11 + 0x00000030:word32] : word32)
  Class: Eq_824
  DataType: (ptr Eq_824)
  OrigDataType: (ptr (struct (8 T_827 t0008)))
T_825: (in 0x00000008 : word32)
  Class: Eq_825
  DataType: word32
  OrigDataType: word32
T_826: (in Mem0[eax_11 + 0x00000030:word32] + 0x00000008 : word32)
  Class: Eq_826
  DataType: word32
  OrigDataType: word32
T_827: (in Mem17[Mem0[eax_11 + 0x00000030:word32] + 0x00000008:word32] : word32)
  Class: Eq_821
  DataType: word32
  OrigDataType: word32
T_828: (in eax : word32)
  Class: Eq_828
  DataType: word32
  OrigDataType: word32
T_829: (in HeapAlloc : ptr32)
  Class: Eq_829
  DataType: (ptr Eq_829)
  OrigDataType: (ptr (fn T_839 (T_836, T_837, T_838)))
T_830: (in signature of HeapAlloc : void)
  Class: Eq_829
  DataType: (ptr Eq_829)
  OrigDataType: 
T_831: (in hHeap : HANDLE)
  Class: Eq_831
  DataType: Eq_831
  OrigDataType: HANDLE
T_832: (in dwFlags : DWORD)
  Class: Eq_832
  DataType: Eq_832
  OrigDataType: DWORD
T_833: (in dwBytes : SIZE_T)
  Class: Eq_833
  DataType: Eq_833
  OrigDataType: SIZE_T
T_834: (in GetProcessHeap : ptr32)
  Class: Eq_834
  DataType: (ptr Eq_834)
  OrigDataType: (ptr (fn T_836 ()))
T_835: (in signature of GetProcessHeap : void)
  Class: Eq_834
  DataType: (ptr Eq_834)
  OrigDataType: 
T_836: (in GetProcessHeap() : word32)
  Class: Eq_831
  DataType: Eq_831
  OrigDataType: word32
T_837: (in 0x00000000 : word32)
  Class: Eq_832
  DataType: word32
  OrigDataType: word32
T_838: (in dwArg04 : word32)
  Class: Eq_833
  DataType: Eq_833
  OrigDataType: word32
T_839: (in HeapAlloc(GetProcessHeap(), 0x00000000, dwArg04) : word32)
  Class: Eq_839
  DataType: word32
  OrigDataType: word32
T_840:
  Class: Eq_840
  DataType: word16
  OrigDataType: (struct 0002 (0 T_377 t0000))
T_841:
  Class: Eq_840
  DataType: word16
  OrigDataType: (struct 0002 (0 T_391 t0000))
T_842:
  Class: Eq_840
  DataType: word16
  OrigDataType: (struct 0002 (0 T_406 t0000))
T_843:
  Class: Eq_843
  DataType: int32
  OrigDataType: 
T_844:
  Class: Eq_844
  DataType: int32
  OrigDataType: 
T_845:
  Class: Eq_845
  DataType: int32
  OrigDataType: 
T_846:
  Class: Eq_846
  DataType: int32
  OrigDataType: 
T_847:
  Class: Eq_847
  DataType: int32
  OrigDataType: 
T_848:
  Class: Eq_848
  DataType: int32
  OrigDataType: 
T_849:
  Class: Eq_849
  DataType: Eq_849
  OrigDataType: 
T_850:
  Class: Eq_850
  DataType: int32
  OrigDataType: 
T_851:
  Class: Eq_851
  DataType: Eq_851
  OrigDataType: 
*/
typedef Eq_316 Eq_1Eq_316 Eq_1Eq_208 Eq_1Eq_225 Eq_1code Eq_1struct Globals {
	Eq_316 t3000;	// 3000
	up32 dw404000;	// 404000
	word32 dw404004;	// 404004
	Eq_316 * ptr4080C0;	// 4080C0
	word32 dw4080C4;	// 4080C4
	word32 dw4080C8;	// 4080C8
	Eq_208 * ptr4080CC;	// 4080CC
	word32 dw4080D0;	// 4080D0
	word32 dw4080D4;	// 4080D4
	Eq_225 * ptr4080D8;	// 4080D8
	code * ptr4080DC;	// 4080DC
} Eq_1;

typedef word32 (Eq_15)(Eq_17, Eq_18, Eq_19);

typedef union Eq_17 {
	word32 u0;
	 HKEY u1;
} Eq_17;

typedef union Eq_18 {
	word32 u0;
	 LPCSTR u1;
} Eq_18;

typedef union Eq_19 {
	word32 u0;
	 PHKEY u1;
} Eq_19;

typedef word32 (Eq_53)(word32, word32);

typedef word32 (Eq_98)(Eq_100, Eq_101);

typedef union Eq_100 {
	word32 u0;
	 HINSTANCE u1;
} Eq_100;

typedef union Eq_101 {
	word32 u0;
	 LPCSTR u1;
} Eq_101;

typedef Eq_110 Eq_110struct Eq_110 {	// size: 1 1
	byte b0000;	// 0
	Eq_110 t0001;	// 1
} Eq_110;

typedef word32 (Eq_135)(Eq_137, Eq_138);

typedef union Eq_137 {
	word32 u0;
	 HINSTANCE u1;
} Eq_137;

typedef union Eq_138 {
	word32 u0;
	 LPCSTR u1;
} Eq_138;

typedef word32 (Eq_142)();

typedef union Eq_145 {
	word32 u0;
	 HINSTANCE u1;
} Eq_145;

typedef Eq_145 (Eq_146)(Eq_148);

typedef union Eq_148 {
	word32 u0;
	 LPCSTR u1;
} Eq_148;

typedef struct Eq_156 {
	ptr32 ptrFFFFFFAC;	// FFFFFFAC
	word32 dwFFFFFFB0;	// FFFFFFB0
	word32 dwFFFFFFB4;	// FFFFFFB4
	word32 dwFFFFFFF8;	// FFFFFFF8
} Eq_156;

typedef word32 (Eq_180)(Eq_145, Eq_183, Eq_184, Eq_185, Eq_186);

typedef union Eq_183 {
	word32 u0;
	 LPCSTR u1;
} Eq_183;

typedef union Eq_184 {
	word32 u0;
	 HWND u1;
} Eq_184;

typedef union Eq_185 {
	word32 u0;
	 DLGPROC u1;
} Eq_185;

typedef union Eq_186 {
	word32 u0;
	 LPARAM u1;
} Eq_186;

typedef word32 (Eq_193)(word32);

typedef struct Eq_208 {
	word32 dwFFFFFFC8;	// FFFFFFC8
	word32 dwFFFFFFCC;	// FFFFFFCC
	word32 dwFFFFFFE4;	// FFFFFFE4
	ptr32 ptrFFFFFFFC;	// FFFFFFFC
} Eq_208;

typedef Eq_208 * (Eq_209)(word32 *, word32, word32, up32);

typedef Eq_225 Eq_223struct Eq_223 {
	Eq_225 * ptr0018;	// 18
} Eq_223;

typedef Eq_824 Eq_225struct Eq_225 {
	Eq_824 * ptr0030;	// 30
} Eq_225;

typedef void (Eq_261)(word32, word32);

typedef void (Eq_274)(word32);

typedef struct Eq_285 {
	word32 dw0008;	// 8
} Eq_285;

typedef struct Eq_292 {
	word32 dw0008;	// 8
} Eq_292;

typedef Eq_307 Eq_298struct Eq_298 {
	Eq_307 t0050;	// 50
	word32 dw00A0;	// A0
	word32 dw00A4;	// A4
} Eq_298;

typedef struct Eq_299 {
	word32 dw003C;	// 3C
} Eq_299;

typedef Eq_316 * (Eq_304)(Eq_306, Eq_307, Eq_308, Eq_309);

typedef union Eq_306 {
	int32 u0;
	 DWORD u1;
	 LPCVOID u2;
	 LPVOID u3;
} Eq_306;

typedef union Eq_307 {
	word32 u0;
	 SIZE_T u1;
} Eq_307;

typedef union Eq_308 {
	Eq_849* u0;
	 DWORD u1;
} Eq_308;

typedef union Eq_309 {
	word32 u0;
	 DWORD u1;
} Eq_309;

typedef struct Eq_316 {
	word32 dw003C;	// 3C
} Eq_316;

typedef Eq_299 Eq_326Eq_307 Eq_326struct Eq_326 {
	Eq_299 * ptrFFFFFFD0;	// FFFFFFD0
	Eq_307 tFFFFFFD4;	// FFFFFFD4
} Eq_326;

typedef void (Eq_333)(Eq_316 *, Eq_316 *, Eq_306);

typedef  Eq_352[]struct Eq_352 {
	word32 dw0000;	// 0
	word32 dw0004;	// 4
	word16 a0008[];	// 8
} Eq_352;

typedef word32 (Eq_421)(Eq_423, Eq_424);

typedef union Eq_423 {
	word32 u0;
	 HMODULE u1;
} Eq_423;

typedef union Eq_424 {
	word32 u0;
	 LPCSTR u1;
} Eq_424;

typedef Eq_533 Eq_428Eq_307 Eq_428struct Eq_428 {
	word16 w0006;	// 6
	word16 w0014;	// 14
	Eq_533 t003C;	// 3C
	Eq_307 t0050;	// 50
} Eq_428;

typedef Eq_434 Eq_434struct Eq_434 {	// size: 40 28
	word32 dw000C;	// C
	word32 dw0010;	// 10
	word32 dw0014;	// 14
	Eq_434 t0028;	// 28
} Eq_434;

typedef Eq_496 Eq_465Eq_577 Eq_465Eq_306 Eq_465Eq_306 Eq_465Eq_308 Eq_465struct Eq_465 {
	Eq_496 tFFFFFFA8;	// FFFFFFA8
	Eq_577 tFFFFFFAC;	// FFFFFFAC
	Eq_306 tFFFFFFB0;	// FFFFFFB0
	Eq_306 tFFFFFFB4;	// FFFFFFB4
	Eq_308 tFFFFFFB8;	// FFFFFFB8
	word32 dwFFFFFFBC;	// FFFFFFBC
	word32 dwFFFFFFF0;	// FFFFFFF0
} Eq_465;

typedef code Eq_483Eq_306 Eq_483Eq_306 Eq_483struct Eq_483 {
	code * ptr0028;	// 28
	Eq_306 t0034;	// 34
	Eq_306 t0050;	// 50
	word32 dw0080;	// 80
} Eq_483;

typedef union Eq_496 {
	word32 u0;
	 HANDLE u1;
} Eq_496;

typedef Eq_496 (Eq_497)(Eq_499, Eq_500, Eq_501, Eq_502, Eq_306, Eq_504);

typedef union Eq_499 {
	word32 u0;
	 HANDLE u1;
} Eq_499;

typedef union Eq_500 {
	word32 u0;
	 LPSECURITY_ATTRIBUTES u1;
} Eq_500;

typedef union Eq_501 {
	word32 u0;
	 DWORD u1;
} Eq_501;

typedef union Eq_502 {
	word32 u0;
	 DWORD u1;
} Eq_502;

typedef union Eq_504 {
	word32 u0;
	 LPCSTR u1;
} Eq_504;

typedef union Eq_533 {
	int32 u0;
	uint32 u1;
} Eq_533;

typedef union Eq_554 {
	int32 u0;
	uint32 u1;
} Eq_554;

typedef Eq_560 Eq_560struct Eq_560 {	// size: 20 14
	word32 dw0000;	// 0
	word32 dw000C;	// C
	word32 dw0010;	// 10
	Eq_560 t0014;	// 14
} Eq_560;

typedef union Eq_577 {
	word32 u0;
	 DWORD u1;
} Eq_577;

typedef Eq_316 * (Eq_584)(Eq_496, Eq_577, Eq_306, Eq_589, Eq_590, Eq_306);

typedef union Eq_589 {
	word32 u0;
	 DWORD u1;
} Eq_589;

typedef union Eq_590 {
	word32 u0;
	 SIZE_T u1;
} Eq_590;

typedef Eq_603 Eq_603struct Eq_603 {	// size: 4 4
	word32 dw0000;	// 0
	Eq_603 t0004;	// 4
} Eq_603;

typedef Eq_604 Eq_604struct Eq_604 {	// size: 4 4
	word32 dw0000;	// 0
	Eq_604 t0004;	// 4
} Eq_604;

typedef word32 (Eq_606)(Eq_608);

typedef union Eq_608 {
	word32 u0;
	 LPCSTR u1;
} Eq_608;

typedef void (Eq_649)(Eq_316 *);

typedef word32 (Eq_668)(Eq_306);

typedef word32 (Eq_713)(Eq_306, Eq_590, Eq_717);

typedef union Eq_717 {
	word32 u0;
	 DWORD u1;
} Eq_717;

typedef word32 (Eq_771)(word32, word32);

typedef struct Eq_824 {
	word32 dw0008;	// 8
} Eq_824;

typedef word32 (Eq_829)(Eq_831, Eq_832, Eq_833);

typedef union Eq_831 {
	word32 u0;
	 HANDLE u1;
} Eq_831;

typedef union Eq_832 {
	word32 u0;
	 DWORD u1;
} Eq_832;

typedef union Eq_833 {
	word32 u0;
	 SIZE_T u1;
} Eq_833;

typedef Eq_831 (Eq_834)();

typedef struct Eq_849 {
	word32 dw003C;	// 3C
} Eq_849;

typedef DWORDLPVOIDBOOLstruct _SECURITY_ATTRIBUTES {
	DWORD;	// 0
	LPVOID;	// 4
	BOOL;	// 8
} Eq_851;

