// subject.h
// Generated on TIMESTAMP by decompiling from_pouet.net/with_source_340/ia32_com/subject.exe
// using Decompiler version VERSION

/*
// Equivalence classes ////////////
Eq_1: (struct "Globals" (FFFA0000 (ptr Eq_804) ptrFFFA0000))
	globals_t (in globals : (ptr (struct "Globals")))
Eq_3: (segment (0 (arr Eq_930) a0000) (4C4 (arr Eq_924) a04C4) (4C6 (arr Eq_928) a04C6) (4C8 (arr Eq_927) a04C8) (4CA Eq_861 t04CA) (4CE cups16 w04CE) (4D2 word16 w04D2) (4D4 Eq_651 t04D4) (4E5 (arr Eq_923) a04E5) (4E6 word16 w04E6) (4E8 byte b04E8) (4ED word16 w04ED) (4EF word16 w04EF) (4F3 (arr Eq_935) a04F3) (571 Eq_125 t0571) (575 word32 dw0575) (579 Eq_125 t0579) (57D Eq_125 t057D) (581 Eq_304 t0581) (5FF (arr Eq_176) a05FF) (603 (arr Eq_925) a0603) (62B Eq_258 t062B) (63F (arr Eq_929) a063F) (663 Eq_489 t0663) (667 Eq_125 t0667) (66B (arr Eq_933) a066B) (677 Eq_490 t0677))
	T_3 (in cs : selector)
	T_19 (in es_31 : selector)
	T_20 (in es : selector)
	T_132 (in ds : selector)
	T_141 (in ss : selector)
	T_857 (in ds : selector)
Eq_5: (union (bcu8 u0) ((ptr (struct (0 (arr Eq_922) a0000))) u1))
	T_5 (in bx_9 : word16)
	T_8 (in DPB(cs, bh_4 + 0x10, 8, 8) : word16)
	T_44 (in bx_113 : word16)
	T_62 (in bx_895 : word16)
	T_65 (in Mem127[es_31:di_121 + 0x0000:word16] : word16)
	T_80 (in bx_895 + 0x002D : word16)
	T_759 (in al_743 : byte)
	T_762 (in Mem752[bx_9:di_729 + 0x0000:byte] : byte)
	T_767 (in 0x00 : byte)
	T_770 (in Mem727[bx_9:di_729 + 0x0000:word16] : word16)

  Class: Eq_907
  DataType: (memptr (ptr Eq_3) Eq_907)
  OrigDataType: (memptr T_3 (struct (0 T_866 t0000)))
T_908: (in Mem804[cs:0x04CE:word16] : word16)
  Class: Eq_866
  DataType: cups16
  OrigDataType: word16
T_909: (in 0x0001 : word16)
  Class: Eq_909
  DataType: word16
  OrigDataType: word16
T_910: (in Mem804[cs:0x04CE:word16] + 0x0001 : word16)
  Class: Eq_866
  DataType: cups16
  OrigDataType: word16
T_911: (in Mem855[cs:0x04CE:word16] : word16)
  Class: Eq_866
  DataType: cups16
  OrigDataType: word16
T_912: (in cond(v54_854) : byte)
  Class: Eq_871
  DataType: byte
  OrigDataType: byte
T_913: (in 0x04F1 : word16)
  Class: Eq_55
  DataType: (memptr (ptr Eq_3) Eq_55)
  OrigDataType: word16
T_914: (in 0x04 : byte)
  Class: Eq_914
  DataType: byte
  OrigDataType: byte
T_915: (in DPB(cx_35, 0x04, 0, 8) : word16)
  Class: Eq_83
  DataType: word16
  OrigDataType: word16
T_916: (in al_852 : byte)
  Class: Eq_916
  DataType: byte
  OrigDataType: byte
T_917: (in bios_kbd_get_keystroke : ptr32)
  Class: Eq_917
  DataType: (ptr Eq_917)
  OrigDataType: (ptr (fn T_921 (T_920)))
T_918: (in signature of bios_kbd_get_keystroke : void)
  Class: Eq_917
  DataType: (ptr Eq_917)
  OrigDataType: 
T_919: (in alOut : ptr16)
  Class: Eq_919
  DataType: (ptr byte)
  OrigDataType: ptr16
T_920: (in out al_852 : ptr16)
  Class: Eq_919
  DataType: (ptr byte)
  OrigDataType: (ptr byte)
T_921: (in bios_kbd_get_keystroke(out al_852) : byte)
  Class: Eq_921
  DataType: byte
  OrigDataType: byte
T_922:
  Class: Eq_922
  DataType: Eq_922
  OrigDataType: (struct 0002 (0 T_29 t0000))
T_923:
  Class: Eq_923
  DataType: Eq_923
  OrigDataType: (struct 0001 (0 T_48 t0000))
T_924:
  Class: Eq_924
  DataType: Eq_924
  OrigDataType: (struct 0002 (0 T_159 t0000))
T_925:
  Class: Eq_925
  DataType: Eq_925
  OrigDataType: (struct 0004 (0 T_204 t0000))
T_926:
  Class: Eq_176
  DataType: Eq_176
  OrigDataType: (struct 0004 (0 word32 dw0000))
T_927:
  Class: Eq_927
  DataType: Eq_927
  OrigDataType: (struct 0002 (0 T_265 t0000))
T_928:
  Class: Eq_928
  DataType: Eq_928
  OrigDataType: (struct 0004 (0 T_296 t0000))
T_929:
  Class: Eq_929
  DataType: Eq_929
  OrigDataType: (struct 0014 (0 T_327 t0000))
T_930:
  Class: Eq_930
  DataType: Eq_930
  OrigDataType: (struct 0004 (0 T_424 t0000))
T_931:
  Class: Eq_930
  DataType: Eq_930
  OrigDataType: (struct 0004 (0 T_458 t0000))
T_932:
  Class: Eq_930
  DataType: Eq_930
  OrigDataType: (struct 0010 (0 Eq_304 t0000))
T_933:
  Class: Eq_933
  DataType: Eq_933
  OrigDataType: (struct 0004 (0 T_520 t0000))
T_934:
  Class: Eq_933
  DataType: Eq_933
  OrigDataType: (struct 0004 (0 T_550 t0000))
T_935:
  Class: Eq_935
  DataType: Eq_935
  OrigDataType: (struct 0004 (0 T_640 t0000))
T_936:
  Class: Eq_935
  DataType: Eq_935
  OrigDataType: (struct 0004 (0 T_705 t0000))
T_937:
  Class: Eq_922
  DataType: Eq_922
  OrigDataType: (struct 0002 (0 T_803 t0000))
*/
typedef  Eq_1struct Globals {
	 * ptrFFFA0000;	// FFFA0000
} Eq_1;

typedef  Eq_3[][][][][][][][][][]struct  {
	 a0000[];	// 0
	 a04C4[];	// 4C4
	 a04C6[];	// 4C6
	 a04C8[];	// 4C8
	 t04CA;	// 4CA
	cups16 w04CE;	// 4CE
	word16 w04D2;	// 4D2
	 t04D4;	// 4D4
	 a04E5[];	// 4E5
	word16 w04E6;	// 4E6
	byte b04E8;	// 4E8
	word16 w04ED;	// 4ED
	word16 w04EF;	// 4EF
	 a04F3[];	// 4F3
	 t0571;	// 571
	word32 dw0575;	// 575
	 t0579;	// 579
	 t057D;	// 57D
	 t0581;	// 581
	 a05FF[];	// 5FF
	 a0603[];	// 603
	 t062B;	// 62B
	 a063F[];	// 63F
	 t0663;	// 663
	 t0667;	// 667
	 a066B[];	// 66B
	 t0677;	// 677
} Eq_3;

typedef union  {
	bcu8 u0;
	struct <anonymous>* u1;
} Eq_5;

typedef struct  {	// size: 2 2
	word16 w0000;	// 0
} Eq_13;

typedef struct  {	// size: 1 1
	byte b0000;	// 0
} Eq_21;

typedef void (Eq_36)(byte);

typedef struct  {	// size: 2 2
	word16 w0000;	// 0
} Eq_55;

typedef  Eq_59struct  {
	 t0000;	// 0
} Eq_59;

typedef void (Eq_96)(word16, );

typedef union  {
	bcu8 u0;
	ui16 u1;
} Eq_98;

typedef void (Eq_106)(word16, byte);

typedef void (Eq_109)(word16, byte);

typedef void (Eq_113)(word16, byte);

typedef  Eq_120struct  {	// size: 4 4
	 t0000;	// 0
} Eq_120;

typedef struct  {	// size: 2 2
	word16 w0000;	// 0
} Eq_122;

typedef union  {
	int32 u0;
	real16 u1;
	real32 u2;
	real64 u3;
	word16 u4;
} Eq_125;

typedef union  {
	real16 u0;
	real32 u1;
	real64 u2;
} Eq_131;

typedef  Eq_142struct  {
	 t0000;	// 0
} Eq_142;

typedef union  {
	real16 u0;
	real64 u1;
} Eq_144;

typedef  Eq_161struct  {
	 t0000;	// 0
} Eq_161;

typedef  Eq_165struct  {
	 t0000;	// 0
} Eq_165;

typedef  Eq_172struct  {
	 t0000;	// 0
} Eq_172;

typedef  Eq_174struct  {
	 t0000;	// 0
} Eq_174;

typedef union  {
	real32 u0;
	real64 u1;
	struct <anonymous> u2;
} Eq_176;

typedef  Eq_177struct  {
	 t0000;	// 0
} Eq_177;

typedef  Eq_179struct  {	// size: 24 18
	 t0000;	// 0
} Eq_179;

typedef  Eq_181struct  {	// size: 4 4
	 t0000;	// 0
} Eq_181;

typedef union  {
	real16 u0;
	real32 u1;
	real64 u2;
} Eq_191;

typedef union  {
	real16 u0;
	real32 u1;
} Eq_194;

typedef struct  {	// size: 4 4
	word32 dw0000;	// 0
} Eq_217;

typedef struct  {	// size: 4 4
	word32 dw0000;	// 0
} Eq_219;

typedef struct  {	// size: 2 2
	word16 w0000;	// 0
} Eq_254;

typedef union  {
	real16 u0;
	real32 u1;
	real64 u2;
} Eq_258;

typedef  Eq_267struct  {
	 t0000;	// 0
} Eq_267;

typedef struct  {
	word16 w0000;	// 0
} Eq_269;

typedef  Eq_272struct  {
	 t0000;	// 0
} Eq_272;

typedef union  {
	real16 u0;
	real64 u1;
} Eq_274;

typedef  Eq_286struct  {
	 t0000;	// 0
} Eq_286;

typedef struct  {	// size: 4 4
	int16 w0000;	// 0
} Eq_293;

typedef union  {
	real16 u0;
	real64 u1;
} Eq_297;

typedef  Eq_298struct  {	// size: 24 18
	 t0000;	// 0
} Eq_298;

typedef union  {
	real16 u0;
	real32 u1;
} Eq_301;

typedef  Eq_303struct  {
	 t0000;	// 0
} Eq_303;

typedef union  {
	int32 u0;
	real16 u1;
	real32 u2;
	real64 u3;
	cups16 u4;
} Eq_304;

typedef  Eq_306struct  {
	 t0000;	// 0
} Eq_306;

typedef  Eq_320struct  {	// size: 20 14
	 t0000;	// 0
} Eq_320;

typedef  Eq_323struct  {
	 t0000;	// 0
} Eq_323;

typedef  Eq_341struct  {
	 t0000;	// 0
} Eq_341;

typedef  Eq_365struct  {
	 t0000;	// 0
} Eq_365;

typedef union  {
	real16 u0;
	real32 u1;
} Eq_378;

typedef  Eq_379struct  {
	 t0000;	// 0
} Eq_379;

typedef union  {
	real16 u0;
	real32 u1;
} Eq_382;

typedef  Eq_399struct  {
	 t0000;	// 0
} Eq_399;

typedef  Eq_409struct  {
	 t0000;	// 0
} Eq_409;

typedef  Eq_425struct  {
	 t0000;	// 0
} Eq_425;

typedef  Eq_428struct  {
	 t0000;	// 0
} Eq_428;

typedef  Eq_459struct  {
	 t0000;	// 0
} Eq_459;

typedef  Eq_482struct  {
	 t0000;	// 0
} Eq_482;

typedef  Eq_484struct  {
	 t0000;	// 0
} Eq_484;

typedef  Eq_486struct  {
	 t0000;	// 0
} Eq_486;

typedef  Eq_488struct  {
	 t0000;	// 0
} Eq_488;

typedef union  {
	real16 u0;
	real32 u1;
} Eq_489;

typedef union  {
	real16 u0;
	real32 u1;
} Eq_490;

typedef  Eq_491struct  {
	 t0000;	// 0
} Eq_491;

typedef union  {
	int8 u0;
	uint8 u1;
} Eq_493;

typedef  Eq_509struct  {
	 t0000;	// 0
} Eq_509;

typedef  Eq_521struct  {
	 t0000;	// 0
} Eq_521;

typedef  Eq_524struct  {
	 t0000;	// 0
} Eq_524;

typedef  Eq_526struct  {
	 t0000;	// 0
} Eq_526;

typedef  Eq_529struct  {
	 t0000;	// 0
} Eq_529;

typedef  Eq_532struct  {
	 t0000;	// 0
} Eq_532;

typedef  Eq_534struct  {
	 t0000;	// 0
} Eq_534;

typedef  Eq_541struct  {
	 t0000;	// 0
} Eq_541;

typedef  Eq_562struct  {
	 t0000;	// 0
} Eq_562;

typedef  Eq_568struct  {
	 t0000;	// 0
} Eq_568;

typedef  Eq_577struct  {	// size: 4 4
	 t0000;	// 0
} Eq_577;

typedef  Eq_581struct  {
	 t0000;	// 0
} Eq_581;

typedef union  {
	real16 u0;
	real64 u1;
} Eq_585;

typedef  Eq_586struct  {
	 t0000;	// 0
} Eq_586;

typedef  Eq_589struct  {
	 t0000;	// 0
} Eq_589;

typedef union  {
	real16 u0;
	real64 u1;
} Eq_591;

typedef  Eq_602struct  {
	 t0000;	// 0
} Eq_602;

typedef  Eq_604struct  {
	 t0000;	// 0
} Eq_604;

typedef  Eq_608struct  {
	 t0000;	// 0
} Eq_608;

typedef struct  {	// size: 4 4
	word16 w0000;	// 0
} Eq_610;

typedef struct  {
	word16 w0000;	// 0
	word16 w0140;	// 140
} Eq_620;

typedef  Eq_641struct  {
	 t0000;	// 0
} Eq_641;

typedef struct  {
	word16 w0000;	// 0
} Eq_643;

typedef struct  {
	word32 dw0000;	// 0
} Eq_647;

typedef union  {
	real16 u0;
	real64 u1;
} Eq_649;

typedef  Eq_650struct  {
	 t0000;	// 0
} Eq_650;

typedef union  {
	real16 u0;
	real32 u1;
} Eq_651;

typedef struct  {
	word32 dw0000;	// 0
} Eq_652;

typedef union  {
	real16 u0;
	real64 u1;
} Eq_654;

typedef union  {
	real16 u0;
	real64 u1;
} Eq_656;

typedef  (Eq_657)();

typedef union  {
	real16 u0;
	real64 u1;
} Eq_659;

typedef  (Eq_660)();

typedef  Eq_662struct  {
	 t0000;	// 0
} Eq_662;

typedef union  {
	real16 u0;
	real64 u1;
} Eq_664;

typedef  Eq_666struct  {
	 t0000;	// 0
} Eq_666;

typedef  Eq_669struct  {
	 t0000;	// 0
} Eq_669;

typedef union  {
	real16 u0;
	real64 u1;
} Eq_671;

typedef struct  {
	word16 w0000;	// 0
} Eq_672;

typedef union  {
	real16 u0;
	real64 u1;
} Eq_674;

typedef union  {
	real16 u0;
	real64 u1;
} Eq_675;

