// subject.h
// Generated on 5/4/2015 12:46:19 AM by decompiling malware_via_email/malware_0183/ia32_pe/subject.exe
// using Decompiler version 0.4.2.0.

/*
// Equivalence classes ////////////
Eq_1: (struct "Globals" (5A4D (arr Eq_516) a5A4D) (400000 Eq_2 t400000) (402000 word32 dw402000) (4020B0 word32 dw4020B0) (4022CC (arr byte) a4022CC) (4022CD (arr byte) a4022CD) (4023C0 (ptr Eq_2) ptr4023C0) (4023C4 word32 dw4023C4) (4023C8 (ptr Eq_57) ptr4023C8) (4023CC word32 dw4023CC) (4023D0 Eq_103 t4023D0) (4023D4 ui32 dw4023D4) (4023D8 (ptr Eq_57) ptr4023D8) (4023DC uint32 dw4023DC) (4023E0 int32 dw4023E0) (4023E8 (ptr Eq_57) ptr4023E8) (4023EC word32 dw4023EC) (4023F0 Eq_113 t4023F0) (4023F4 Eq_113 t4023F4) (4023F8 Eq_338 t4023F8) (4023FC Eq_338 t4023FC) (402400 Eq_113 t402400) (402404 Eq_394 t402404) (402408 (ptr code) ptr402408) (40240C (ptr code) ptr40240C) (402414 byte b402414))
	globals_t (in globals : (ptr (struct "Globals")))
Eq_2: (struct "Eq_2" (4074 Eq_103 t4074))
	T_2 (in 0x00400000 : ptr32)
	T_4 (in Mem6[0x004023C0:word32] : word32)
	T_100 (in eax_13 : (ptr Eq_2))
	T_102 (in Mem0[0x004023C0:word32] : word32)
Eq_5: (fn void ((ptr Eq_7)))
	T_5 (in fn004013DA : ptr32)
	T_6 (in signature of fn004013DA : void)
Eq_7: (segment "Eq_7" (0 (ptr Eq_396) ptr0000))
	T_7 (in fs : (ptr Eq_7))
	T_8 (in fs : (ptr Eq_7))
Eq_10: (fn void ())
	T_10 (in fn0040136C : ptr32)
	T_11 (in signature of fn0040136C : void)
Eq_13: (fn void ())
	T_13 (in fn00401164 : ptr32)

  OrigDataType: 
T_493: (in fn00401332() : void)
  Class: Eq_493
  DataType: void
  OrigDataType: void
T_494: (in fn00401348 : ptr32)
  Class: Eq_472
  DataType: (ptr Eq_472)
  OrigDataType: (ptr (fn T_495 ()))
T_495: (in fn00401348() : void)
  Class: Eq_474
  DataType: void
  OrigDataType: void
T_496: (in fn004012FC : ptr32)
  Class: Eq_475
  DataType: (ptr Eq_475)
  OrigDataType: (ptr (fn T_497 ()))
T_497: (in fn004012FC() : void)
  Class: Eq_477
  DataType: void
  OrigDataType: void
T_498: (in fn0040130A : ptr32)
  Class: Eq_468
  DataType: (ptr Eq_468)
  OrigDataType: (ptr (fn T_499 (T_478)))
T_499: (in fn0040130A(dwLoc0C_55) : void)
  Class: Eq_471
  DataType: void
  OrigDataType: void
T_500: (in fn00401332 : ptr32)
  Class: Eq_491
  DataType: (ptr Eq_491)
  OrigDataType: (ptr (fn T_501 ()))
T_501: (in fn00401332() : void)
  Class: Eq_493
  DataType: void
  OrigDataType: void
T_502: (in fn004012A7 : ptr32)
  Class: Eq_502
  DataType: (ptr Eq_502)
  OrigDataType: (ptr (fn T_504 ()))
T_503: (in signature of fn004012A7 : void)
  Class: Eq_502
  DataType: (ptr Eq_502)
  OrigDataType: 
T_504: (in fn004012A7() : void)
  Class: Eq_504
  DataType: void
  OrigDataType: void
T_505: (in 0x004023D4 : ptr32)
  Class: Eq_505
  DataType: (ptr ui32)
  OrigDataType: (ptr (struct (0 T_506 t0000)))
T_506: (in Mem52[0x004023D4:word32] : word32)
  Class: Eq_110
  DataType: ui32
  OrigDataType: word32
T_507: (in 0x004023C4 : ptr32)
  Class: Eq_507
  DataType: (ptr word32)
  OrigDataType: (ptr (struct (0 T_508 t0000)))
T_508: (in Mem52[0x004023C4:word32] : word32)
  Class: Eq_40
  DataType: word32
  OrigDataType: word32
T_509: (in globals->dw4023D4 - globals->dw4023C4 : word32)
  Class: Eq_46
  DataType: int32
  OrigDataType: int32
T_510: (in 0x004023E0 : ptr32)
  Class: Eq_510
  DataType: (ptr int32)
  OrigDataType: (ptr (struct (0 T_511 t0000)))
T_511: (in Mem52[0x004023E0:word32] : word32)
  Class: Eq_46
  DataType: int32
  OrigDataType: int32
T_512: (in globals->dw4023D4 - globals->dw4023C4 < globals->dw4023E0 : bool)
  Class: Eq_512
  DataType: bool
  OrigDataType: bool
T_513:
  Class: Eq_259
  DataType: byte
  OrigDataType: (struct 0001 (0 (union (byte u0) (byte u1) (byte u2)) u0000))
T_514:
  Class: Eq_206
  DataType: byte
  OrigDataType: (struct 0001 (0 byte b0000))
T_515:
  Class: Eq_259
  DataType: byte
  OrigDataType: (struct 0001 (0 T_326 t0000))
T_516:
  Class: Eq_516
  DataType: Eq_516
  OrigDataType: (struct 10000 (0 T_406 t0000))
T_517:
  Class: Eq_517
  DataType: Eq_517
  OrigDataType: 
T_518:
  Class: Eq_518
  DataType: Eq_518
  OrigDataType: 
T_519:
  Class: Eq_519
  DataType: Eq_519
  OrigDataType: 
T_520:
  Class: Eq_520
  DataType: Eq_520
  OrigDataType: 
T_521:
  Class: Eq_521
  DataType: Eq_521
  OrigDataType: 
T_522:
  Class: Eq_522
  DataType: Eq_522
  OrigDataType: 
T_523:
  Class: Eq_523
  DataType: int32
  OrigDataType: 
*/
typedef Eq_516 Eq_1[]Eq_2[][]Eq_2Eq_57Eq_103Eq_57Eq_57Eq_113Eq_113Eq_338Eq_338Eq_113Eq_394codecodestruct Globals {
	Eq_516 a5A4D[];	// 5A4D
	Eq_2 t400000;	// 400000
	word32 dw402000;	// 402000
	word32 dw4020B0;	// 4020B0
	byte a4022CC[];	// 4022CC
	byte a4022CD[];	// 4022CD
	Eq_2 * ptr4023C0;	// 4023C0
	word32 dw4023C4;	// 4023C4
	Eq_57 * ptr4023C8;	// 4023C8
	word32 dw4023CC;	// 4023CC
	Eq_103 t4023D0;	// 4023D0
	ui32 dw4023D4;	// 4023D4
	Eq_57 * ptr4023D8;	// 4023D8
	uint32 dw4023DC;	// 4023DC
	int32 dw4023E0;	// 4023E0
	Eq_57 * ptr4023E8;	// 4023E8
	word32 dw4023EC;	// 4023EC
	Eq_113 t4023F0;	// 4023F0
	Eq_113 t4023F4;	// 4023F4
	Eq_338 t4023F8;	// 4023F8
	Eq_338 t4023FC;	// 4023FC
	Eq_113 t402400;	// 402400
	Eq_394 t402404;	// 402404
	code * ptr402408;	// 402408
	code * ptr40240C;	// 40240C
	byte b402414;	// 402414
} Eq_1;

typedef Eq_103 Eq_2struct Eq_2 {
	Eq_103 t4074;	// 4074
} Eq_2;

typedef void (Eq_5)(Eq_7 *);

typedef Eq_396 Eq_7struct Eq_7 {
	Eq_396 * ptr0000;	// 0
} Eq_7;

typedef void (Eq_10)();

typedef void (Eq_13)();

typedef void (Eq_16)();

typedef Eq_19 Eq_19struct Eq_19 {	// size: 1 1
	byte b0000;	// 0
	Eq_19 t0001;	// 1
} Eq_19;

typedef Eq_21 Eq_21struct Eq_21 {	// size: 1 1
	byte b0000;	// 0
	Eq_21 t0001;	// 1
} Eq_21;

typedef Eq_55 Eq_55struct Eq_55 {	// size: 4 4
	word32 dw0000;	// 0
	Eq_55 t0004;	// 4
} Eq_55;

typedef Eq_517 Eq_57struct Eq_57 {	// size: 1 1
	byte b0000;	// 0
	Eq_517 u0001;	// 1
} Eq_57;

typedef word32 (Eq_87)(word32);

typedef union Eq_103 {
	word32 u0;
	 SIZE_T u1;
} Eq_103;

typedef union Eq_113 {
	word32 u0;
	 HANDLE u1;
} Eq_113;

typedef Eq_113 (Eq_114)(Eq_116, Eq_117, Eq_118);

typedef union Eq_116 {
	word32 u0;
	 DWORD u1;
} Eq_116;

typedef union Eq_117 {
	word32 u0;
	 SIZE_T u1;
} Eq_117;

typedef union Eq_118 {
	word32 u0;
	 SIZE_T u1;
} Eq_118;

typedef Eq_57 * (Eq_126)(Eq_113, Eq_129, Eq_103);

typedef union Eq_129 {
	word32 u0;
	 DWORD u1;
} Eq_129;

typedef void (Eq_142)(Eq_57 *, word32, Eq_103);

typedef Eq_179 Eq_179struct Eq_179 {	// size: 160 A0
	byte b0000;	// 0
	Eq_179 t00A0;	// A0
} Eq_179;

typedef Eq_223 Eq_208struct Eq_208 {
	byte b0000;	// 0
	Eq_223 t0001;	// 1
} Eq_208;

typedef Eq_221 Eq_221struct Eq_221 {	// size: 1 1
	byte b0000;	// 0
	Eq_221 t0001;	// 1
} Eq_221;

typedef Eq_223 Eq_223struct Eq_223 {	// size: 1 1
	byte b0000;	// 0
	Eq_223 t0001;	// 1
} Eq_223;

typedef void (Eq_231)();

typedef Eq_262 Eq_262struct Eq_262 {	// size: 1 1
	byte b0000;	// 0
	Eq_262 t0001;	// 1
} Eq_262;

typedef Eq_270 Eq_270struct Eq_270 {	// size: 1 1
	byte b0000;	// 0
	Eq_270 t0001;	// 1
} Eq_270;

typedef struct Eq_304 {
	byte b4022CC;	// 4022CC
} Eq_304;

typedef Eq_312 Eq_312struct Eq_312 {	// size: 1 1
	byte b0000;	// 0
	Eq_312 t0001;	// 1
} Eq_312;

typedef Eq_322 Eq_322struct Eq_322 {	// size: 1 1
	byte b0000;	// 0
	Eq_322 t0001;	// 1
} Eq_322;

typedef union Eq_338 {
	word32 u0;
	 HANDLE u1;
} Eq_338;

typedef Eq_338 (Eq_339)(Eq_341, Eq_342, Eq_343, Eq_344, Eq_345, Eq_346);

typedef union Eq_341 {
	word32 u0;
	 LPSECURITY_ATTRIBUTES u1;
} Eq_341;

typedef union Eq_342 {
	word32 u0;
	 SIZE_T u1;
} Eq_342;

typedef union Eq_343 {
	word32 u0;
	 LPTHREAD_START_ROUTINE u1;
} Eq_343;

typedef union Eq_344 {
	word32 u0;
	 LPVOID u1;
} Eq_344;

typedef union Eq_345 {
	word32 u0;
	 DWORD u1;
} Eq_345;

typedef union Eq_346 {
	word32 u0;
	 LPDWORD u1;
} Eq_346;

typedef word32 (Eq_363)(Eq_338, Eq_366);

typedef union Eq_366 {
	ptr32 u0;
	 LPCONTEXT u1;
} Eq_366;

typedef word32 (Eq_374)(Eq_338, CONTEXT *);

typedef CONTEXT;

typedef word32 (Eq_382)(Eq_338);

typedef word32 (Eq_388)(Eq_338);

typedef union Eq_394 {
	Eq_522* u0;
	 HMODULE u1;
} Eq_394;

typedef struct Eq_396 {
	word32 dw0004;	// 4
} Eq_396;

typedef code * (Eq_411)(Eq_394, Eq_414);

typedef union Eq_414 {
	ptr32 u0;
	 LPCSTR u1;
} Eq_414;

typedef struct Eq_420 {
	word32 dwFFFFFFF8;	// FFFFFFF8
} Eq_420;

typedef void (Eq_458)();

typedef int32 (Eq_465)();

typedef void (Eq_468)(int32);

typedef void (Eq_472)();

typedef void (Eq_475)();

typedef void (Eq_491)();

typedef void (Eq_502)();

typedef struct Eq_516 {	// size: 65536 10000
	word16 w0000;	// 0
} Eq_516;

typedef union Eq_517 {
	Eq_57 u0;
	Eq_179 u1;
} Eq_517;

typedef DWORDLPVOIDBOOLstruct _SECURITY_ATTRIBUTES {
	DWORD;	// 0
	LPVOID;	// 4
	BOOL;	// 8
} Eq_518;

typedef DWORDDWORDDWORDDWORDDWORDDWORDDWORDBYTE Eq_519[80]DWORDstruct _FLOATING_SAVE_AREA {
	DWORD;	// 0
	DWORD;	// 4
	DWORD;	// 8
	DWORD;	// C
	DWORD;	// 10
	DWORD;	// 14
	DWORD;	// 18
	BYTE RegisterArea[80];	// 20
	DWORD;	// 70
} Eq_519;

typedef DWORDDWORDDWORDDWORDDWORDDWORDDWORDFLOATING_SAVE_AREADWORDDWORDDWORDDWORDDWORDDWORDDWORDDWORDDWORDDWORDDWORDDWORDDWORDDWORDDWORDDWORDBYTE Eq_520[512]struct _CONTEXT {
	DWORD;	// 0
	DWORD;	// 4
	DWORD;	// 8
	DWORD;	// C
	DWORD;	// 10
	DWORD;	// 14
	DWORD;	// 18
	FLOATING_SAVE_AREA;	// 20
	DWORD;	// 90
	DWORD;	// 94
	DWORD;	// 98
	DWORD;	// 9C
	DWORD;	// A0
	DWORD;	// A4
	DWORD;	// A8
	DWORD;	// AC
	DWORD;	// B0
	DWORD;	// B4
	DWORD;	// B8
	DWORD;	// BC
	DWORD;	// C0
	DWORD;	// C4
	DWORD;	// C8
	DWORD;	// CC
	BYTE ExtendedRegisters[512];	// D0
} Eq_520;

typedef DWORDDWORDDWORDDWORDDWORDDWORDDWORDBYTE Eq_521[80]DWORDstruct _FLOATING_SAVE_AREA {
	DWORD;	// 0
	DWORD;	// 4
	DWORD;	// 8
	DWORD;	// C
	DWORD;	// 10
	DWORD;	// 14
	DWORD;	// 18
	BYTE RegisterArea[80];	// 20
	DWORD;	// 70
} Eq_521;

typedef struct Eq_522 {	// size: 65536 10000
	word16 w0000;	// 0
} Eq_522;

