// subject.h
// Generated on TIMESTAMP by decompiling malware_via_email/malware_0037/ia32_pe/subject.exe
// using Decompiler version VERSION

/*
// Equivalence classes ////////////
Eq_1: (struct "Globals")
	globals_t (in globals : (ptr (struct "Globals")))
Eq_3: (fn void ((ptr Eq_5), (ptr Eq_5), word32))
	T_3 (in fn00409006 : ptr32)
	T_4 (in signature of fn00409006 : void)
	T_12 (in fn00409006 : ptr32)
Eq_5: (struct 0001 (0 Eq_55 t0000) (1 Eq_5 t0001))
	T_5 (in edx : word32)
	T_6 (in ebx : word32)
	T_8 (in edx : word32)
	T_9 (in ebx : word32)
	T_83 (in Mem57[dwArg00 + 0x00000561:word32] : word32)
	T_87 (in Mem57[dwArg00 + 0x00000561:word32] + Mem57[dwArg00 + 0x00000585:word32] : word32)
	T_90 (in Mem490[dwArg00 + 0x00000561:word32] : word32)
	T_145 (in edi_135 : word32)
	T_150 (in eax_127 + Mem110[dwArg00 + 0x00000585:word32] : word32)
	T_179 (in Mem148[esp_145 - 0x00000004:word32] : word32)
	T_180 (in esi_149 : word32)
	T_185 (in edi_159 : word32)
	T_187 (in Mem148[esp_145 - 0x00000004:word32] : word32)
	T_190 (in Mem162[esp_145 - 0x00000004:word32] : word32)
	T_193 (in Mem164[esp_145 - 0x00000008:word32] : word32)
	T_208 (in edi_170 : word32)
	T_211 (in Mem166[esp_145 - 0x00000004:word32] : word32)
	T_214 (in Mem176[esp_145 - 0x00000004:word32] : word32)
	T_217 (in Mem178[esp_145 - 0x00000008:word32] : word32)
	T_233 (in esi_149 + 0x00000001 : word32)
	T_277 (in Mem189[esp_145 - 0x00000008:word32] : word32)
	T_280 (in Mem189[esp_145 - 0x00000004:word32] : word32)

T_1147: (in 0x00000000 : word32)
  Class: Eq_1147
  DataType: word32
  OrigDataType: word32
T_1148: (in esi_460 + 0x00000000 : word32)
  Class: Eq_1148
  DataType: word32
  OrigDataType: word32
T_1149: (in Mem58[esi_460 + 0x00000000:byte] : byte)
  Class: Eq_793
  DataType: uint8
  OrigDataType: byte
T_1150: (in 0x00000000 : word32)
  Class: Eq_1150
  DataType: word32
  OrigDataType: word32
T_1151: (in edi_179 + 0x00000000 : word32)
  Class: Eq_1151
  DataType: word32
  OrigDataType: word32
T_1152: (in Mem466[edi_179 + 0x00000000:byte] : byte)
  Class: Eq_793
  DataType: uint8
  OrigDataType: byte
T_1153: (in 0x00000001 : word32)
  Class: Eq_1153
  DataType: word32
  OrigDataType: word32
T_1154: (in esi_460 + 0x00000001 : word32)
  Class: Eq_1145
  DataType: (ptr Eq_1145)
  OrigDataType: word32
T_1155: (in 0x00000001 : word32)
  Class: Eq_1155
  DataType: word32
  OrigDataType: word32
T_1156: (in edi_179 + 0x00000001 : word32)
  Class: Eq_786
  DataType: (ptr Eq_786)
  OrigDataType: word32
T_1157: (in 0x00000001 : word32)
  Class: Eq_1157
  DataType: word32
  OrigDataType: word32
T_1158: (in ecx_456 - 0x00000001 : word32)
  Class: Eq_1142
  DataType: word32
  OrigDataType: word32
T_1159: (in 0x00000000 : word32)
  Class: Eq_1142
  DataType: word32
  OrigDataType: word32
T_1160: (in ecx_456 == 0x00000000 : bool)
  Class: Eq_1160
  DataType: bool
  OrigDataType: bool
T_1161: (in esi_438 : word32)
  Class: Eq_1161
  DataType: (ptr Eq_1161)
  OrigDataType: (ptr (struct 0001 (0 T_1165 t0000)))
T_1162: (in edi_179 - eax_394 : word32)
  Class: Eq_1161
  DataType: (ptr Eq_1161)
  OrigDataType: word32
T_1163: (in 0x00000000 : word32)
  Class: Eq_1163
  DataType: word32
  OrigDataType: word32
T_1164: (in esi_438 + 0x00000000 : word32)
  Class: Eq_1164
  DataType: word32
  OrigDataType: word32
T_1165: (in Mem58[esi_438 + 0x00000000:byte] : byte)
  Class: Eq_793
  DataType: uint8
  OrigDataType: byte
T_1166: (in 0x00000000 : word32)
  Class: Eq_1166
  DataType: word32
  OrigDataType: word32
T_1167: (in edi_179 + 0x00000000 : word32)
  Class: Eq_1167
  DataType: word32
  OrigDataType: word32
T_1168: (in Mem444[edi_179 + 0x00000000:byte] : byte)
  Class: Eq_793
  DataType: uint8
  OrigDataType: byte
T_1169: (in 0x00000001 : word32)
  Class: Eq_1169
  DataType: word32
  OrigDataType: word32
T_1170: (in esi_438 + 0x00000001 : word32)
  Class: Eq_1161
  DataType: (ptr Eq_1161)
  OrigDataType: word32
T_1171: (in 0x00000001 : word32)
  Class: Eq_1171
  DataType: word32
  OrigDataType: word32
T_1172: (in edi_179 + 0x00000001 : word32)
  Class: Eq_786
  DataType: (ptr Eq_786)
  OrigDataType: word32
T_1173: (in 0x00000001 : word32)
  Class: Eq_1173
  DataType: word32
  OrigDataType: word32
T_1174: (in ecx_398 - 0x00000001 : word32)
  Class: Eq_1031
  DataType: ui32
  OrigDataType: word32
T_1175: (in 0x00000000 : word32)
  Class: Eq_1031
  DataType: ui32
  OrigDataType: word32
T_1176: (in ecx_398 == 0x00000000 : bool)
  Class: Eq_1176
  DataType: bool
  OrigDataType: bool
*/
typedef struct Globals {
} Eq_1;

typedef void (Eq_3)( *,  *, word32);

typedef  Eq_5 Eq_5struct  {	// size: 1 1
	 t0000;	// 0
	 t0001;	// 1
} Eq_5;

typedef  Eq_15 Eq_15 Eq_15 Eq_15 Eq_15struct  {	// size: 4 4
	word32 dwFFFFFFE4;	// FFFFFFE4
	word32 dwFFFFFFE8;	// FFFFFFE8
	 * ptrFFFFFFEC;	// FFFFFFEC
	word32 dwFFFFFFF0;	// FFFFFFF0
	 * ptrFFFFFFF4;	// FFFFFFF4
	 * ptrFFFFFFF8;	// FFFFFFF8
	 * ptrFFFFFFFC;	// FFFFFFFC
	 t0000;	// 0
	word32 dw001C;	// 1C
} Eq_15;

typedef struct  {
	word32 dw05AD;	// 5AD
} Eq_19;

typedef  Eq_20 Eq_20 Eq_20 Eq_20 Eq_20 Eq_20 Eq_20 Eq_20code Eq_20struct  {
	byte b00CD;	// CD
	 * ptr0233;	// 233
	word32 dw050E;	// 50E
	byte b0536;	// 536
	byte b0538;	// 538
	 t0539;	// 539
	 t053D;	// 53D
	word32 dw0541;	// 541
	word32 dw0545;	// 545
	 * ptr054D;	// 54D
	word32 dw0551;	// 551
	word32 dw0555;	// 555
	word32 dw0559;	// 559
	 t055D;	// 55D
	 * ptr0561;	// 561
	word32 dw0565;	// 565
	word32 dw0569;	// 569
	 t056D;	// 56D
	word32 dw0581;	// 581
	 * ptr0585;	// 585
	word32 dw0589;	// 589
	code * ptr05B3;	// 5B3
} Eq_20;

typedef  Eq_33 Eq_33 Eq_33struct  {
	 * ptr0000;	// 0
	 t0004;	// 4
	 * ptr0010;	// 10
} Eq_33;

typedef union  {
	byte u0;
	struct <anonymous>* u1;
} Eq_55;

typedef void (Eq_73)();

typedef  Eq_111struct  {	// size: 4 4
	word32 dw0000;	// 0
	 t0004;	// 4
} Eq_111;

typedef  Eq_117struct  {
	 tFFFFFFF8;	// FFFFFFF8
	word32 dwFFFFFFFC;	// FFFFFFFC
	word32 dw0000;	// 0
} Eq_117;

typedef void (Eq_136)();

typedef  Eq_152struct  {
	word32 dw0000;	// 0
	word32 dw0004;	// 4
	 t0008;	// 8
} Eq_152;

typedef  Eq_170 Eq_170 Eq_170 Eq_170struct  {
	 tFFFFFFF4;	// FFFFFFF4
	 * ptrFFFFFFF8;	// FFFFFFF8
	 * ptrFFFFFFFC;	// FFFFFFFC
	 * ptr0000;	// 0
} Eq_170;

typedef word32 (Eq_201)(word32, word32);

typedef  Eq_221 Eq_221 Eq_221 Eq_221 Eq_221 Eq_221 Eq_221struct  {
	word16 w0000;	// 0
	 t0001;	// 1
	 t0001;	// 1
	 t0001;	// 1
	 t0002;	// 2
	 t0002;	// 2
	 t0005;	// 5
	 t0006;	// 6
} Eq_221;

typedef struct  {
	word32 dwFFFFFFE8;	// FFFFFFE8
	word32 dwFFFFFFEC;	// FFFFFFEC
	word32 dwFFFFFFF0;	// FFFFFFF0
	word32 dwFFFFFFF4;	// FFFFFFF4
	word32 dwFFFFFFF8;	// FFFFFFF8
	word32 dwFFFFFFFC;	// FFFFFFFC
	word32 dw0000;	// 0
} Eq_240;

typedef struct  {
	word32 dw0000;	// 0
} Eq_300;

typedef struct  {
	word32 dw0000;	// 0
} Eq_305;

typedef struct  {
	word32 dw0000;	// 0
} Eq_317;

typedef struct  {
	word32 dw0000;	// 0
} Eq_322;

typedef  Eq_379struct  {
	word32 dw0000;	// 0
	 t0004;	// 4
} Eq_379;

typedef  * (Eq_402)(word32,  *,  *);

typedef struct  {
	word32 dw058B;	// 58B
} Eq_405;

typedef void (Eq_437)();

typedef void (Eq_482)();

typedef  Eq_543struct  {
	word16 w0000;	// 0
	 t0002;	// 2
} Eq_543;

typedef  Eq_556 Eq_556 Eq_556 Eq_556 Eq_556 Eq_556 Eq_556 Eq_556 Eq_556struct  {
	word32 dwFFFFFFD0;	// FFFFFFD0
	word32 dwFFFFFFD4;	// FFFFFFD4
	word32 dwFFFFFFD8;	// FFFFFFD8
	 * ptrFFFFFFDC;	// FFFFFFDC
	word32 dwFFFFFFE0;	// FFFFFFE0
	 * ptrFFFFFFE4;	// FFFFFFE4
	 * ptrFFFFFFE8;	// FFFFFFE8
	 * ptrFFFFFFEC;	// FFFFFFEC
	 * ptrFFFFFFF0;	// FFFFFFF0
	 * ptrFFFFFFF4;	// FFFFFFF4
	 * ptrFFFFFFF8;	// FFFFFFF8
	 * ptrFFFFFFFC;	// FFFFFFFC
	 * ptr0000;	// 0
} Eq_556;

typedef void (Eq_587)();

typedef  Eq_675 Eq_675 Eq_675 Eq_675 Eq_675 Eq_675 Eq_675 Eq_675struct  {	// size: 3 3
	byte bFFFFFFFF;	// FFFFFFFF
	 t0000;	// 0
	 t0001;	// 1
	 t0001;	// 1
	 t0001;	// 1
	 t0002;	// 2
	 t0003;	// 3
	 t0004;	// 4
	 t0005;	// 5
} Eq_675;

typedef struct  {
	word32 dw0000;	// 0
} Eq_680;

typedef union  {
	byte u0;
	word16 u1;
	word32 u2;
