// subject.h
// Generated on TIMESTAMP by decompiling malware_via_email/malware_0232/ia32_pe/subject.exe
// using Decompiler version VERSION

/*
// Equivalence classes ////////////
Eq_1: (struct "Globals" (401230 word32 dw401230) (403668 word32 dw403668) (403670 word32 dw403670) (403674 word32 dw403674) (403794 word32 dw403794) (403798 word32 dw403798) (40379C word32 dw40379C))
	globals_t (in globals : (ptr (struct "Globals")))
Eq_3: (segment "Eq_3" (0 (ptr word32) ptr0000))
	T_3 (in fs : (ptr Eq_3))
Eq_9: (union "Eq_9" (ptr32 u0) ((memptr (ptr Eq_3) (ptr word32)) u1))
	T_9 (in 0x00000000 : ptr32)
Eq_42: (fn void ())
	T_42 (in fn004035F5 : ptr32)
	T_43 (in signature of fn004035F5 : void)
Eq_52: (fn void ())
	T_52 (in fn004035E0 : ptr32)
	T_53 (in signature of fn004035E0 : void)
Eq_55: (struct "Eq_55" (FFFFFFD8 word32 dwFFFFFFD8) (FFFFFFDC word32 dwFFFFFFDC) (FFFFFFE4 word32 dwFFFFFFE4) (FFFFFFE8 word32 dwFFFFFFE8) (FFFFFFEC word32 dwFFFFFFEC) (FFFFFFF0 word32 dwFFFFFFF0) (FFFFFFF4 Eq_69 tFFFFFFF4) (FFFFFFFC word32 dwFFFFFFFC) (0 word32 dw0000))
	T_55 (in esp_61 : (ptr Eq_55))
	T_57 (in esp_194 - 0x00000004 : word32)
Eq_69: (union "Eq_69" (int32 u0) (LPCSTR u1) (LPSTARTUPINFOA u2))
	T_69 (in fp - 0x00000070 : word32)
	T_72 (in Mem70[esp_61 + 0xFFFFFFF4:word32] : word32)
	T_148 (in eax_114 : Eq_69)
	T_150 (in fp - 0x00000060 : word32)
	T_153 (in Mem109[esp_61 + 0xFFFFFFF4:word32] : word32)
	T_156 (in lpStartupInfo : LPSTARTUPINFOA)

T_214: (in dwArg08 : word32)
  Class: Eq_210
  DataType: word32
  OrigDataType: word32
T_215: (in fn004035FC(ebp, dwArg00, dwArg04, dwArg08) : void)
  Class: Eq_215
  DataType: void
  OrigDataType: void
T_216: (in 0x00000000 : word32)
  Class: Eq_216
  DataType: word32
  OrigDataType: word32
T_217: (in esp_116 + 0x00000000 : word32)
  Class: Eq_217
  DataType: word32
  OrigDataType: word32
T_218: (in Mem134[esp_116 + 0x00000000:word32] : word32)
  Class: Eq_69
  DataType: Eq_69
  OrigDataType: word32
T_219: (in exit : ptr32)
  Class: Eq_219
  DataType: (ptr Eq_219)
  OrigDataType: (ptr (fn T_225 (T_224)))
T_220: (in signature of exit : void)
  Class: Eq_219
  DataType: (ptr Eq_219)
  OrigDataType: 
T_221: (in _Code : int32)
  Class: Eq_69
  DataType: Eq_69
  OrigDataType: int32
T_222: (in 0x00000000 : word32)
  Class: Eq_222
  DataType: word32
  OrigDataType: word32
T_223: (in esp_116 + 0x00000000 : word32)
  Class: Eq_223
  DataType: word32
  OrigDataType: word32
T_224: (in Mem134[esp_116 + 0x00000000:int32] : int32)
  Class: Eq_69
  DataType: Eq_69
  OrigDataType: int32
T_225: (in exit(esp_116->t0000) : void)
  Class: Eq_225
  DataType: void
  OrigDataType: void
T_226: (in ecx_138 : word32)
  Class: Eq_187
  DataType: word32
  OrigDataType: word32
T_227: (in dwLoc18 : word32)
  Class: Eq_105
  DataType: (ptr Eq_105)
  OrigDataType: (ptr (struct (0 T_230 t0000)))
T_228: (in 0x00000000 : word32)
  Class: Eq_228
  DataType: word32
  OrigDataType: word32
T_229: (in dwLoc18 + 0x00000000 : word32)
  Class: Eq_229
  DataType: word32
  OrigDataType: word32
T_230: (in Mem134[dwLoc18 + 0x00000000:word32] : word32)
  Class: Eq_111
  DataType: Eq_111
  OrigDataType: (ptr word32)
T_231: (in Mem134[Mem134[dwLoc18 + 0x00000000:word32]:word32] : word32)
  Class: Eq_187
  DataType: word32
  OrigDataType: word32
T_232: (in 0x00000004 : word32)
  Class: Eq_232
  DataType: word32
  OrigDataType: word32
T_233: (in esp_116 - 0x00000004 : word32)
  Class: Eq_233
  DataType: word32
  OrigDataType: word32
T_234: (in Mem141[esp_116 - 0x00000004:word32] : word32)
  Class: Eq_105
  DataType: (ptr Eq_105)
  OrigDataType: word32
T_235: (in 0x00000008 : word32)
  Class: Eq_235
  DataType: word32
  OrigDataType: word32
T_236: (in esp_116 - 0x00000008 : word32)
  Class: Eq_236
  DataType: word32
  OrigDataType: word32
T_237: (in Mem143[esp_116 - 0x00000008:word32] : word32)
  Class: Eq_187
  DataType: word32
  OrigDataType: word32
T_238: (in _XcptFilter : ptr32)
  Class: Eq_238
  DataType: (ptr code)
  OrigDataType: (ptr code)
T_239: (in signature of _XcptFilter : void)
  Class: Eq_238
  DataType: (ptr code)
  OrigDataType: 
T_240: (in _controlfp : ptr32)
  Class: Eq_240
  DataType: (ptr code)
  OrigDataType: (ptr code)
T_241: (in signature of _controlfp : void)
  Class: Eq_240
  DataType: (ptr code)
  OrigDataType: 
T_242: (in MFC42.DLL!Ordinal_1576 : ptr32)
  Class: Eq_242
  DataType: (ptr code)
  OrigDataType: (ptr code)
T_243:
  Class: Eq_243
  DataType: Eq_243
  OrigDataType: 
*/
typedef struct Globals {
	word32 dw401230;	// 401230
	word32 dw403668;	// 403668
	word32 dw403670;	// 403670
	word32 dw403674;	// 403674
	word32 dw403794;	// 403794
	word32 dw403798;	// 403798
	word32 dw40379C;	// 40379C
} Eq_1;

typedef struct Eq_3 {
	word32 * ptr0000;	// 0
} Eq_3;

typedef union Eq_9 {
	ptr32 u0;
	word32* Eq_3::* u1;
} Eq_9;

typedef void (Eq_42)();

typedef void (Eq_52)();

typedef Eq_69 Eq_55struct Eq_55 {
	word32 dwFFFFFFD8;	// FFFFFFD8
	word32 dwFFFFFFDC;	// FFFFFFDC
	word32 dwFFFFFFE4;	// FFFFFFE4
	word32 dwFFFFFFE8;	// FFFFFFE8
	word32 dwFFFFFFEC;	// FFFFFFEC
	word32 dwFFFFFFF0;	// FFFFFFF0
	Eq_69 tFFFFFFF4;	// FFFFFFF4
	word32 dwFFFFFFFC;	// FFFFFFFC
	word32 dw0000;	// 0
} Eq_55;

typedef union Eq_69 {
	int32 u0;
	 LPCSTR u1;
	 LPSTARTUPINFOA u2;
} Eq_69;

typedef Eq_111 Eq_105Eq_105 Eq_105struct Eq_105 {	// size: 1 1
	Eq_111 t0000;	// 0
	Eq_105 t0001;	// 1
} Eq_105;

typedef union Eq_111 {
	bcu8 u0;
	word32* u1;
} Eq_111;

typedef void (Eq_154)(Eq_69);

typedef Eq_69 Eq_178Eq_105 Eq_178Eq_69 Eq_178struct Eq_178 {
	Eq_69 tFFFFFFF4;	// FFFFFFF4
	word32 dwFFFFFFF8;	// FFFFFFF8
	Eq_105 * ptrFFFFFFFC;	// FFFFFFFC
	Eq_69 t0000;	// 0
} Eq_178;

typedef Eq_69 (Eq_196)(Eq_69);

typedef void (Eq_205)(word32, word32, word32, word32);

typedef void (Eq_219)(Eq_69);

typedef DWORDLPSTRLPSTRLPSTRDWORDDWORDDWORDDWORDDWORDDWORDDWORDDWORDWORDWORDLPBYTEHANDLEHANDLEHANDLEstruct _STARTUPINFOA {
	DWORD;	// 0
	LPSTR;	// 4
	LPSTR;	// 8
	LPSTR;	// C
	DWORD;	// 10
	DWORD;	// 14
	DWORD;	// 18
	DWORD;	// 1C
	DWORD;	// 20
	DWORD;	// 24
	DWORD;	// 28
	DWORD;	// 2C
	WORD;	// 30
	WORD;	// 32
	LPBYTE;	// 34
	HANDLE;	// 38
	HANDLE;	// 3C
	HANDLE;	// 40
} Eq_243;

