// subject.h
// Generated on TIMESTAMP by decompiling from_pouet.net/with_source_273/ia32_com/subject.exe
// using Decompiler version VERSION

/*
// Equivalence classes ////////////
Eq_1: (struct "Globals" (FFFA0000 (ptr Eq_242) ptrFFFA0000))
	globals_t (in globals : (ptr (struct "Globals")))
Eq_2: (fn void (byte))
	T_2 (in bios_video_set_mode : ptr32)
	T_3 (in signature of bios_video_set_mode : void)
Eq_7: (struct (0 word16 w0000) (1 bcu8 b0001))
	T_7 (in bp_101 : word16)
	T_8 (in 0x0200 : word16)
	T_76 (in bp_101 + 0x0001 + 0x0001 : word16)
	T_87 (in 0x0200 : word16)
Eq_9: (struct (0 int16 w0000))
	T_9 (in bx_20 : word16)
	T_12 (in DPB(bx, 0xF0, 8, 8) : word16)
	T_37 (in bx_20 + 0x0001 + 0x0001 : word16)
Eq_13: (union (int16 u0) (word32 u1))
	T_13 (in cx_10 : word16)
	T_14 (in 0x0100 : word16)
	T_17 (in Mem11[ss:0x0200:word16] : word16)
	T_20 (in Mem11[ss:0x0200:int16] : int16)
	T_39 (in cx_10 - 0x0001 : word16)
	T_40 (in 0x0000 : word16)
	T_46 (in 0x00000000 : word32)
	T_48 (in Mem59[ss:0x0200:word32] : word32)
	T_167 (in (cx_140 << 0x0003) + SEQ(ds, 0xF000)[DPB(dx_127 + Mem112[ss:0x0210:word16], 0x00, 8, 8) * 0x0002] : word16)
	T_169 (in Mem155[ss:0x0200:word16] : word16)
	T_185 (in Mem155[ss:0x0200:word16] : word16)
	T_230 (in DPB(cx_140, 0x3F, 8, 8) : word16)
	T_254 (in cx_10 - 0x0001 : word16)
	T_255 (in 0x0000 : word16)
Eq_15: (segment (200 Eq_13 t0200) (204 word16 w0204) (210 word16 w0210))
	T_15 (in ss : selector)
Eq_16: (struct (0 Eq_13 t0000))

T_236: (in Mem231[ss:0x0210:word16] : word16)
  Class: Eq_160
  DataType: word16
  OrigDataType: word16
T_237: (in __inb : ptr32)
  Class: Eq_237
  DataType: (ptr Eq_237)
  OrigDataType: (ptr (fn T_239 (T_238)))
T_238: (in 0x60 : byte)
  Class: Eq_238
  DataType: byte
  OrigDataType: byte
T_239: (in __inb(0x60) : byte)
  Class: Eq_239
  DataType: byte
  OrigDataType: byte
T_240: (in 0x01 : byte)
  Class: Eq_239
  DataType: byte
  OrigDataType: byte
T_241: (in __inb(0x60) != 0x01 : bool)
  Class: Eq_241
  DataType: bool
  OrigDataType: bool
T_242: (in 0xA000 : selector)
  Class: Eq_242
  DataType: (ptr Eq_242)
  OrigDataType: (ptr (segment (0 (arr T_265) a0000)))
T_243: (in 0x0000 : word16)
  Class: Eq_243
  DataType: word16
  OrigDataType: word16
T_244: (in si_212 + 0x0000 : word16)
  Class: Eq_244
  DataType: word16
  OrigDataType: word16
T_245: (in Mem209[0xA000:si_212 + 0x0000:word32] : word32)
  Class: Eq_245
  DataType: word32
  OrigDataType: word32
T_246: (in 0x0000 : word16)
  Class: Eq_246
  DataType: word16
  OrigDataType: word16
T_247: (in di_213 + 0x0000 : word16)
  Class: Eq_247
  DataType: word16
  OrigDataType: word16
T_248: (in Mem223[0xA000:di_213 + 0x0000:word32] : word32)
  Class: Eq_245
  DataType: word32
  OrigDataType: word32
T_249: (in 0x0004 : word16)
  Class: Eq_249
  DataType: word16
  OrigDataType: word16
T_250: (in si_212 + 0x0004 : word16)
  Class: Eq_225
  DataType: (memptr (ptr Eq_242) Eq_225)
  OrigDataType: word16
T_251: (in 0x0004 : word16)
  Class: Eq_251
  DataType: word16
  OrigDataType: word16
T_252: (in di_213 + 0x0004 : word16)
  Class: Eq_227
  DataType: (memptr (ptr Eq_242) Eq_227)
  OrigDataType: word16
T_253: (in 0x0001 : word16)
  Class: Eq_253
  DataType: word16
  OrigDataType: word16
T_254: (in cx_10 - 0x0001 : word16)
  Class: Eq_13
  DataType: Eq_13
  OrigDataType: word16
T_255: (in 0x0000 : word16)
  Class: Eq_13
  DataType: Eq_13
  OrigDataType: word16
T_256: (in cx_10 == 0x0000 : bool)
  Class: Eq_256
  DataType: bool
  OrigDataType: bool
T_257: (in msdos_terminate : ptr32)
  Class: Eq_257
  DataType: (ptr Eq_257)
  OrigDataType: (ptr (fn T_261 (T_260)))
T_258: (in signature of msdos_terminate : void)
  Class: Eq_257
  DataType: (ptr Eq_257)
  OrigDataType: 
T_259: (in al : byte)
  Class: Eq_259
  DataType: byte
  OrigDataType: byte
T_260: (in 0x00 : byte)
  Class: Eq_259
  DataType: byte
  OrigDataType: byte
T_261: (in msdos_terminate(0x00) : void)
  Class: Eq_261
  DataType: void
  OrigDataType: void
T_262:
  Class: Eq_262
  DataType: Eq_262
  OrigDataType: (struct 0001 (0 T_65 t0000))
T_263:
  Class: Eq_263
  DataType: Eq_263
  OrigDataType: (struct 0002 (0 T_166 t0000))
T_264:
  Class: Eq_263
  DataType: Eq_263
  OrigDataType: (struct 0002 (0 T_182 t0000))
T_265:
  Class: Eq_265
  DataType: Eq_265
  OrigDataType: (struct 0004 (0 T_245 t0000))
T_266:
  Class: Eq_265
  DataType: Eq_265
  OrigDataType: (struct 0004 (0 T_248 t0000))
*/
typedef  Eq_1struct Globals {
	 * ptrFFFA0000;	// FFFA0000
} Eq_1;

typedef void (Eq_2)(byte);

typedef struct  {
	word16 w0000;	// 0
	bcu8 b0001;	// 1
} Eq_7;

typedef struct  {
	int16 w0000;	// 0
} Eq_9;

typedef union  {
	int16 u0;
	word32 u1;
} Eq_13;

typedef  Eq_15struct  {
	 t0200;	// 200
	word16 w0204;	// 204
	word16 w0210;	// 210
} Eq_15;

typedef  Eq_16struct  {
	 t0000;	// 0
} Eq_16;

typedef  (Eq_18)(real16);

typedef  Eq_19struct  {
	 t0000;	// 0
} Eq_19;

typedef union  {
	real16 u0;
	real64 u1;
} Eq_21;

typedef  Eq_22[][6]struct  {
	 aFFFFF000[];	// FFFFF000
	 t01F2;	// 1F2
	 t01F4;	// 1F4
	 a01F7[6];	// 1F7
	word16 w01F8;	// 1F8
	word16 w01FC;	// 1FC
	int16 w01FE;	// 1FE
} Eq_22;

typedef  Eq_23struct  {
	 t0000;	// 0
} Eq_23;

typedef union  {
	real16 u0;
	real32 u1;
} Eq_24;

typedef union  {
	real16 u0;
	real64 u1;
} Eq_26;

typedef  Eq_27struct  {
	 t0000;	// 0
} Eq_27;

typedef union  {
	real16 u0;
	real32 u1;
} Eq_28;

typedef void (Eq_42)(word16, byte);

typedef  Eq_47struct  {
	 t0000;	// 0
} Eq_47;

typedef struct  {
	word16 w0000;	// 0
} Eq_50;

typedef void (Eq_55)(word16, bcu8);

typedef struct  {	// size: 1 1
	word16 w0000;	// 0
} Eq_62;

typedef struct  {
	int16 w0000;	// 0
} Eq_94;

typedef struct  {
	word16 w0000;	// 0
} Eq_96;

typedef struct  {
	word16 w0000;	// 0
} Eq_102;

typedef struct  {
	word16 w0000;	// 0
} Eq_106;

typedef struct  {
	int16 w0000;	// 0
} Eq_110;

typedef struct  {
	word16 w0000;	// 0
} Eq_112;

typedef struct  {
} Eq_117;

typedef  Eq_122struct  {	// size: 1 1
	 t0000;	// 0
	byte b0001;	// 1
	byte b0002;	// 2
} Eq_122;

typedef union  {
	uint16 u0;
	byte u1;
} Eq_129;

typedef struct  {
