// subject.h
// Generated on TIMESTAMP by decompiling from_pouet.net/with_source_359/ia32_pe/subject.exe
// using Decompiler version VERSION

/*
// Equivalence classes ////////////
Eq_1: (struct "Globals" (40208A Eq_74 t40208A) (40208E word32 dw40208E) (402092 word32 dw402092) (4020A2 Eq_66 t4020A2) (4020A6 Eq_2 t4020A6) (4020AE word32 dw4020AE) (4020B2 Eq_2 t4020B2) (4020D6 word32 dw4020D6) (4020DA Eq_2 t4020DA) (4020DE up32 dw4020DE) (4020E2 Eq_2 t4020E2))
	globals_t (in globals : (ptr (struct "Globals")))
Eq_2: (union "Eq_2" ((ptr Eq_386) u0) (HDC u1) (HGLOBAL u2) (UINT u3))
	T_2 (in edx_16 : Eq_2)
	T_4 (in Mem0[0x004020DA:word32] : word32)
	T_22 (in edx_11 + 0x00000003 : word32)
	T_28 (in eax_6 : Eq_2)
	T_35 (in GlobalAlloc(0x00000000, 0x0007A120) : word32)
	T_36 (in 0x00000000 : word32)
	T_59 (in Mem129[0x004020E2:word32] : word32)
	T_61 (in Mem130[0x004020DA:word32] : word32)
	T_163 (in GetDC(0x00000000) : word32)
	T_165 (in Mem193[0x004020A6:word32] : word32)
	T_177 (in Mem0[0x004020A6:word32] : word32)
	T_180 (in Mem38[esp_36 + 0x00000000:word32] : word32)
	T_189 (in hDC : HDC)
	T_194 (in Mem40[esp_36 + 0x00000000:HDC] : HDC)
	T_197 (in Mem40[0x004020E2:word32] : word32)
	T_200 (in Mem44[esp_36 + 0x00000000:word32] : word32)
	T_203 (in hMem : HGLOBAL)
	T_206 (in Mem44[esp_36 + 0x00000000:HGLOBAL] : HGLOBAL)
	T_209 (in Mem44[0x004020B2:word32] : word32)
	T_212 (in Mem48[esp_36 + 0x00000000:word32] : word32)
	T_215 (in uExitCode : UINT)

T_369: (in Msg : UINT)
  Class: Eq_238
  DataType: Eq_238
  OrigDataType: UINT
T_370: (in wParam : WPARAM)
  Class: Eq_350
  DataType: Eq_350
  OrigDataType: WPARAM
T_371: (in lParam : LPARAM)
  Class: Eq_323
  DataType: Eq_323
  OrigDataType: LPARAM
T_372: (in esp_36 - 0x0000001C : word32)
  Class: Eq_372
  DataType: word32
  OrigDataType: word32
T_373: (in Mem91[esp_36 - 0x0000001C:HWND] : HWND)
  Class: Eq_362
  DataType: Eq_362
  OrigDataType: HWND
T_374: (in 24 : int32)
  Class: Eq_374
  DataType: int32
  OrigDataType: int32
T_375: (in esp_36 - 24 : word32)
  Class: Eq_375
  DataType: word32
  OrigDataType: word32
T_376: (in Mem91[esp_36 - 24:UINT] : UINT)
  Class: Eq_238
  DataType: Eq_238
  OrigDataType: UINT
T_377: (in 20 : int32)
  Class: Eq_377
  DataType: int32
  OrigDataType: int32
T_378: (in esp_36 - 20 : word32)
  Class: Eq_378
  DataType: word32
  OrigDataType: word32
T_379: (in Mem91[esp_36 - 20:WPARAM] : WPARAM)
  Class: Eq_350
  DataType: Eq_350
  OrigDataType: WPARAM
T_380: (in 16 : int32)
  Class: Eq_380
  DataType: int32
  OrigDataType: int32
T_381: (in esp_36 - 16 : word32)
  Class: Eq_381
  DataType: word32
  OrigDataType: word32
T_382: (in Mem91[esp_36 - 16:LPARAM] : LPARAM)
  Class: Eq_323
  DataType: Eq_323
  OrigDataType: LPARAM
T_383: (in DefWindowProcW(esp_36->t0014, esp_36->t0014, esp_36->t0014, esp_36->t0010) : word32)
  Class: Eq_383
  DataType: word32
  OrigDataType: word32
T_384: (in fn0040101B : ptr32)
  Class: Eq_169
  DataType: (ptr Eq_169)
  OrigDataType: (ptr (fn T_385 ()))
T_385: (in fn0040101B() : void)
  Class: Eq_171
  DataType: void
  OrigDataType: void
T_386:
  Class: Eq_386
  DataType: Eq_386
  OrigDataType: 
T_387:
  Class: Eq_387
  DataType: int32
  OrigDataType: 
T_388:
  Class: Eq_388
  DataType: int32
  OrigDataType: 
T_389:
  Class: Eq_389
  DataType: int32
  OrigDataType: 
T_390:
  Class: Eq_390
  DataType: int32
  OrigDataType: 
T_391:
  Class: Eq_391
  DataType: int32
  OrigDataType: 
T_392:
  Class: Eq_392
  DataType: int32
  OrigDataType: 
T_393:
  Class: Eq_393
  DataType: int32
  OrigDataType: 
T_394:
  Class: Eq_394
  DataType: Eq_394
  OrigDataType: 
T_395:
  Class: Eq_395
  DataType: int32
  OrigDataType: 
T_396:
  Class: Eq_396
  DataType: int32
  OrigDataType: 
T_397:
  Class: Eq_397
  DataType: int32
  OrigDataType: 
T_398:
  Class: Eq_398
  DataType: int32
  OrigDataType: 
T_399:
  Class: Eq_399
  DataType: Eq_399
  OrigDataType: 
T_400:
  Class: Eq_400
  DataType: Eq_400
  OrigDataType: 
T_401:
  Class: Eq_401
  DataType: Eq_401
  OrigDataType: 
T_402:
  Class: Eq_402
  DataType: Eq_402
  OrigDataType: 
*/
typedef Eq_74 Eq_1Eq_66 Eq_1Eq_2 Eq_1Eq_2 Eq_1Eq_2 Eq_1Eq_2 Eq_1struct Globals {
	Eq_74 t40208A;	// 40208A
	word32 dw40208E;	// 40208E
	word32 dw402092;	// 402092
	Eq_66 t4020A2;	// 4020A2
	Eq_2 t4020A6;	// 4020A6
	word32 dw4020AE;	// 4020AE
	Eq_2 t4020B2;	// 4020B2
	word32 dw4020D6;	// 4020D6
	Eq_2 t4020DA;	// 4020DA
	up32 dw4020DE;	// 4020DE
	Eq_2 t4020E2;	// 4020E2
} Eq_1;

typedef union Eq_2 {
	Eq_386* u0;
	 HDC u1;
	 HGLOBAL u2;
	 UINT u3;
} Eq_2;

typedef union Eq_8 {
	uint32 u0;
	byte u1;
} Eq_8;

typedef struct Eq_12 {
	uint8 b0000;	// 0
	uint8 b0001;	// 1
} Eq_12;

typedef Eq_74 Eq_27Eq_66 Eq_27struct Eq_27 {
	word32 dwFFFFFFF0;	// FFFFFFF0
	word32 dwFFFFFFF4;	// FFFFFFF4
	Eq_74 tFFFFFFF8;	// FFFFFFF8
	Eq_66 tFFFFFFFC;	// FFFFFFFC
} Eq_27;

typedef Eq_2 (Eq_29)(Eq_31, Eq_32);

typedef union Eq_31 {
	word32 u0;
	 UINT u1;
} Eq_31;

typedef union Eq_32 {
	word32 u0;
	 SIZE_T u1;
} Eq_32;

typedef word32 (Eq_47)(Eq_49, Eq_50, Eq_51, Eq_52);

typedef union Eq_49 {
	word32 u0;
	 HWND u1;
} Eq_49;

typedef union Eq_50 {
	word32 u0;
	 LPCWSTR u1;
} Eq_50;

typedef union Eq_51 {
	word32 u0;
	 LPCWSTR u1;
} Eq_51;

typedef union Eq_52 {
	word32 u0;
	 UINT u1;
} Eq_52;

typedef union Eq_66 {
	word32 u0;
	 HWND u1;
	 LPVOID u2;
} Eq_66;

typedef Eq_74 (Eq_70)(Eq_72);

typedef union Eq_72 {
	 WNDCLASSW* u0;
	 LPCWSTR u1;
} Eq_72;

typedef union Eq_74 {
	word32 u0;
	 HINSTANCE u1;
} Eq_74;

typedef word32 (Eq_85)(Eq_87, Eq_72);

typedef union Eq_87 {
	word32 u0;
	 HINSTANCE u1;
} Eq_87;

typedef word32 (Eq_101)(Eq_87, Eq_72);

typedef word32 (Eq_112)(Eq_72);

typedef Eq_66 (Eq_128)(Eq_130, Eq_131, Eq_132, Eq_133, int32, int32, int32, int32, Eq_138, Eq_139, Eq_74, Eq_66);

typedef union Eq_130 {
	word32 u0;
	 DWORD u1;
} Eq_130;

typedef union Eq_131 {
	word32 u0;
	 LPCWSTR u1;
} Eq_131;

typedef union Eq_132 {
	word32 u0;
	 LPCWSTR u1;
} Eq_132;

typedef union Eq_133 {
	word32 u0;
	 DWORD u1;
} Eq_133;

typedef union Eq_138 {
	word32 u0;
	 HWND u1;
} Eq_138;

typedef union Eq_139 {
	word32 u0;
	 HMENU u1;
} Eq_139;

typedef Eq_2 (Eq_160)(Eq_66);

typedef void (Eq_166)();

typedef void (Eq_169)();

typedef Eq_362 Eq_173Eq_238 Eq_173Eq_350 Eq_173Eq_323 Eq_173Eq_66 Eq_173Eq_2 Eq_173Eq_362 Eq_173Eq_238 Eq_173Eq_350 Eq_173Eq_323 Eq_173struct Eq_173 {
	Eq_362 tFFFFFFE4;	// FFFFFFE4
	Eq_238 tFFFFFFE8;	// FFFFFFE8
	Eq_350 tFFFFFFEC;	// FFFFFFEC
	Eq_323 tFFFFFFF0;	// FFFFFFF0
	word32 dwFFFFFFF4;	// FFFFFFF4
	word32 dwFFFFFFF8;	// FFFFFFF8
	Eq_66 tFFFFFFFC;	// FFFFFFFC
	Eq_2 t0000;	// 0
	Eq_362 t0008;	// 8
	Eq_238 t000C;	// C
	Eq_350 t0010;	// 10
	Eq_323 t0014;	// 14
} Eq_173;

typedef word32 (Eq_186)(Eq_66, Eq_2);

typedef word32 (Eq_201)(Eq_2);

typedef void (Eq_213)(Eq_2);

typedef union Eq_238 {
	word32 u0;
	 UINT u1;
} Eq_238;

typedef union Eq_241 {
	 MSG* u0;
	 UINT u1;
} Eq_241;

typedef Eq_291 Eq_242Eq_287 Eq_242Eq_283 Eq_242Eq_279 Eq_242Eq_241 Eq_242Eq_27 Eq_242struct Eq_242 {
	Eq_291 tFFFFFFF0;	// FFFFFFF0
	Eq_287 tFFFFFFF4;	// FFFFFFF4
	Eq_283 tFFFFFFF8;	// FFFFFFF8
	Eq_279 tFFFFFFFC;	// FFFFFFFC
	Eq_241 t0000;	// 0
	Eq_27 t0004;	// 4
} Eq_242;

typedef word32 (Eq_246)(Eq_241);

typedef word32 (Eq_257)(Eq_241);

typedef union Eq_279 {
	word32 u0;
	 UINT u1;
} Eq_279;

typedef union Eq_283 {
	word32 u0;
	 UINT u1;
} Eq_283;

typedef union Eq_287 {
	word32 u0;
	 HWND u1;
} Eq_287;

typedef union Eq_291 {
	word32 u0;
	 LPMSG u1;
} Eq_291;

typedef word32 (Eq_295)(Eq_291, Eq_287, Eq_283, Eq_279, Eq_241);

typedef union Eq_323 {
	int32 u0;
	 LPARAM u1;
} Eq_323;

typedef void (Eq_327)(Eq_323);

typedef union Eq_350 {
	word32 u0;
	 WPARAM u1;
} Eq_350;

typedef union Eq_362 {
	word32 u0;
	 HWND u1;
} Eq_362;

typedef word32 (Eq_366)(Eq_362, Eq_238, Eq_350, Eq_323);

typedef Eq_8 Eq_386struct Eq_386 {	// size: 1 1
	Eq_8 t0000;	// 0
} Eq_386;

typedef UINTWNDPROCHINSTANCEHICONHCURSORHBRUSHLPCWSTRLPCWSTRstruct tagWNDCLASSW {
	UINT;	// 0
	WNDPROC;	// 4
	int32 cbClsExtra;	// 8
	int32 cbWndExtra;	// C
	HINSTANCE;	// 10
	HICON;	// 14
	HCURSOR;	// 18
	HBRUSH;	// 1C
	LPCWSTR;	// 20
	LPCWSTR;	// 24
} Eq_394;

typedef LONGLONGstruct tagPOINT {
	LONG;	// 0
	LONG;	// 4
} Eq_399;

typedef HWNDUINTWPARAMLPARAMDWORDPOINTstruct tagMSG {
	HWND;	// 0
	UINT;	// 4
	WPARAM;	// 8
	LPARAM;	// C
	DWORD;	// 10
	POINT;	// 18
} Eq_400;

typedef LONGLONGstruct tagPOINT {
	LONG;	// 0
	LONG;	// 4
} Eq_401;

typedef HWNDUINTWPARAMLPARAMDWORDPOINTstruct tagMSG {
	HWND;	// 0
	UINT;	// 4
	WPARAM;	// 8
	LPARAM;	// C
	DWORD;	// 10
	POINT;	// 18
} Eq_402;

