// subject.h
// Generated on TIMESTAMP by decompiling malware_via_email/malware_0874/ia32_pe/subject.exe
// using Decompiler version VERSION

/*
// Equivalence classes ////////////
Eq_1: (struct "Globals" (404090 RECT t404090) (4040B8 word32 dw4040B8) (4040BC int32 dw4040BC) (4040C0 int32 dw4040C0) (4040C4 int32 dw4040C4) (4040C8 word32 dw4040C8) (4040CC word32 dw4040CC) (4040D0 Eq_15 t4040D0) (4040D4 (ptr Eq_872) ptr4040D4) (4040D8 int32 dw4040D8) (4040DC word32 dw4040DC) (4040E0 int32 dw4040E0) (4040E4 Eq_15 t4040E4) (4040E8 word32 dw4040E8) (4040EC int32 dw4040EC) (4040F0 Eq_15 t4040F0) (4040F4 (ptr Eq_912) ptr4040F4) (4040F8 (ptr code) ptr4040F8) (4040FC int32 dw4040FC))
	globals_t (in globals : (ptr (struct "Globals")))
Eq_12: (fn word32 (Eq_14, Eq_15))
	T_12 (in CopyRect : ptr32)
	T_13 (in signature of CopyRect : void)
	T_416 (in CopyRect : ptr32)
Eq_14: (union "Eq_14" (word32 u0) (LPRECT u1))
	T_14 (in lprcDst : LPRECT)
	T_18 (in fp - 0x0000003C : word32)
	T_418 (in fp + 0xFFFFFF24 : word32)
Eq_15: (union "Eq_15" ((ptr RECT) u0) ((ptr Eq_2067) u1) (DWORD u2) (HANDLE u3) (HCURSOR u4) (HINSTANCE u5) (HMODULE u6) (LPCSTR u7) (LPCVOID u8) (LPSTARTUPINFOA u9) (LPSTR u10) (LPVOID u11) (UINT u12))
	T_15 (in lprcSrc : (ptr RECT))
	T_20 (in fp - 0x0000002C : word32)
	T_277 (in lpModuleName : LPCSTR)
	T_278 (in 0x00000000 : word32)
	T_279 (in GetModuleHandleA(0x00000000) : word32)
	T_294 (in hInstance : HINSTANCE)
	T_297 (in 0x00000000 : word32)

T_2055: (in GetProcessHeap : ptr32)
  Class: Eq_2034
  DataType: (ptr Eq_2034)
  OrigDataType: (ptr (fn T_2056 ()))
T_2056: (in GetProcessHeap() : word32)
  Class: Eq_2031
  DataType: Eq_2031
  OrigDataType: word32
T_2057: (in 0x00000000 : word32)
  Class: Eq_2053
  DataType: word32
  OrigDataType: word32
T_2058: (in dwArg04 : word32)
  Class: Eq_2054
  DataType: Eq_2054
  OrigDataType: word32
T_2059: (in HeapAlloc(GetProcessHeap(), 0x00000000, dwArg04) : word32)
  Class: Eq_2059
  DataType: word32
  OrigDataType: word32
T_2060:
  Class: Eq_2060
  DataType: word16
  OrigDataType: (struct 0002 (0 T_1202 t0000))
T_2061:
  Class: Eq_2060
  DataType: word16
  OrigDataType: (struct 0002 (0 T_1216 t0000))
T_2062:
  Class: Eq_2060
  DataType: word16
  OrigDataType: (struct 0002 (0 T_1231 t0000))
T_2063:
  Class: Eq_2063
  DataType: word16
  OrigDataType: (struct 0002 (0 T_1526 t0000))
T_2064:
  Class: Eq_2063
  DataType: word16
  OrigDataType: (struct 0002 (0 T_1538 t0000))
T_2065:
  Class: Eq_2063
  DataType: word16
  OrigDataType: (struct 0002 (0 T_1551 t0000))
T_2066:
  Class: Eq_2066
  DataType: Eq_2066
  OrigDataType: 
T_2067:
  Class: Eq_2067
  DataType: Eq_2067
  OrigDataType: 
T_2068:
  Class: Eq_2068
  DataType: Eq_2068
  OrigDataType: 
T_2069:
  Class: Eq_2069
  DataType: int32
  OrigDataType: 
T_2070:
  Class: Eq_2070
  DataType: int32
  OrigDataType: 
T_2071:
  Class: Eq_2071
  DataType: Eq_2071
  OrigDataType: 
T_2072:
  Class: Eq_2072
  DataType: int32
  OrigDataType: 
T_2073:
  Class: Eq_2073
  DataType: int32
  OrigDataType: 
T_2074:
  Class: Eq_2074
  DataType: Eq_2074
  OrigDataType: 
T_2075:
  Class: Eq_2075
  DataType: int32
  OrigDataType: 
T_2076:
  Class: Eq_2076
  DataType: int32
  OrigDataType: 
T_2077:
  Class: Eq_2077
  DataType: int32
  OrigDataType: 
T_2078:
  Class: Eq_2078
  DataType: int32
  OrigDataType: 
T_2079:
  Class: Eq_2079
  DataType: int32
  OrigDataType: 
T_2080:
  Class: Eq_2080
  DataType: int32
  OrigDataType: 
T_2081:
  Class: Eq_2081
  DataType: Eq_2081
  OrigDataType: 
T_2082:
  Class: Eq_2082
  DataType: Eq_2082
  OrigDataType: 
T_2083:
  Class: Eq_2083
  DataType: Eq_2083
  OrigDataType: 
T_2084:
  Class: Eq_2084
  DataType: int32
  OrigDataType: 
T_2085:
  Class: Eq_2085
  DataType: Eq_2085
  OrigDataType: 
T_2086:
  Class: Eq_2086
  DataType: Eq_2086
  OrigDataType: 
*/
typedef RECTEq_15 Eq_1Eq_872 Eq_1Eq_15 Eq_1Eq_15 Eq_1Eq_912 Eq_1code Eq_1struct Globals {
	RECT;	// 404090
	word32 dw4040B8;	// 4040B8
	int32 dw4040BC;	// 4040BC
	int32 dw4040C0;	// 4040C0
	int32 dw4040C4;	// 4040C4
	word32 dw4040C8;	// 4040C8
	word32 dw4040CC;	// 4040CC
	Eq_15 t4040D0;	// 4040D0
	Eq_872 * ptr4040D4;	// 4040D4
	int32 dw4040D8;	// 4040D8
	word32 dw4040DC;	// 4040DC
	int32 dw4040E0;	// 4040E0
	Eq_15 t4040E4;	// 4040E4
	word32 dw4040E8;	// 4040E8
	int32 dw4040EC;	// 4040EC
	Eq_15 t4040F0;	// 4040F0
	Eq_912 * ptr4040F4;	// 4040F4
	code * ptr4040F8;	// 4040F8
	int32 dw4040FC;	// 4040FC
} Eq_1;

typedef word32 (Eq_12)(Eq_14, Eq_15);

typedef union Eq_14 {
	word32 u0;
	 LPRECT u1;
} Eq_14;

typedef union Eq_15 {
	 RECT* u0;
	Eq_2067* u1;
	 DWORD u2;
	 HANDLE u3;
	 HCURSOR u4;
	 HINSTANCE u5;
	 HMODULE u6;
	 LPCSTR u7;
	 LPCVOID u8;
	 LPSTARTUPINFOA u9;
	 LPSTR u10;
	 LPVOID u11;
	 UINT u12;
} Eq_15;

typedef word32 (Eq_44)(Eq_46, int32, Eq_48);

typedef union Eq_46 {
	word32 u0;
	 HDC u1;
} Eq_46;

typedef union Eq_48 {
	word32 u0;
	 LPSTR u1;
} Eq_48;

typedef Eq_46 (Eq_49)(Eq_51);

typedef union Eq_51 {
	word32 u0;
	 HWND u1;
} Eq_51;

typedef Eq_51 (Eq_52)();

typedef struct Eq_57 {
	int32 dwFFFFFFD0;	// FFFFFFD0
} Eq_57;

typedef word32 (Eq_109)(word32, word32);

typedef Eq_182 Eq_182struct Eq_182 {	// size: 1 1
	byte b0000;	// 0
	Eq_182 t0001;	// 1
} Eq_182;

typedef word32 (Eq_215)(Eq_217, Eq_218, Eq_219, Eq_220, Eq_221, Eq_222, Eq_223);

typedef union Eq_217 {
	word32 u0;
	 LPCSTR u1;
} Eq_217;

typedef union Eq_218 {
	word32 u0;
	 DWORD u1;
} Eq_218;

typedef union Eq_219 {
	word32 u0;
	 DWORD u1;
} Eq_219;

typedef union Eq_220 {
	word32 u0;
	 LPSECURITY_ATTRIBUTES u1;
} Eq_220;

typedef union Eq_221 {
	word32 u0;
	 DWORD u1;
} Eq_221;

typedef union Eq_222 {
	word32 u0;
	 DWORD u1;
} Eq_222;

typedef union Eq_223 {
	word32 u0;
	 HANDLE u1;
} Eq_223;

typedef Eq_15 (Eq_275)(Eq_15);

typedef word32 (Eq_292)(Eq_15, Eq_295);

typedef union Eq_295 {
	word32 u0;
	 LPCSTR u1;
} Eq_295;

typedef Eq_15 (Eq_301)(Eq_15, Eq_304);

typedef union Eq_304 {
	word32 u0;
	 DWORD u1;
	 LPCSTR u2;
} Eq_304;

typedef word32 (Eq_334)(WNDCLASSA *);

typedef WNDCLASSA;

typedef Eq_15 Eq_337Eq_15 Eq_337Eq_15 Eq_337Eq_15 Eq_337WNDCLASSA Eq_337struct Eq_337 {
	Eq_15 tFFFFFEF4;	// FFFFFEF4
	Eq_15 tFFFFFEF8;	// FFFFFEF8
	word32 dwFFFFFEFC;	// FFFFFEFC
	Eq_15 tFFFFFF00;	// FFFFFF00
	Eq_15 tFFFFFF04;	// FFFFFF04
	WNDCLASSA tFFFFFF44;	// FFFFFF44
	int32 dwFFFFFFD8;	// FFFFFFD8
} Eq_337;

typedef word32 (Eq_364)(Eq_366, Eq_367, Eq_368, Eq_369, int32, int32, int32, int32, Eq_374, Eq_375, Eq_15, Eq_377);

typedef union Eq_366 {
	word32 u0;
	 DWORD u1;
} Eq_366;

typedef union Eq_367 {
	word32 u0;
	 LPCSTR u1;
} Eq_367;

typedef union Eq_368 {
	word32 u0;
	 LPCSTR u1;
} Eq_368;

typedef union Eq_369 {
	word32 u0;
	 DWORD u1;
} Eq_369;

typedef union Eq_374 {
	word32 u0;
	 HWND u1;
} Eq_374;

typedef union Eq_375 {
	word32 u0;
	 HMENU u1;
} Eq_375;

typedef union Eq_377 {
	word32 u0;
	 LPVOID u1;
} Eq_377;

typedef Eq_527 Eq_428struct Eq_428 {
	word16 w0006;	// 6
	word16 w0014;	// 14
	Eq_527 t003C;	// 3C
} Eq_428;

typedef void (Eq_442)(word32, byte, word32);

typedef void (Eq_456)(Eq_15);

typedef struct Eq_502 {
	word32 dw0010;	// 10
	word32 dw0014;	// 14
} Eq_502;

typedef union Eq_527 {
	int32 u0;
	uint32 u1;
} Eq_527;

typedef union Eq_529 {
	word32 u0;
	 LONG u1;
} Eq_529;

typedef union Eq_540 {
	int32 u0;
	uint32 u1;
} Eq_540;

typedef Eq_15 (Eq_558)(word32);

typedef word32 (Eq_577)(Eq_15);

typedef word32 (Eq_599)(Eq_15, Eq_15, Eq_304);

typedef Eq_15 (Eq_626)(Eq_15);

typedef union Eq_669 {
	word32 u0;
	 DWORD u1;
} Eq_669;

typedef word32 (Eq_670)(Eq_15, Eq_673);

typedef union Eq_673 {
	word32 u0;
	 LPDWORD u1;
} Eq_673;

typedef word32 (Eq_702)(Eq_704, Eq_529, Eq_706, Eq_707);

typedef union Eq_704 {
	word32 u0;
	 HANDLE u1;
	 LPVOID u2;
} Eq_704;

typedef union Eq_706 {
	word32 u0;
	 PLONG u1;
} Eq_706;

typedef union Eq_707 {
	word32 u0;
	 DWORD u1;
} Eq_707;

typedef word32 (Eq_718)(Eq_720, Eq_704, Eq_669, Eq_723, Eq_724);

typedef union Eq_720 {
	word32 u0;
	 HANDLE u1;
} Eq_720;

typedef union Eq_723 {
	word32 u0;
	 LPDWORD u1;
} Eq_723;

typedef union Eq_724 {
	word32 u0;
	 LPOVERLAPPED u1;
} Eq_724;

typedef word32 (Eq_753)(Eq_755);

typedef union Eq_755 {
	word32 u0;
	 HANDLE u1;
} Eq_755;

typedef void (Eq_771)(Eq_15, Eq_15, Eq_15);

typedef word32 (Eq_790)(Eq_792);

typedef union Eq_792 {
	word32 u0;
	 HDC u1;
} Eq_792;

typedef struct Eq_859 {
	word32 dw0008;	// 8
} Eq_859;

typedef struct Eq_865 {
	word32 dw0008;	// 8
} Eq_865;

typedef Eq_15 Eq_872struct Eq_872 {
	int32 dwFFFFFFE0;	// FFFFFFE0
	int32 dwFFFFFFEC;	// FFFFFFEC
	int32 dwFFFFFFF0;	// FFFFFFF0
	Eq_15 tFFFFFFF4;	// FFFFFFF4
	word32 dwFFFFFFF8;	// FFFFFFF8
} Eq_872;

typedef Eq_872 * (Eq_873)(word32 *, word32, Eq_15, up32);

typedef Eq_912 Eq_910struct Eq_910 {
	Eq_912 * ptr0018;	// 18
} Eq_910;

typedef Eq_1935 Eq_912struct Eq_912 {
	Eq_1935 * ptr0030;	// 30
} Eq_912;

typedef void (Eq_958)(Eq_15);

typedef void (Eq_978)(word32);

typedef word32 (Eq_1006)(word32);

typedef void (Eq_1076)(word32);

typedef Eq_1131 Eq_1126struct Eq_1126 {
	Eq_1131 t0050;	// 50
	word32 dw00A0;	// A0
	word32 dw00A4;	// A4
} Eq_1126;

typedef union Eq_1131 {
	word32 u0;
	 SIZE_T u1;
} Eq_1131;

typedef Eq_15 Eq_1132Eq_1131 Eq_1132struct Eq_1132 {
	Eq_15 tFFFFFFB8;	// FFFFFFB8
	Eq_1131 tFFFFFFBC;	// FFFFFFBC
} Eq_1132;

typedef Eq_15 (Eq_1136)(Eq_15, Eq_1131, Eq_1140, Eq_15);

typedef union Eq_1140 {
	Eq_2085* u0;
	 DWORD u1;
} Eq_1140;

typedef  Eq_1177[]struct Eq_1177 {
	word32 dw0000;	// 0
	word32 dw0004;	// 4
	word16 a0008[];	// 8
} Eq_1177;

typedef Eq_1350 Eq_1246Eq_1131 Eq_1246struct Eq_1246 {
	word16 w0006;	// 6
	word16 w0014;	// 14
	Eq_1350 t003C;	// 3C
	Eq_1131 t0050;	// 50
} Eq_1246;

typedef Eq_1252 Eq_1252struct Eq_1252 {	// size: 40 28
	word32 dw000C;	// C
	word32 dw0010;	// 10
	word32 dw0014;	// 14
	Eq_1252 t0028;	// 28
} Eq_1252;

typedef Eq_1457 Eq_1292Eq_1649 Eq_1292Eq_15 Eq_1292Eq_15 Eq_1292Eq_1140 Eq_1292Eq_15 Eq_1292struct Eq_1292 {
	Eq_1457 tFFFFFF90;	// FFFFFF90
	Eq_1649 tFFFFFF94;	// FFFFFF94
	Eq_15 tFFFFFF98;	// FFFFFF98
	Eq_15 tFFFFFF9C;	// FFFFFF9C
	Eq_1140 tFFFFFFA0;	// FFFFFFA0
	Eq_15 tFFFFFFA4;	// FFFFFFA4
	word32 dwFFFFFFEC;	// FFFFFFEC
} Eq_1292;

typedef code Eq_1311Eq_15 Eq_1311Eq_15 Eq_1311struct Eq_1311 {
	code * ptr0028;	// 28
	Eq_15 t0034;	// 34
	Eq_15 t0050;	// 50
	word32 dw0080;	// 80
	word32 dw00A0;	// A0
	word32 dw00A4;	// A4
} Eq_1311;

typedef Eq_1316 Eq_1316struct Eq_1316 {	// size: 20 14
	word32 dw0000;	// 0
	word32 dw000C;	// C
	word32 dw0010;	// 10
	Eq_1316 t0014;	// 14
} Eq_1316;

typedef union Eq_1350 {
	int32 u0;
	uint32 u1;
} Eq_1350;

typedef union Eq_1371 {
	int32 u0;
	uint32 u1;
} Eq_1371;

typedef Eq_1391 Eq_1391struct Eq_1391 {	// size: 4 4
	word32 dw0000;	// 0
	Eq_1391 t0004;	// 4
} Eq_1391;

typedef Eq_1392 Eq_1392struct Eq_1392 {	// size: 4 4
	word32 dw0000;	// 0
	Eq_1392 t0004;	// 4
} Eq_1392;

typedef Eq_15 (Eq_1412)(Eq_1414);

typedef union Eq_1414 {
	word32 u0;
	 LPCSTR u1;
} Eq_1414;

typedef union Eq_1457 {
	word32 u0;
	 HANDLE u1;
} Eq_1457;

typedef Eq_1457 (Eq_1458)(Eq_1460, Eq_1461, Eq_1462, Eq_1463, Eq_15, Eq_1465);

typedef union Eq_1460 {
	word32 u0;
	 HANDLE u1;
} Eq_1460;

typedef union Eq_1461 {
	word32 u0;
	 LPSECURITY_ATTRIBUTES u1;
} Eq_1461;

typedef union Eq_1462 {
	word32 u0;
	 DWORD u1;
} Eq_1462;

typedef union Eq_1463 {
	word32 u0;
	 DWORD u1;
} Eq_1463;

typedef union Eq_1465 {
	word32 u0;
	 LPCSTR u1;
} Eq_1465;

typedef  Eq_1486[]struct Eq_1486 {
	word32 dw0000;	// 0
	word32 dw0004;	// 4
	word16 a0008[];	// 8
} Eq_1486;

typedef word32 (Eq_1569)(Eq_15, Eq_1572);

typedef union Eq_1572 {
	word32 u0;
	 LPCSTR u1;
} Eq_1572;

typedef union Eq_1649 {
	word32 u0;
	 DWORD u1;
} Eq_1649;

typedef Eq_15 (Eq_1656)(Eq_1457, Eq_1649, Eq_15, Eq_1661, Eq_1662, Eq_15);

typedef union Eq_1661 {
	word32 u0;
	 DWORD u1;
} Eq_1661;

typedef union Eq_1662 {
	word32 u0;
	 SIZE_T u1;
} Eq_1662;

typedef word32 (Eq_1728)(Eq_15);

typedef word32 (Eq_1752)(Eq_15, Eq_1662, Eq_1756);

typedef union Eq_1756 {
	word32 u0;
	 DWORD u1;
} Eq_1756;

typedef void (Eq_1763)(Eq_15);

typedef void (Eq_1769)(Eq_15, word32);

typedef Eq_1930 Eq_1930struct Eq_1930 {
	Eq_1930 * ptr0000;	// 0
	word32 dw0018;	// 18
	word32 dw001C;	// 1C
} Eq_1930;

typedef Eq_1938 Eq_1935struct Eq_1935 {
	word32 dw0008;	// 8
	Eq_1938 * ptr000C;	// C
} Eq_1935;

typedef Eq_1930 Eq_1938struct Eq_1938 {
	Eq_1930 * ptr000C;	// C
} Eq_1938;

typedef word32 (Eq_2029)(Eq_2031, Eq_2032, Eq_2033);

typedef union Eq_2031 {
	word32 u0;
	 HANDLE u1;
} Eq_2031;

typedef union Eq_2032 {
	word32 u0;
	 DWORD u1;
} Eq_2032;

typedef union Eq_2033 {
	word32 u0;
	 LPVOID u1;
} Eq_2033;

typedef Eq_2031 (Eq_2034)();

typedef word32 (Eq_2050)(Eq_2031, Eq_2053, Eq_2054);

typedef union Eq_2053 {
	word32 u0;
	 DWORD u1;
} Eq_2053;

typedef union Eq_2054 {
	word32 u0;
	 SIZE_T u1;
} Eq_2054;

typedef LONGLONGLONGLONGstruct tagRECT {
	LONG;	// 0
	LONG;	// 4
	LONG;	// 8
	LONG;	// C
} Eq_2066;

typedef Eq_15 Eq_2067struct Eq_2067 {
	up32 dw0000;	// 0
	Eq_15 t0004;	// 4
	word32 dw003C;	// 3C
} Eq_2067;

typedef LONGLONGLONGLONGstruct tagRECT {
	LONG;	// 0
	LONG;	// 4
	LONG;	// 8
	LONG;	// C
} Eq_2068;

typedef DWORDLPSTRLPSTRLPSTRDWORDDWORDDWORDDWORDDWORDDWORDDWORDDWORDWORDWORDLPBYTEHANDLEHANDLEHANDLEstruct _STARTUPINFOA {
	DWORD;	// 0
	LPSTR;	// 4
	LPSTR;	// 8
	LPSTR;	// C
	DWORD;	// 10
	DWORD;	// 14
	DWORD;	// 18
	DWORD;	// 1C
	DWORD;	// 20
	DWORD;	// 24
	DWORD;	// 28
	DWORD;	// 2C
	WORD;	// 30
	WORD;	// 32
	LPBYTE;	// 34
	HANDLE;	// 38
	HANDLE;	// 3C
	HANDLE;	// 40
} Eq_2071;

typedef DWORDLPVOIDBOOLstruct _SECURITY_ATTRIBUTES {
	DWORD;	// 0
	LPVOID;	// 4
	BOOL;	// 8
} Eq_2074;

typedef DWORDDWORDstruct struct_61 {
	DWORD;	// 0
	DWORD;	// 4
} Eq_2081;

typedef union Eq_2082 {
	 <anonymous> u0;
	 PVOID u1;
} Eq_2082;

typedef ULONG_PTRULONG_PTREq_2082 Eq_2083HANDLEstruct _OVERLAPPED {
	ULONG_PTR;	// 0
	ULONG_PTR;	// 4
	Eq_2082 t0008;	// 8
	HANDLE;	// 10
} Eq_2083;

typedef struct Eq_2085 {
	word32 dw003C;	// 3C
} Eq_2085;

typedef DWORDLPVOIDBOOLstruct _SECURITY_ATTRIBUTES {
	DWORD;	// 0
	LPVOID;	// 4
	BOOL;	// 8
} Eq_2086;

