// subject.h
// Generated on TIMESTAMP by decompiling from_pouet.net/with_source_310/ia32_com/subject.exe
// using Decompiler version VERSION

/*
// Equivalence classes ////////////
Eq_1: (struct "Globals" (FFFA0000 (ptr Eq_16) ptrFFFA0000))
	globals_t (in globals : (ptr (struct "Globals")))
Eq_2: (fn void (byte))
	T_2 (in bios_video_set_mode : ptr32)
	T_3 (in signature of bios_video_set_mode : void)
Eq_16: (segment "Eq_16" (0 byte b0000))
	T_16 (in 0xA000 : selector)
	T_134 (in es : (ptr Eq_16))
	T_160 (in es : (ptr Eq_16))
Eq_27: (segment "Eq_27" (236 Eq_56 t0236) (238 Eq_56 t0238) (23A word16 w023A) (23C Eq_60 t023C) (23E Eq_56 t023E) (240 int16 w0240) (242 word16 w0242) (244 Eq_60 t0244) (246 Eq_56 t0246) (248 word16 w0248) (24A word16 w024A) (24C word16 w024C) (24E uint16 w024E) (36D1 uint16 w36D1))
	T_27 (in ds : (ptr Eq_27))
	T_135 (in ds : (ptr Eq_27))
	T_161 (in ds : (ptr Eq_27))
	T_237 (in ds : (ptr Eq_27))
	T_256 (in ds : (ptr Eq_27))
Eq_30: (fn void (byte))
	T_30 (in __syscall : ptr32)
Eq_56: (union "Eq_56" (int16 u0) (uint16 u1))
	T_56 (in bx_168 : Eq_56)
	T_58 (in Mem39[ds:0x0238:word16] : word16)
	T_70 (in bx : Eq_56)
	T_71 (in fn0C00_029C(bx_168) : word16)
	T_73 (in Mem59[ds:0x0238:word16] : word16)
	T_74 (in bx_63 : Eq_56)
	T_77 (in Mem59[ds:0x0236:word16] : word16)
	T_80 (in Mem59[ds:0x0236:word16] + Mem59[ds:0x023A:word16] : word16)
	T_81 (in fn0C00_029C(Mem59[ds:0x0236:word16] + Mem59[ds:0x023A:word16]) : word16)

T_304: (in 0x023E : word16)
  Class: Eq_304
  DataType: (memptr (ptr Eq_27) Eq_56)
  OrigDataType: (memptr T_256 (struct (0 T_305 t0000)))
T_305: (in Mem17[ds:0x023E:word16] : word16)
  Class: Eq_56
  DataType: Eq_56
  OrigDataType: word16
T_306: (in 0x00A0 : word16)
  Class: Eq_60
  DataType: int16
  OrigDataType: word16
T_307: (in 0x023C : word16)
  Class: Eq_307
  DataType: (memptr (ptr Eq_27) Eq_60)
  OrigDataType: (memptr T_256 (struct (0 T_308 t0000)))
T_308: (in Mem18[ds:0x023C:word16] : word16)
  Class: Eq_60
  DataType: Eq_60
  OrigDataType: word16
T_309: (in 0x001E : word16)
  Class: Eq_85
  DataType: word16
  OrigDataType: word16
T_310: (in 0x0248 : word16)
  Class: Eq_310
  DataType: (memptr (ptr Eq_27) word16)
  OrigDataType: (memptr T_256 (struct (0 T_311 t0000)))
T_311: (in Mem19[ds:0x0248:word16] : word16)
  Class: Eq_85
  DataType: word16
  OrigDataType: word16
T_312: (in 0x0000 : word16)
  Class: Eq_312
  DataType: word16
  OrigDataType: word16
T_313: (in bx + 0x0000 : word16)
  Class: Eq_313
  DataType: word16
  OrigDataType: word16
T_314: (in Mem0[ds:bx + 0x0000:word16] : word16)
  Class: Eq_290
  DataType: int16
  OrigDataType: word16
T_315: (in 0x0001 : word16)
  Class: Eq_315
  DataType: word16
  OrigDataType: word16
T_316: (in ds->*bx + 0x0001 : word16)
  Class: Eq_290
  DataType: int16
  OrigDataType: word16
T_317: (in 0x0000 : word16)
  Class: Eq_317
  DataType: word16
  OrigDataType: word16
T_318: (in bx + 0x0000 : word16)
  Class: Eq_318
  DataType: word16
  OrigDataType: word16
T_319: (in Mem21[ds:bx + 0x0000:word16] : word16)
  Class: Eq_290
  DataType: int16
  OrigDataType: word16
T_320: (in 0x0002 : word16)
  Class: Eq_56
  DataType: int16
  OrigDataType: int16
T_321: (in bx > 0x0002 : bool)
  Class: Eq_321
  DataType: bool
  OrigDataType: bool
T_322: (in true : bool)
  Class: Eq_322
  DataType: bool
  OrigDataType: bool
T_323: (in 0x0002 : word16)
  Class: Eq_56
  DataType: int16
  OrigDataType: word16
T_324: (in 0x00BD : word16)
  Class: Eq_56
  DataType: int16
  OrigDataType: word16
T_325: (in cx != dx : bool)
  Class: Eq_325
  DataType: bool
  OrigDataType: bool
T_326: (in ax < bx : bool)
  Class: Eq_326
  DataType: bool
  OrigDataType: bool
T_327: (in 0x000A : word16)
  Class: Eq_327
  DataType: word16
  OrigDataType: word16
T_328: (in bx + 0x000A : word16)
  Class: Eq_56
  DataType: Eq_56
  OrigDataType: int16
T_329: (in ax >= bx.u0 : bool)
  Class: Eq_329
  DataType: bool
  OrigDataType: bool
T_330: (in 0x0240 : word16)
  Class: Eq_330
  DataType: (memptr (ptr Eq_27) int16)
  OrigDataType: (memptr T_237 (struct (0 T_331 t0000)))
T_331: (in Mem0[ds:0x0240:word16] : word16)
  Class: Eq_227
  DataType: int16
  OrigDataType: int16
T_332: (in -ds->w0240 : word16)
  Class: Eq_227
  DataType: int16
  OrigDataType: int16
T_333: (in Mem22[ds:0x0240:word16] : word16)
  Class: Eq_227
  DataType: int16
  OrigDataType: word16
*/
typedef Eq_16 Eq_1struct Globals {
	Eq_16 * ptrFFFA0000;	// FFFA0000
} Eq_1;

typedef void (Eq_2)(byte);

typedef struct Eq_16 {
	byte b0000;	// 0
} Eq_16;

typedef Eq_56 Eq_27Eq_56 Eq_27Eq_60 Eq_27Eq_56 Eq_27Eq_60 Eq_27Eq_56 Eq_27struct Eq_27 {
	Eq_56 t0236;	// 236
	Eq_56 t0238;	// 238
	word16 w023A;	// 23A
	Eq_60 t023C;	// 23C
	Eq_56 t023E;	// 23E
	int16 w0240;	// 240
	word16 w0242;	// 242
	Eq_60 t0244;	// 244
	Eq_56 t0246;	// 246
	word16 w0248;	// 248
	word16 w024A;	// 24A
	word16 w024C;	// 24C
	uint16 w024E;	// 24E
	uint16 w36D1;	// 36D1
} Eq_27;

typedef void (Eq_30)(byte);

typedef union Eq_56 {
	int16 u0;
	uint16 u1;
} Eq_56;

typedef union Eq_60 {
	int16 u0;
	byte Eq_16::* u1;
} Eq_60;

typedef Eq_56 (Eq_68)(Eq_56);

typedef byte (Eq_115)(word16);

typedef byte (Eq_122)(word16);

typedef byte (Eq_129)(Eq_56, Eq_60, byte, Eq_16 *, Eq_27 *);

typedef void (Eq_155)(Eq_56, Eq_60, byte, Eq_16 *, Eq_27 *);

typedef byte (Eq_208)(byte *);

typedef void (Eq_215)();

typedef void (Eq_231)(Eq_56, Eq_60, Eq_60, Eq_56, Eq_27 *);

typedef void (Eq_252)(Eq_56, int16 Eq_27::*, Eq_27 *);

