// subject.h
// Generated on TIMESTAMP by decompiling malware_via_email/malware_1363/ia32_pe/subject.exe
// using Decompiler version VERSION

/*
// Equivalence classes ////////////
Eq_1: (struct "Globals" (407000 up32 dw407000) (407004 up32 dw407004) (40B328 Eq_27 t40B328) (40B32C word32 dw40B32C) (40B330 up32 dw40B330) (40B334 word32 dw40B334) (40B338 Eq_27 t40B338) (40B33C word32 dw40B33C) (40B340 word32 dw40B340) (40B344 word32 dw40B344) (40B348 word32 dw40B348) (40B34C (ptr Eq_214) ptr40B34C) (40B350 (ptr code) ptr40B350))
	globals_t (in globals : (ptr (struct "Globals")))
Eq_25: (fn (ptr code) (Eq_27, Eq_28))
	T_25 (in GetProcAddress : ptr32)
	T_26 (in signature of GetProcAddress : void)
	T_83 (in GetProcAddress : ptr32)
	T_119 (in GetProcAddress : ptr32)
	T_262 (in GetProcAddress : ptr32)
	T_346 (in GetProcAddress : ptr32)
	T_363 (in GetProcAddress : ptr32)
	T_493 (in GetProcAddress : ptr32)
	T_977 (in GetProcAddress : ptr32)
Eq_27: (union "Eq_27" ((ptr Eq_1189) u0) (HANDLE u1) (HMODULE u2) (LPCSTR u3) (LPVOID u4) (SIZE_T u5))
	T_27 (in hModule : HMODULE)
	T_31 (in lpLibFileName : LPCSTR)
	T_32 (in 0x0040B204 : word32)
	T_33 (in LoadLibraryA(0x0040B204) : word32)
	T_72 (in 0x0040B230 : word32)
	T_75 (in Mem130[fp - 0x000000B4:word32] : word32)
	T_77 (in 0x00000080 : word32)
	T_78 (in LoadLibraryA(0x00000080) : word32)
	T_81 (in Mem134[fp - 0x000000B4:word32] : word32)
	T_91 (in 0x0040B240 : word32)
	T_94 (in Mem142[fp - 0x000000B4:word32] : word32)

  Class: Eq_1165
  DataType: word32
  OrigDataType: word32
T_1166: (in ecx_16 & 0x0000007F : word32)
  Class: Eq_1166
  DataType: word32
  OrigDataType: word32
T_1167: (in 0x00000007 : word32)
  Class: Eq_1167
  DataType: word32
  OrigDataType: word32
T_1168: (in dwLoc08_12 << 0x00000007 : word32)
  Class: Eq_1168
  DataType: ui32
  OrigDataType: ui32
T_1169: (in ecx_16 & 0x0000007F | dwLoc08_12 << 0x00000007 : word32)
  Class: Eq_1154
  DataType: word32
  OrigDataType: word32
T_1170: (in edx_29 : word32)
  Class: Eq_1156
  DataType: word32
  OrigDataType: word32
T_1171: (in 0x00000001 : word32)
  Class: Eq_1171
  DataType: word32
  OrigDataType: word32
T_1172: (in dwLoc10_13 + 0x00000001 : word32)
  Class: Eq_1156
  DataType: word32
  OrigDataType: word32
T_1173: (in 0x00000001 : word32)
  Class: Eq_1173
  DataType: word32
  OrigDataType: word32
T_1174: (in dwArg08 + 0x00000001 : word32)
  Class: Eq_1159
  DataType: (ptr Eq_1159)
  OrigDataType: word32
T_1175: (in 0x00000080 : word32)
  Class: Eq_1175
  DataType: word32
  OrigDataType: word32
T_1176: (in ecx_16 & 0x00000080 : word32)
  Class: Eq_1176
  DataType: word32
  OrigDataType: word32
T_1177: (in 0x00000000 : word32)
  Class: Eq_1176
  DataType: word32
  OrigDataType: word32
T_1178: (in (ecx_16 & 0x00000080) != 0x00000000 : bool)
  Class: Eq_1178
  DataType: bool
  OrigDataType: bool
T_1179: (in dwArg04 : word32)
  Class: Eq_1179
  DataType: (ptr word32)
  OrigDataType: (ptr (struct (0 T_1182 t0000)))
T_1180: (in 0x00000000 : word32)
  Class: Eq_1180
  DataType: word32
  OrigDataType: word32
T_1181: (in dwArg04 + 0x00000000 : word32)
  Class: Eq_1181
  DataType: word32
  OrigDataType: word32
T_1182: (in Mem39[dwArg04 + 0x00000000:word32] : word32)
  Class: Eq_1154
  DataType: word32
  OrigDataType: word32
T_1183:
  Class: Eq_1183
  DataType: word16
  OrigDataType: (struct 0002 (0 T_554 t0000))
T_1184:
  Class: Eq_1183
  DataType: word16
  OrigDataType: (struct 0002 (0 T_566 t0000))
T_1185:
  Class: Eq_1183
  DataType: word16
  OrigDataType: (struct 0002 (0 T_579 t0000))
T_1186:
  Class: Eq_1186
  DataType: word16
  OrigDataType: (struct 0002 (0 T_1034 t0000))
T_1187:
  Class: Eq_1186
  DataType: word16
  OrigDataType: (struct 0002 (0 T_1048 t0000))
T_1188:
  Class: Eq_1186
  DataType: word16
  OrigDataType: (struct 0002 (0 T_1063 t0000))
T_1189:
  Class: Eq_1189
  DataType: Eq_1189
  OrigDataType: 
T_1190:
  Class: Eq_1190
  DataType: int32
  OrigDataType: 
T_1191:
  Class: Eq_1191
  DataType: Eq_1191
  OrigDataType: 
*/
typedef Eq_27 Eq_1Eq_27 Eq_1Eq_214 Eq_1code Eq_1struct Globals {
	up32 dw407000;	// 407000
	up32 dw407004;	// 407004
	Eq_27 t40B328;	// 40B328
	word32 dw40B32C;	// 40B32C
	up32 dw40B330;	// 40B330
	word32 dw40B334;	// 40B334
	Eq_27 t40B338;	// 40B338
	word32 dw40B33C;	// 40B33C
	word32 dw40B340;	// 40B340
	word32 dw40B344;	// 40B344
	word32 dw40B348;	// 40B348
	Eq_214 * ptr40B34C;	// 40B34C
	code * ptr40B350;	// 40B350
} Eq_1;

typedef code * (Eq_25)(Eq_27, Eq_28);

typedef union Eq_27 {
	Eq_1189* u0;
	 HANDLE u1;
	 HMODULE u2;
	 LPCSTR u3;
	 LPVOID u4;
	 SIZE_T u5;
} Eq_27;

typedef union Eq_28 {
	word32 u0;
	 LPCSTR u1;
} Eq_28;

typedef Eq_27 (Eq_29)(Eq_27);

typedef word32 (Eq_36)(Eq_38, Eq_39);

typedef union Eq_38 {
	word32 u0;
	 LPSTR u1;
} Eq_38;

typedef union Eq_39 {
	word32 u0;
	 LPCSTR u1;
} Eq_39;

typedef Eq_27 Eq_40Eq_27 Eq_40struct Eq_40 {
	up32 dwFFFFFF38;	// FFFFFF38
	word32 dwFFFFFF3C;	// FFFFFF3C
	Eq_27 tFFFFFF40;	// FFFFFF40
	word32 dwFFFFFF44;	// FFFFFF44
	word32 dwFFFFFF48;	// FFFFFF48
	Eq_27 tFFFFFF4C;	// FFFFFF4C
	word32 dwFFFFFF50;	// FFFFFF50
} Eq_40;

typedef word32 (Eq_46)(Eq_48, Eq_49, Eq_50, Eq_51, Eq_52, Eq_53, Eq_54);

typedef union Eq_48 {
	word32 u0;
	 LPCSTR u1;
} Eq_48;

typedef union Eq_49 {
	word32 u0;
	 DWORD u1;
} Eq_49;

typedef union Eq_50 {
	word32 u0;
	 DWORD u1;
} Eq_50;

typedef union Eq_51 {
	word32 u0;
	 LPSECURITY_ATTRIBUTES u1;
} Eq_51;

typedef union Eq_52 {
	word32 u0;
	 DWORD u1;
} Eq_52;

typedef union Eq_53 {
	word32 u0;
	 DWORD u1;
} Eq_53;

typedef union Eq_54 {
	word32 u0;
	 HANDLE u1;
} Eq_54;

typedef Eq_27 (Eq_138)(Eq_27);

typedef word32 (Eq_183)(word32);

typedef void (Eq_193)(ptr32, word32, word32);

typedef Eq_214 Eq_212struct Eq_212 {
	Eq_214 * ptr0018;	// 18
} Eq_212;

typedef union Eq_213 {
	ptr32 u0;
	Eq_214* Eq_212::* u1;
} Eq_213;

typedef Eq_929 Eq_214struct Eq_214 {
	Eq_929 * ptr0030;	// 30
} Eq_214;

typedef struct Eq_226 {
	word32 dw0008;	// 8
} Eq_226;

typedef struct Eq_233 {
	word32 dw0008;	// 8
} Eq_233;

typedef void (Eq_239)(word32, Eq_27);

typedef void (Eq_253)(word32, word32);

typedef word32 (Eq_266)(Eq_268, Eq_269);

typedef union Eq_268 {
	word32 u0;
	 LPSTR u1;
} Eq_268;

typedef union Eq_269 {
	word32 u0;
	 LPCSTR u1;
} Eq_269;

typedef Eq_27 Eq_270Eq_27 Eq_270struct Eq_270 {
	Eq_27 tFFFFFF20;	// FFFFFF20
	word32 dwFFFFFF2C;	// FFFFFF2C
	Eq_27 tFFFFFF34;	// FFFFFF34
	word32 dwFFFFFF38;	// FFFFFF38
	word32 dwFFFFFFE4;	// FFFFFFE4
} Eq_270;

typedef Eq_407 Eq_275Eq_27 Eq_275struct Eq_275 {
	word16 w0006;	// 6
	word16 w0014;	// 14
	Eq_407 t003C;	// 3C
	Eq_27 t0050;	// 50
} Eq_275;

typedef Eq_281 Eq_281struct Eq_281 {	// size: 40 28
	word32 dw000C;	// C
	word32 dw0010;	// 10
	word32 dw0014;	// 14
	Eq_281 t0028;	// 28
} Eq_281;

typedef Eq_27 (Eq_290)(Eq_27, Eq_27, Eq_294, Eq_295);

typedef union Eq_294 {
	word32 u0;
	 DWORD u1;
} Eq_294;

typedef union Eq_295 {
	word32 u0;
	 DWORD u1;
} Eq_295;

typedef void (Eq_323)(Eq_27, Eq_27, Eq_27);

typedef union Eq_407 {
	int32 u0;
	uint32 u1;
} Eq_407;

typedef union Eq_428 {
	int32 u0;
	uint32 u1;
} Eq_428;

typedef code * (Eq_435)(Eq_27, word32);

typedef Eq_444 Eq_444struct Eq_444 {	// size: 20 14
	word32 dw0000;	// 0
	word32 dw000C;	// C
	word32 dw0010;	// 10
	Eq_444 t0014;	// 14
} Eq_444;

typedef code Eq_453Eq_453 Eq_453struct Eq_453 {	// size: 4 4
	code * ptr0000;	// 0
	Eq_453 t0004;	// 4
} Eq_453;

typedef code Eq_454Eq_454 Eq_454struct Eq_454 {	// size: 4 4
	code * ptr0000;	// 0
	Eq_454 t0004;	// 4
} Eq_454;

typedef  Eq_515[]struct Eq_515 {
	word32 dw0000;	// 0
	word32 dw0004;	// 4
	word16 a0008[];	// 8
} Eq_515;

typedef Eq_27 Eq_670Eq_27 Eq_670Eq_27 Eq_670struct Eq_670 {
	Eq_27 tFFFFFFF8;	// FFFFFFF8
	Eq_27 tFFFFFFFC;	// FFFFFFFC
	Eq_27 t0000;	// 0
} Eq_670;

typedef word32 (Eq_676)(Eq_27);

typedef void (Eq_727)(Eq_27);

typedef void (Eq_745)(Eq_27, Eq_27);

typedef Eq_27 Eq_778Eq_27 Eq_778struct Eq_778 {
	Eq_27 tFFFFFFEC;	// FFFFFFEC
	word32 dwFFFFFFF0;	// FFFFFFF0
	word32 dwFFFFFFF4;	// FFFFFFF4
	word32 dwFFFFFFF8;	// FFFFFFF8
	word32 dwFFFFFFFC;	// FFFFFFFC
	Eq_27 t0000;	// 0
} Eq_778;

typedef Eq_27 Eq_809Eq_27 Eq_809struct Eq_809 {
	Eq_27 tFFFFFFEC;	// FFFFFFEC
	word32 dwFFFFFFF0;	// FFFFFFF0
	word32 dwFFFFFFF4;	// FFFFFFF4
	word32 dwFFFFFFF8;	// FFFFFFF8
	word32 dwFFFFFFFC;	// FFFFFFFC
	Eq_27 t0000;	// 0
} Eq_809;

typedef Eq_27 Eq_845Eq_27 Eq_845Eq_294 Eq_845Eq_295 Eq_845struct Eq_845 {
	Eq_27 tFFFFFFF4;	// FFFFFFF4
	Eq_27 tFFFFFFF8;	// FFFFFFF8
	Eq_294 tFFFFFFFC;	// FFFFFFFC
	Eq_295 t0000;	// 0
} Eq_845;

typedef Eq_27 Eq_884Eq_27 Eq_884Eq_294 Eq_884Eq_295 Eq_884struct Eq_884 {
	Eq_27 tFFFFFFF4;	// FFFFFFF4
	Eq_27 tFFFFFFF8;	// FFFFFFF8
	Eq_294 tFFFFFFFC;	// FFFFFFFC
	Eq_295 t0000;	// 0
} Eq_884;

typedef Eq_924 Eq_924struct Eq_924 {
	Eq_924 * ptr0000;	// 0
	word32 dw0018;	// 18
	word32 dw001C;	// 1C
} Eq_924;

typedef Eq_932 Eq_929struct Eq_929 {
	word32 dw0008;	// 8
	Eq_932 * ptr000C;	// C
} Eq_929;

typedef Eq_924 Eq_932struct Eq_932 {
	Eq_924 * ptr000C;	// C
} Eq_932;

typedef Eq_27 Eq_971struct Eq_971 {
	Eq_27 t0050;	// 50
	word32 dw00A0;	// A0
	word32 dw00A4;	// A4
} Eq_971;

typedef  Eq_1009[]struct Eq_1009 {
	word32 dw0000;	// 0
	word32 dw0004;	// 4
	word16 a0008[];	// 8
} Eq_1009;

typedef word32 (Eq_1108)(word32, word32);

typedef Eq_1159 Eq_1159struct Eq_1159 {	// size: 1 1
	byte b0000;	// 0
	Eq_1159 t0001;	// 1
} Eq_1159;

typedef code Eq_1189Eq_27 Eq_1189Eq_27 Eq_1189struct Eq_1189 {
	code * ptr0028;	// 28
	Eq_27 t0034;	// 34
	word32 dw003C;	// 3C
	Eq_27 t0050;	// 50
	word32 dw0080;	// 80
	word32 dw00A0;	// A0
	word32 dw00A4;	// A4
} Eq_1189;

typedef DWORDLPVOIDBOOLstruct _SECURITY_ATTRIBUTES {
	DWORD;	// 0
	LPVOID;	// 4
	BOOL;	// 8
} Eq_1191;

