// subject.h
// Generated on TIMESTAMP by decompiling from_pouet.net/with_source_155/ia32_com/subject.exe
// using Decompiler version VERSION

/*
// Equivalence classes ////////////
Eq_1: (struct "Globals" (FFFA0000 (ptr Eq_99) ptrFFFA0000))
	globals_t (in globals : (ptr (struct "Globals")))
Eq_2: (fn void (byte))
	T_2 (in bios_video_set_mode : ptr32)
	T_3 (in signature of bios_video_set_mode : void)
Eq_15: (fn Eq_17 (Eq_16))
	T_15 (in sin : ptr32)
Eq_16: (union (real16 u0) (real64 u1))
	T_16 (in rLoc2 : real64)
	T_22 (in sin(rLoc2) * (real64) Mem0[ds:0x0143:word16] : word16)
Eq_17: (union (real16 u0) (real64 u1))
	T_17 (in sin(rLoc2) : real64)
Eq_18: (segment (143 word16 w0143))
	T_18 (in ds : selector)
Eq_19: (struct (0 word16 w0000))
	T_19 (in 0x0143 : word16)
Eq_21: (union (real16 u0) (real64 u1))
	T_21 (in (real64) Mem0[ds:0x0143:word16] : real64)
Eq_23: (union (int16 u0) (byte u1) ((memptr (ptr Eq_18) (struct 0002 (0 word16 w0000))) u2))
	T_23 (in (int16) rLoc2 : int16)
	T_27 (in Mem25[dx_8:bx + 0x0000:int16] : int16)
	T_28 (in si : word16)
	T_31 (in Mem28[dx:bx + 0x0000:word16] : word16)
	T_52 (in Mem28[dx:bx + ax_59:byte] : byte)
	T_58 (in Mem28[dx:bx + ax_59:byte] - ch_39 - (bh_32 *s bh_32 + ax_68 <u 0x0383) : word16)
	T_60 (in Mem78[dx:bx + ax_59:byte] : byte)
	T_77 (in si + 0x0002 : word16)
	T_110 (in Mem217[ss:sp_184 - 0x000C:word16] : word16)
	T_111 (in si_125 : word16)
	T_165 (in Mem197[ss:sp_184 - 0x000C:word16] : word16)

  Class: Eq_7
  DataType: word16
  OrigDataType: word16
T_267: (in 0x0004 : word16)
  Class: Eq_267
  DataType: word16
  OrigDataType: word16
T_268: (in sp_108 - 0x0004 : word16)
  Class: Eq_268
  DataType: word16
  OrigDataType: word16
T_269: (in Mem114[ss:sp_108 - 0x0004:word16] : word16)
  Class: Eq_11
  DataType: word16
  OrigDataType: word16
T_270: (in 0x0006 : word16)
  Class: Eq_270
  DataType: word16
  OrigDataType: word16
T_271: (in sp_108 - 0x0006 : word16)
  Class: Eq_271
  DataType: word16
  OrigDataType: word16
T_272: (in Mem116[ss:sp_108 - 0x0006:word16] : word16)
  Class: Eq_24
  DataType: (memptr word16 Eq_24)
  OrigDataType: word16
T_273: (in 0x0008 : word16)
  Class: Eq_273
  DataType: word16
  OrigDataType: word16
T_274: (in sp_108 - 0x0008 : word16)
  Class: Eq_274
  DataType: word16
  OrigDataType: word16
T_275: (in sp_108 - 0x0008 : word16)
  Class: Eq_275
  DataType: word16
  OrigDataType: word16
T_276: (in Mem118[ss:sp_108 - 0x0008:word16] : word16)
  Class: Eq_274
  DataType: word16
  OrigDataType: word16
T_277: (in 0x000A : word16)
  Class: Eq_277
  DataType: word16
  OrigDataType: word16
T_278: (in sp_108 - 0x000A : word16)
  Class: Eq_278
  DataType: word16
  OrigDataType: word16
T_279: (in Mem120[ss:sp_108 - 0x000A:word16] : word16)
  Class: Eq_48
  DataType: int16
  OrigDataType: word16
T_280: (in 0x000C : word16)
  Class: Eq_280
  DataType: word16
  OrigDataType: word16
T_281: (in sp_108 - 0x000C : word16)
  Class: Eq_281
  DataType: word16
  OrigDataType: word16
T_282: (in Mem122[ss:sp_108 - 0x000C:word16] : word16)
  Class: Eq_23
  DataType: Eq_23
  OrigDataType: word16
T_283: (in 0x000E : word16)
  Class: Eq_283
  DataType: word16
  OrigDataType: word16
T_284: (in sp_108 - 0x000E : word16)
  Class: Eq_284
  DataType: word16
  OrigDataType: word16
T_285: (in Mem124[ss:sp_108 - 0x000E:word16] : word16)
  Class: Eq_78
  DataType: (memptr (ptr Eq_99) Eq_78)
  OrigDataType: word16
T_286: (in 0x0140 : word16)
  Class: Eq_103
  DataType: word16
  OrigDataType: word16
T_287: (in sp_108 - 0x000E : word16)
  Class: Eq_186
  DataType: word16
  OrigDataType: word16
T_288: (in 0x0000 : word16)
  Class: Eq_288
  DataType: word16
  OrigDataType: word16
T_289: (in bx + 0x0000 : word16)
  Class: Eq_289
  DataType: word16
  OrigDataType: word16
T_290: (in Mem124[dx_8:bx + 0x0000:word16] : word16)
  Class: Eq_23
  DataType: Eq_23
  OrigDataType: word16
T_291: (in 0x0060 : word16)
  Class: Eq_291
  DataType: word16
  OrigDataType: word16
T_292: (in bx + 0x0060 : word16)
  Class: Eq_292
  DataType: word16
  OrigDataType: word16
T_293: (in Mem124[dx_8:bx + 0x0060:word16] : word16)
  Class: Eq_114
  DataType: word16
  OrigDataType: word16
T_294: (in 0xC8 : byte)
  Class: Eq_294
  DataType: byte
  OrigDataType: byte
T_295: (in DPB(cx_282, 0xC8, 0, 8) : word16)
  Class: Eq_124
  DataType: word16
  OrigDataType: word16
*/
typedef  Eq_1struct Globals {
	 * ptrFFFA0000;	// FFFA0000
} Eq_1;

typedef void (Eq_2)(byte);

typedef  (Eq_15)();

typedef union  {
	real16 u0;
	real64 u1;
} Eq_16;

typedef union  {
	real16 u0;
	real64 u1;
} Eq_17;

typedef struct  {
	word16 w0143;	// 143
} Eq_18;

typedef struct  {
	word16 w0000;	// 0
} Eq_19;

typedef union  {
	real16 u0;
	real64 u1;
} Eq_21;

typedef union  {
	int16 u0;
	byte u1;
	struct <anonymous> Eq_18::* u2;
} Eq_23;

typedef  Eq_24struct  {	// size: 1 1
	 t0000;	// 0
	word16 w0060;	// 60
} Eq_24;

typedef struct  {
	byte b0000;	// 0
} Eq_78;

typedef union  {
	ui16 u0;
	struct <anonymous> word16::* u1;
} Eq_85;

typedef  Eq_91 Eq_91 Eq_91struct  {
	 Eq_99::*ptrFFFFFFF2;	// FFFFFFF2
	 tFFFFFFF4;	// FFFFFFF4
	word16 wFFFFFFF6;	// FFFFFFF6
	word16 wFFFFFFF8;	// FFFFFFF8
	 word16::*ptrFFFFFFFA;	// FFFFFFFA
	word16 wFFFFFFFC;	// FFFFFFFC
	word16 wFFFFFFFE;	// FFFFFFFE
	word16 w0000;	// 0
	word16 w0002;	// 2
	 t0004;	// 4
	word16 w0006;	// 6
	word16 w000A;	// A
	word16 w000C;	// C
	word16 w000E;	// E
	word16 w0010;	// 10
	 Eq_99::*ptr0012;	// 12
	 t0014;	// 14
	int16 w0016;	// 16
	word16 w001A;	// 1A
	word16 w001C;	// 1C
	word16 w001E;	// 1E
} Eq_91;

typedef struct  {
} Eq_99;

typedef struct  {
} Eq_104;

typedef  Eq_205struct  {
	 Eq_99::*ptrFFFFFFF2;	// FFFFFFF2
	 tFFFFFFF4;	// FFFFFFF4
	word16 wFFFFFFF6;	// FFFFFFF6
	word16 wFFFFFFF8;	// FFFFFFF8
	 word16::*ptrFFFFFFFA;	// FFFFFFFA
	word16 wFFFFFFFC;	// FFFFFFFC
	word16 wFFFFFFFE;	// FFFFFFFE
	word16 w0000;	// 0
} Eq_205;

typedef  Eq_257struct  {
	 Eq_99::*ptrFFFFFFF2;	// FFFFFFF2
	 tFFFFFFF4;	// FFFFFFF4
	int16 wFFFFFFF6;	// FFFFFFF6
	word16 wFFFFFFF8;	// FFFFFFF8
	 word16::*ptrFFFFFFFA;	// FFFFFFFA
	word16 wFFFFFFFC;	// FFFFFFFC
	word16 wFFFFFFFE;	// FFFFFFFE
	word16 w0000;	// 0
} Eq_257;

