// subject.h
// Generated on TIMESTAMP by decompiling malware_via_email/malware_0762/ia32_pe/subject.exe
// using Decompiler version VERSION

/*
// Equivalence classes ////////////
Eq_1: (struct "Globals" (40409C (struct "Eq_2227" (0 up32 dw0000) (4 Eq_5 t0004) (3C word32 dw003C)) t40409C) (4040B4 (struct "Eq_2227") t4040B4) (4040C8 (struct "Eq_2227") t4040C8) (404100 word32 dw404100) (404104 int32 dw404104) (404108 int32 dw404108) (40410C int32 dw40410C) (404110 int32 dw404110) (404114 word32 dw404114) (404118 Eq_5 t404118) (40411C (ptr Eq_991) ptr40411C) (404120 int32 dw404120) (404124 word32 dw404124) (404128 int32 dw404128) (40412C Eq_5 t40412C) (404130 word32 dw404130) (404134 int32 dw404134) (404138 Eq_5 t404138) (40413C (ptr Eq_1028) ptr40413C) (404140 (ptr code) ptr404140) (404144 int32 dw404144))
	globals_t (in globals : (ptr (struct "Globals")))
Eq_5: (union "Eq_5" ((ptr Eq_2227) u0) (DWORD u1) (HCURSOR u2) (HICON u3) (HINSTANCE u4) (HMODULE u5) (LPCSTR u6) (LPCVOID u7) (LPSTARTUPINFOA u8) (LPSTR u9) (LPVOID u10) (UINT u11))
	T_5 (in eax_12 : Eq_5)
	T_8 (in hInstance : HINSTANCE)
	T_10 (in 0x00000000 : word32)
	T_12 (in LoadIconA(0x00000000, 0x00404000) : word32)
	T_18 (in 0x00000000 : word32)
	T_23 (in Mem27[fp - 0x00000030:word32] : word32)
	T_26 (in hIcon : HICON)
	T_27 (in 0x00404000 : word32)
	T_323 (in lpModuleName : LPCSTR)
	T_324 (in 0x00000000 : word32)
	T_325 (in GetModuleHandleA(0x00000000) : word32)
	T_334 (in 0x00000000 : word32)

T_2216: (in dwLoc10 *s dwLoc10 + 0x00083B9E : word32)
  Class: Eq_2216
  DataType: word32
  OrigDataType: word32
T_2217: (in (byte) (dwLoc10 *s dwLoc10 + 0x00083B9E) : byte)
  Class: Eq_2217
  DataType: uint8
  OrigDataType: uint8
T_2218: (in dwLoc10 >> (byte) (dwLoc10 *s dwLoc10 + 0x00083B9E) : word32)
  Class: Eq_209
  DataType: int32
  OrigDataType: int32
T_2219: (in 0x00404144 : ptr32)
  Class: Eq_2219
  DataType: (ptr int32)
  OrigDataType: (ptr (struct (0 T_2220 t0000)))
T_2220: (in Mem33[0x00404144:word32] : word32)
  Class: Eq_209
  DataType: int32
  OrigDataType: word32
T_2221:
  Class: Eq_2221
  DataType: word16
  OrigDataType: (struct 0002 (0 T_1361 t0000))
T_2222:
  Class: Eq_2221
  DataType: word16
  OrigDataType: (struct 0002 (0 T_1375 t0000))
T_2223:
  Class: Eq_2221
  DataType: word16
  OrigDataType: (struct 0002 (0 T_1390 t0000))
T_2224:
  Class: Eq_2224
  DataType: word16
  OrigDataType: (struct 0002 (0 T_1685 t0000))
T_2225:
  Class: Eq_2224
  DataType: word16
  OrigDataType: (struct 0002 (0 T_1697 t0000))
T_2226:
  Class: Eq_2224
  DataType: word16
  OrigDataType: (struct 0002 (0 T_1710 t0000))
T_2227:
  Class: Eq_2227
  DataType: Eq_2227
  OrigDataType: 
T_2228:
  Class: Eq_2228
  DataType: int32
  OrigDataType: 
T_2229:
  Class: Eq_2229
  DataType: int32
  OrigDataType: 
T_2230:
  Class: Eq_2230
  DataType: int32
  OrigDataType: 
T_2231:
  Class: Eq_2231
  DataType: Eq_2231
  OrigDataType: 
T_2232:
  Class: Eq_2232
  DataType: Eq_2232
  OrigDataType: 
T_2233:
  Class: Eq_2233
  DataType: int32
  OrigDataType: 
T_2234:
  Class: Eq_2234
  DataType: int32
  OrigDataType: 
T_2235:
  Class: Eq_2235
  DataType: int32
  OrigDataType: 
T_2236:
  Class: Eq_2236
  DataType: int32
  OrigDataType: 
T_2237:
  Class: Eq_2237
  DataType: int32
  OrigDataType: 
T_2238:
  Class: Eq_2238
  DataType: int32
  OrigDataType: 
T_2239:
  Class: Eq_2239
  DataType: int32
  OrigDataType: 
T_2240:
  Class: Eq_2240
  DataType: Eq_2240
  OrigDataType: 
T_2241:
  Class: Eq_2241
  DataType: Eq_2241
  OrigDataType: 
T_2242:
  Class: Eq_2242
  DataType: Eq_2242
  OrigDataType: 
T_2243:
  Class: Eq_2243
  DataType: Eq_2243
  OrigDataType: 
T_2244:
  Class: Eq_2244
  DataType: Eq_2244
  OrigDataType: 
T_2245:
  Class: Eq_2245
  DataType: Eq_2245
  OrigDataType: 
*/
typedef struct Eq_2227;
Eq_5 Eq_1Eq_991 Eq_1Eq_5 Eq_1Eq_5 Eq_1Eq_1028 Eq_1code Eq_1struct Globals {
	struct Eq_2227 t40409C;	// 40409C
	struct Eq_2227 t4040B4;	// 4040B4
	struct Eq_2227 t4040C8;	// 4040C8
	word32 dw404100;	// 404100
	int32 dw404104;	// 404104
	int32 dw404108;	// 404108
	int32 dw40410C;	// 40410C
	int32 dw404110;	// 404110
	word32 dw404114;	// 404114
	Eq_5 t404118;	// 404118
	Eq_991 * ptr40411C;	// 40411C
	int32 dw404120;	// 404120
	word32 dw404124;	// 404124
	int32 dw404128;	// 404128
	Eq_5 t40412C;	// 40412C
	word32 dw404130;	// 404130
	int32 dw404134;	// 404134
	Eq_5 t404138;	// 404138
	Eq_1028 * ptr40413C;	// 40413C
	code * ptr404140;	// 404140
	int32 dw404144;	// 404144
} Eq_1;

typedef union Eq_5 {
	Eq_2227* u0;
	 DWORD u1;
	 HCURSOR u2;
	 HICON u3;
	 HINSTANCE u4;
	 HMODULE u5;
	 LPCSTR u6;
	 LPCVOID u7;
	 LPSTARTUPINFOA u8;
	 LPSTR u9;
	 LPVOID u10;
	 UINT u11;
} Eq_5;

typedef Eq_5 (Eq_6)(Eq_5, Eq_9);

typedef union Eq_9 {
	word32 u0;
	 LPCSTR u1;
} Eq_9;

typedef Eq_5 Eq_20struct Eq_20 {
	Eq_5 tFFFFFFD0;	// FFFFFFD0
} Eq_20;

typedef word32 (Eq_24)(Eq_5);

typedef word32 (Eq_96)(RECT *);

typedef RECT;

typedef word32 (Eq_147)(word32, word32);

typedef Eq_202 Eq_202struct Eq_202 {	// size: 1 1
	byte b0000;	// 0
	Eq_202 t0001;	// 1
} Eq_202;

typedef word32 (Eq_242)(Eq_244, Eq_245, Eq_246, Eq_247, Eq_248, Eq_249, Eq_250);

typedef union Eq_244 {
	word32 u0;
	 LPCSTR u1;
} Eq_244;

typedef union Eq_245 {
	word32 u0;
	 DWORD u1;
} Eq_245;

typedef union Eq_246 {
	word32 u0;
	 DWORD u1;
} Eq_246;

typedef union Eq_247 {
	word32 u0;
	 LPSECURITY_ATTRIBUTES u1;
} Eq_247;

typedef union Eq_248 {
	word32 u0;
	 DWORD u1;
} Eq_248;

typedef union Eq_249 {
	word32 u0;
	 DWORD u1;
} Eq_249;

typedef union Eq_250 {
	word32 u0;
	 HANDLE u1;
} Eq_250;

typedef Eq_5 (Eq_321)(Eq_5);

typedef Eq_5 (Eq_338)(Eq_340, Eq_341);

typedef union Eq_340 {
	word32 u0;
	 HINSTANCE u1;
} Eq_340;

typedef union Eq_341 {
	word32 u0;
	 DWORD u1;
	 LPCSTR u2;
} Eq_341;

typedef word32 (Eq_376)(WNDCLASSA *);

typedef WNDCLASSA;

typedef Eq_5 Eq_379Eq_5 Eq_379Eq_5 Eq_379Eq_5 Eq_379RECT Eq_379WNDCLASSA Eq_379struct Eq_379 {
	Eq_5 tFFFFFEF0;	// FFFFFEF0
	Eq_5 tFFFFFEF4;	// FFFFFEF4
	word32 dwFFFFFEF8;	// FFFFFEF8
	Eq_5 tFFFFFEFC;	// FFFFFEFC
	Eq_5 tFFFFFF00;	// FFFFFF00
	RECT tFFFFFF38;	// FFFFFF38
	WNDCLASSA tFFFFFF4C;	// FFFFFF4C
	int32 dwFFFFFFDC;	// FFFFFFDC
} Eq_379;

typedef word32 (Eq_406)(Eq_408, Eq_409, Eq_410, Eq_411, int32, int32, int32, int32, Eq_416, Eq_417, Eq_5, Eq_419);

typedef union Eq_408 {
	word32 u0;
	 DWORD u1;
} Eq_408;

typedef union Eq_409 {
	word32 u0;
	 LPCSTR u1;
} Eq_409;

typedef union Eq_410 {
	word32 u0;
	 LPCSTR u1;
} Eq_410;

typedef union Eq_411 {
	word32 u0;
	 DWORD u1;
} Eq_411;

typedef union Eq_416 {
	word32 u0;
	 HWND u1;
} Eq_416;

typedef union Eq_417 {
	word32 u0;
	 HMENU u1;
} Eq_417;

typedef union Eq_419 {
	word32 u0;
	 LPVOID u1;
} Eq_419;

typedef word32 (Eq_464)(Eq_5);

typedef Eq_637 Eq_489struct Eq_489 {
	word16 w0006;	// 6
	word16 w0014;	// 14
	Eq_637 t003C;	// 3C
} Eq_489;

typedef void (Eq_503)(word32, byte, word32);

typedef void (Eq_524)(Eq_5);

typedef word32 (Eq_585)(Eq_587, RECT *);

typedef union Eq_587 {
	word32 u0;
	 LPRECT u1;
} Eq_587;

typedef RECT;

typedef struct Eq_612 {
	word32 dw0010;	// 10
	word32 dw0014;	// 14
} Eq_612;

typedef union Eq_637 {
	int32 u0;
	uint32 u1;
} Eq_637;

typedef union Eq_639 {
	word32 u0;
	 LONG u1;
} Eq_639;

typedef union Eq_650 {
	int32 u0;
	uint32 u1;
} Eq_650;

typedef Eq_5 (Eq_666)(word32);

typedef word32 (Eq_680)(Eq_5, Eq_5, Eq_341);

typedef Eq_5 (Eq_712)(Eq_5);

typedef word32 (Eq_730)(Eq_5);

typedef union Eq_751 {
	word32 u0;
	 DWORD u1;
} Eq_751;

typedef word32 (Eq_752)(Eq_754, Eq_755);

typedef union Eq_754 {
	word32 u0;
	 HANDLE u1;
} Eq_754;

typedef union Eq_755 {
	word32 u0;
	 LPDWORD u1;
} Eq_755;

typedef word32 (Eq_796)(Eq_798, Eq_639, Eq_800, Eq_801);

typedef union Eq_798 {
	word32 u0;
	 HANDLE u1;
	 LPVOID u2;
} Eq_798;

typedef union Eq_800 {
	word32 u0;
	 PLONG u1;
} Eq_800;

typedef union Eq_801 {
	word32 u0;
	 DWORD u1;
} Eq_801;

typedef word32 (Eq_812)(Eq_814, Eq_798, Eq_751, Eq_817, Eq_818);

typedef union Eq_814 {
	word32 u0;
	 HANDLE u1;
} Eq_814;

typedef union Eq_817 {
	word32 u0;
	 LPDWORD u1;
} Eq_817;

typedef union Eq_818 {
	word32 u0;
	 LPOVERLAPPED u1;
} Eq_818;

typedef word32 (Eq_835)(Eq_837);

typedef union Eq_837 {
	word32 u0;
	 HANDLE u1;
} Eq_837;

typedef void (Eq_854)(Eq_5, Eq_5, Eq_5);

typedef struct Eq_967 {
	word32 dw0008;	// 8
} Eq_967;

typedef struct Eq_973 {
	word32 dw0008;	// 8
} Eq_973;

typedef Eq_5 Eq_991struct Eq_991 {
	word32 dwFFFFFFEC;	// FFFFFFEC
	int32 dwFFFFFFF0;	// FFFFFFF0
	Eq_5 tFFFFFFF4;	// FFFFFFF4
	ui32 dwFFFFFFF8;	// FFFFFFF8
} Eq_991;

typedef Eq_991 * (Eq_992)(word32 *, word32, word32, up32);

typedef Eq_1028 Eq_1026struct Eq_1026 {
	Eq_1028 * ptr0018;	// 18
} Eq_1026;

typedef Eq_2077 Eq_1028struct Eq_1028 {
	Eq_2077 * ptr0030;	// 30
} Eq_1028;

typedef void (Eq_1078)(Eq_5);

typedef void (Eq_1098)(word32);

typedef word32 (Eq_1126)(word32);

typedef void (Eq_1203)(word32);

typedef Eq_1255 Eq_1250struct Eq_1250 {
	Eq_1255 t0050;	// 50
	word32 dw00A0;	// A0
	word32 dw00A4;	// A4
} Eq_1250;

typedef union Eq_1255 {
	word32 u0;
	 SIZE_T u1;
} Eq_1255;

typedef Eq_5 Eq_1256Eq_1255 Eq_1256struct Eq_1256 {
	Eq_5 tFFFFFFB4;	// FFFFFFB4
	Eq_1255 tFFFFFFB8;	// FFFFFFB8
} Eq_1256;

typedef Eq_5 (Eq_1260)(Eq_5, Eq_1255, Eq_1264, Eq_5);

typedef union Eq_1264 {
	Eq_2244* u0;
	 DWORD u1;
} Eq_1264;

typedef  Eq_1308[]struct Eq_1308 {
	word32 dw0000;	// 0
	word32 dw0004;	// 4
	word16 a0008[];	// 8
} Eq_1308;

typedef Eq_1503 Eq_1405Eq_1255 Eq_1405struct Eq_1405 {
	word16 w0006;	// 6
	word16 w0014;	// 14
	Eq_1503 t003C;	// 3C
	Eq_1255 t0050;	// 50
} Eq_1405;

typedef Eq_1411 Eq_1411struct Eq_1411 {	// size: 40 28
	word32 dw000C;	// C
	word32 dw0010;	// 10
	word32 dw0014;	// 14
	Eq_1411 t0028;	// 28
} Eq_1411;

typedef Eq_1612 Eq_1442Eq_1803 Eq_1442Eq_5 Eq_1442Eq_5 Eq_1442Eq_1264 Eq_1442Eq_5 Eq_1442struct Eq_1442 {
	Eq_1612 tFFFFFF94;	// FFFFFF94
	Eq_1803 tFFFFFF98;	// FFFFFF98
	Eq_5 tFFFFFF9C;	// FFFFFF9C
	Eq_5 tFFFFFFA0;	// FFFFFFA0
	Eq_1264 tFFFFFFA4;	// FFFFFFA4
	Eq_5 tFFFFFFA8;	// FFFFFFA8
	word32 dwFFFFFFEC;	// FFFFFFEC
} Eq_1442;

typedef code Eq_1461Eq_5 Eq_1461Eq_5 Eq_1461struct Eq_1461 {
	code * ptr0028;	// 28
	Eq_5 t0034;	// 34
	Eq_5 t0050;	// 50
	word32 dw0080;	// 80
	word32 dw00A0;	// A0
	word32 dw00A4;	// A4
} Eq_1461;

typedef Eq_1466 Eq_1466struct Eq_1466 {	// size: 20 14
	word32 dw0000;	// 0
	word32 dw000C;	// C
	word32 dw0010;	// 10
	Eq_1466 t0014;	// 14
} Eq_1466;

typedef union Eq_1503 {
	int32 u0;
	uint32 u1;
} Eq_1503;

typedef union Eq_1524 {
	int32 u0;
	uint32 u1;
} Eq_1524;

typedef Eq_1544 Eq_1544struct Eq_1544 {	// size: 4 4
	word32 dw0000;	// 0
	Eq_1544 t0004;	// 4
} Eq_1544;

typedef Eq_1545 Eq_1545struct Eq_1545 {	// size: 4 4
	word32 dw0000;	// 0
	Eq_1545 t0004;	// 4
} Eq_1545;

typedef Eq_5 (Eq_1568)(Eq_1570);

typedef union Eq_1570 {
	word32 u0;
	 LPCSTR u1;
} Eq_1570;

typedef union Eq_1612 {
	word32 u0;
	 HANDLE u1;
} Eq_1612;

typedef Eq_1612 (Eq_1613)(Eq_1615, Eq_1616, Eq_1617, Eq_1618, Eq_5, Eq_1620);

typedef union Eq_1615 {
	word32 u0;
	 HANDLE u1;
} Eq_1615;

typedef union Eq_1616 {
	word32 u0;
	 LPSECURITY_ATTRIBUTES u1;
} Eq_1616;

typedef union Eq_1617 {
	word32 u0;
	 DWORD u1;
} Eq_1617;

typedef union Eq_1618 {
	word32 u0;
	 DWORD u1;
} Eq_1618;

typedef union Eq_1620 {
	word32 u0;
	 LPCSTR u1;
} Eq_1620;

typedef  Eq_1641[]struct Eq_1641 {
	word32 dw0000;	// 0
	word32 dw0004;	// 4
	word16 a0008[];	// 8
} Eq_1641;

typedef word32 (Eq_1727)(Eq_5, Eq_1730);

typedef union Eq_1730 {
	word32 u0;
	 LPCSTR u1;
} Eq_1730;

typedef union Eq_1803 {
	word32 u0;
	 DWORD u1;
} Eq_1803;

typedef Eq_5 (Eq_1810)(Eq_1612, Eq_1803, Eq_5, Eq_1815, Eq_1816, Eq_5);

typedef union Eq_1815 {
	word32 u0;
	 DWORD u1;
} Eq_1815;

typedef union Eq_1816 {
	word32 u0;
	 SIZE_T u1;
} Eq_1816;

typedef word32 (Eq_1870)(Eq_5);

typedef word32 (Eq_1894)(Eq_5, Eq_1816, Eq_1898);

typedef union Eq_1898 {
	word32 u0;
	 DWORD u1;
} Eq_1898;

typedef void (Eq_1905)(Eq_5);

typedef void (Eq_1911)(Eq_5, word32);

typedef Eq_2090 Eq_2072struct Eq_2072 {
	Eq_2090 * ptr000C;	// C
} Eq_2072;

typedef Eq_2072 Eq_2077struct Eq_2077 {
	word32 dw0008;	// 8
	Eq_2072 * ptr000C;	// C
} Eq_2077;

typedef Eq_2090 Eq_2090struct Eq_2090 {
	Eq_2090 * ptr0000;	// 0
	word32 dw0018;	// 18
	word32 dw001C;	// 1C
} Eq_2090;

typedef word32 (Eq_2179)(Eq_2181, Eq_2182, Eq_2183);

typedef union Eq_2181 {
	word32 u0;
	 HANDLE u1;
} Eq_2181;

typedef union Eq_2182 {
	word32 u0;
	 DWORD u1;
} Eq_2182;

typedef union Eq_2183 {
	word32 u0;
	 LPVOID u1;
} Eq_2183;

typedef Eq_2181 (Eq_2184)();

typedef word32 (Eq_2203)(Eq_2181, Eq_2206, Eq_2207);

typedef union Eq_2206 {
	word32 u0;
	 DWORD u1;
} Eq_2206;

typedef union Eq_2207 {
	word32 u0;
	 SIZE_T u1;
} Eq_2207;

typedef struct Eq_2227 Eq_2227;

typedef DWORDLPSTRLPSTRLPSTRDWORDDWORDDWORDDWORDDWORDDWORDDWORDDWORDWORDWORDLPBYTEHANDLEHANDLEHANDLEstruct _STARTUPINFOA {
	DWORD;	// 0
	LPSTR;	// 4
	LPSTR;	// 8
	LPSTR;	// C
	DWORD;	// 10
	DWORD;	// 14
	DWORD;	// 18
	DWORD;	// 1C
	DWORD;	// 20
	DWORD;	// 24
	DWORD;	// 28
	DWORD;	// 2C
	WORD;	// 30
	WORD;	// 32
	LPBYTE;	// 34
	HANDLE;	// 38
	HANDLE;	// 3C
	HANDLE;	// 40
} Eq_2231;

typedef DWORDLPVOIDBOOLstruct _SECURITY_ATTRIBUTES {
	DWORD;	// 0
	LPVOID;	// 4
	BOOL;	// 8
} Eq_2232;

typedef LONGLONGLONGLONGstruct tagRECT {
	LONG;	// 0
	LONG;	// 4
	LONG;	// 8
	LONG;	// C
} Eq_2240;

typedef DWORDDWORDstruct struct_61 {
	DWORD;	// 0
	DWORD;	// 4
} Eq_2241;

typedef union Eq_2242 {
	 <anonymous> u0;
	 PVOID u1;
} Eq_2242;

typedef ULONG_PTRULONG_PTREq_2242 Eq_2243HANDLEstruct _OVERLAPPED {
	ULONG_PTR;	// 0
	ULONG_PTR;	// 4
	Eq_2242 t0008;	// 8
	HANDLE;	// 10
} Eq_2243;

typedef struct Eq_2244 {
	word32 dw003C;	// 3C
} Eq_2244;

typedef DWORDLPVOIDBOOLstruct _SECURITY_ATTRIBUTES {
	DWORD;	// 0
	LPVOID;	// 4
	BOOL;	// 8
} Eq_2245;

