// subject.h
// Generated on TIMESTAMP by decompiling from_pouet.net/with_source_317/ia32_com/subject.exe
// using Decompiler version VERSION

/*
// Equivalence classes ////////////
Eq_1: (struct "Globals" (FFFA0000 (ptr Eq_16) ptrFFFA0000))
	globals_t (in globals : (ptr (struct "Globals")))
Eq_2: (fn void (byte))
	T_2 (in bios_video_set_mode : ptr32)
	T_3 (in signature of bios_video_set_mode : void)
Eq_16: (segment "Eq_16" (0 byte b0000))
	T_16 (in 0xA000 : selector)
	T_84 (in es : (ptr Eq_16))
	T_110 (in es : (ptr Eq_16))
Eq_27: (segment "Eq_27" (1A3 Eq_81 t01A3) (1A5 Eq_81 t01A5) (1A7 word16 w01A7) (1A9 Eq_82 t01A9) (1AB Eq_81 t01AB) (1AD word16 w01AD) (1AF word16 w01AF) (1B1 Eq_82 t01B1) (1B3 Eq_81 t01B3) (1B5 word16 w01B5) (1B7 word16 w01B7) (1B9 word16 w01B9) (1BB uint16 w01BB) (36D1 uint16 w36D1))
	T_27 (in ds : (ptr Eq_27))
	T_58 (in ds : (ptr Eq_27))
	T_85 (in ds : (ptr Eq_27))
	T_111 (in ds : (ptr Eq_27))
	T_189 (in ds : (ptr Eq_27))
Eq_30: (fn void (byte))
	T_30 (in __syscall : ptr32)
Eq_56: (fn void ((ptr Eq_27)))
	T_56 (in fn0C00_0209 : ptr32)
	T_57 (in signature of fn0C00_0209 : void)
Eq_65: (fn byte (word16))
	T_65 (in __inb : ptr32)
Eq_72: (fn byte (word16))
	T_72 (in __inb : ptr32)
Eq_79: (fn byte (Eq_81, Eq_82, byte, (ptr Eq_16), (ptr Eq_27)))
	T_79 (in fn0C00_01BD : ptr32)
	T_80 (in signature of fn0C00_01BD : void)
	T_102 (in fn0C00_01BD : ptr32)
	T_130 (in fn0C00_01BD : ptr32)
	T_144 (in fn0C00_01BD : ptr32)
	T_174 (in fn0C00_01BD : ptr32)

  Class: Eq_305
  DataType: (memptr (ptr Eq_27) Eq_81)
  OrigDataType: (memptr T_58 (struct (0 T_306 t0000)))
T_306: (in Mem53[ds:0x01A5:word16] : word16)
  Class: Eq_81
  DataType: Eq_81
  OrigDataType: word16
T_307: (in 0x013D : word16)
  Class: Eq_82
  DataType: int16
  OrigDataType: word16
T_308: (in cx_52 != 0x013D : bool)
  Class: Eq_308
  DataType: bool
  OrigDataType: bool
T_309: (in ax_45 < bx_16 : bool)
  Class: Eq_309
  DataType: bool
  OrigDataType: bool
T_310: (in 0x000A : word16)
  Class: Eq_310
  DataType: word16
  OrigDataType: word16
T_311: (in bx_16 + 0x000A : word16)
  Class: Eq_81
  DataType: Eq_81
  OrigDataType: int16
T_312: (in ax_45 >= bx_16.u0 : bool)
  Class: Eq_312
  DataType: bool
  OrigDataType: bool
T_313: (in 0x0001 : word16)
  Class: Eq_295
  DataType: word16
  OrigDataType: word16
T_314: (in 0x01AD : word16)
  Class: Eq_314
  DataType: (memptr (ptr Eq_27) word16)
  OrigDataType: (memptr T_58 (struct (0 T_315 t0000)))
T_315: (in Mem79[ds:0x01AD:word16] : word16)
  Class: Eq_295
  DataType: word16
  OrigDataType: word16
T_316: (in 0x0000 : word16)
  Class: Eq_82
  DataType: int16
  OrigDataType: word16
T_317: (in cx_52 != 0x0000 : bool)
  Class: Eq_317
  DataType: bool
  OrigDataType: bool
T_318: (in ax_45 < bx_57 : bool)
  Class: Eq_318
  DataType: bool
  OrigDataType: bool
T_319: (in 0x000A : word16)
  Class: Eq_319
  DataType: word16
  OrigDataType: word16
T_320: (in bx_57 + 0x000A : word16)
  Class: Eq_81
  DataType: Eq_81
  OrigDataType: int16
T_321: (in ax_45 >= bx_57.u0 : bool)
  Class: Eq_321
  DataType: bool
  OrigDataType: bool
T_322: (in 0xFFFF : word16)
  Class: Eq_295
  DataType: word16
  OrigDataType: word16
T_323: (in 0x01AD : word16)
  Class: Eq_323
  DataType: (memptr (ptr Eq_27) word16)
  OrigDataType: (memptr T_58 (struct (0 T_324 t0000)))
T_324: (in Mem73[ds:0x01AD:word16] : word16)
  Class: Eq_295
  DataType: word16
  OrigDataType: word16
T_325: (in 0x013F : word16)
  Class: Eq_82
  DataType: int16
  OrigDataType: word16
T_326: (in cx_52 != 0x013F : bool)
  Class: Eq_326
  DataType: bool
  OrigDataType: bool
T_327: (in fn0C00_01E2 : ptr32)
  Class: Eq_327
  DataType: (ptr Eq_327)
  OrigDataType: (ptr (fn T_330 (T_271, T_329, T_58)))
T_328: (in signature of fn0C00_01E2 : void)
  Class: Eq_327
  DataType: (ptr Eq_327)
  OrigDataType: 
T_329: (in 0x01B9 : word16)
  Class: Eq_190
  DataType: (memptr (ptr Eq_27) int16)
  OrigDataType: word16
T_330: (in fn0C00_01E2(ax_45, &Eq_27::w01B9, ds) : void)
  Class: Eq_330
  DataType: void
  OrigDataType: void
T_331: (in fn0C00_01E2 : ptr32)
  Class: Eq_327
  DataType: (ptr Eq_327)
  OrigDataType: (ptr (fn T_333 (T_271, T_332, T_58)))
T_332: (in 0x01B7 : word16)
  Class: Eq_190
  DataType: (memptr (ptr Eq_27) int16)
  OrigDataType: word16
T_333: (in fn0C00_01E2(ax_45, &Eq_27::w01B7, ds) : void)
  Class: Eq_330
  DataType: void
  OrigDataType: void
*/
typedef Eq_16 Eq_1struct Globals {
	Eq_16 * ptrFFFA0000;	// FFFA0000
} Eq_1;

typedef void (Eq_2)(byte);

typedef struct Eq_16 {
	byte b0000;	// 0
} Eq_16;

typedef Eq_81 Eq_27Eq_81 Eq_27Eq_82 Eq_27Eq_81 Eq_27Eq_82 Eq_27Eq_81 Eq_27struct Eq_27 {
	Eq_81 t01A3;	// 1A3
	Eq_81 t01A5;	// 1A5
	word16 w01A7;	// 1A7
	Eq_82 t01A9;	// 1A9
	Eq_81 t01AB;	// 1AB
	word16 w01AD;	// 1AD
	word16 w01AF;	// 1AF
	Eq_82 t01B1;	// 1B1
	Eq_81 t01B3;	// 1B3
	word16 w01B5;	// 1B5
	word16 w01B7;	// 1B7
	word16 w01B9;	// 1B9
	uint16 w01BB;	// 1BB
	uint16 w36D1;	// 36D1
} Eq_27;

typedef void (Eq_30)(byte);

typedef void (Eq_56)(Eq_27 *);

typedef byte (Eq_65)(word16);

typedef byte (Eq_72)(word16);

typedef byte (Eq_79)(Eq_81, Eq_82, byte, Eq_16 *, Eq_27 *);

typedef union Eq_81 {
	int16 u0;
	uint16 u1;
} Eq_81;

typedef union Eq_82 {
	int16 u0;
	byte Eq_16::* u1;
} Eq_82;

typedef void (Eq_105)(Eq_81, Eq_82, byte, Eq_16 *, Eq_27 *);

typedef byte (Eq_153)(byte *);

typedef void (Eq_160)();

typedef void (Eq_327)(Eq_81, int16 Eq_27::*, Eq_27 *);

