// subject.h
// Generated on TIMESTAMP by decompiling malware_via_email/malware_0742/ia32_pe/subject.exe
// using Decompiler version VERSION

/*
// Equivalence classes ////////////
Eq_1: (struct "Globals" (402001 Eq_27 t402001) (402005 Eq_27 t402005) (4063F4 Eq_285 t4063F4) (4063F8 word32 dw4063F8) (4063FC up32 dw4063FC) (406400 word32 dw406400) (406404 word32 dw406404) (406408 word32 dw406408) (40640C Eq_27 t40640C) (406410 (ptr Eq_186) ptr406410) (406414 (ptr code) ptr406414))
	globals_t (in globals : (ptr (struct "Globals")))
Eq_25: (fn (ptr code) (Eq_27, Eq_28))
	T_25 (in GetProcAddress : ptr32)
	T_26 (in signature of GetProcAddress : void)
	T_83 (in GetProcAddress : ptr32)
	T_119 (in GetProcAddress : ptr32)
	T_242 (in GetProcAddress : ptr32)
	T_260 (in GetProcAddress : ptr32)
	T_264 (in GetProcAddress : ptr32)
	T_268 (in GetProcAddress : ptr32)
	T_272 (in GetProcAddress : ptr32)
	T_276 (in GetProcAddress : ptr32)
	T_636 (in GetProcAddress : ptr32)
Eq_27: (union "Eq_27" (up32 u0) (HMODULE u1) (LPCSTR u2))
	T_27 (in hModule : HMODULE)
	T_31 (in lpLibFileName : LPCSTR)
	T_32 (in 0x00406298 : word32)
	T_33 (in LoadLibraryA(0x00406298) : word32)
	T_72 (in 0x004062C4 : word32)
	T_75 (in Mem126[fp - 0x000000B0:word32] : word32)
	T_77 (in 0x00000080 : word32)
	T_78 (in LoadLibraryA(0x00000080) : word32)
	T_81 (in Mem130[fp - 0x000000B0:word32] : word32)
	T_91 (in 0x004062D4 : word32)
	T_94 (in Mem138[fp - 0x000000B0:word32] : word32)
	T_108 (in 0x004062E8 : word32)

  OrigDataType: word32
T_842: (in 0x00000001 : word32)
  Class: Eq_842
  DataType: word32
  OrigDataType: word32
T_843: (in dwLoc10_20 + 0x00000001 : word32)
  Class: Eq_827
  DataType: word32
  OrigDataType: word32
T_844: (in 0x00000001 : word32)
  Class: Eq_844
  DataType: word32
  OrigDataType: word32
T_845: (in dwArg08 + 0x00000001 : word32)
  Class: Eq_830
  DataType: (ptr Eq_830)
  OrigDataType: word32
T_846: (in 0x00000080 : word32)
  Class: Eq_846
  DataType: word32
  OrigDataType: word32
T_847: (in edx_23 & 0x00000080 : word32)
  Class: Eq_847
  DataType: word32
  OrigDataType: word32
T_848: (in 0x00000000 : word32)
  Class: Eq_847
  DataType: word32
  OrigDataType: word32
T_849: (in (edx_23 & 0x00000080) != 0x00000000 : bool)
  Class: Eq_849
  DataType: bool
  OrigDataType: bool
T_850: (in 0x004063AC : word32)
  Class: Eq_850
  DataType: word32
  OrigDataType: word32
T_851: (in 0x00000088 : word32)
  Class: Eq_851
  DataType: word32
  OrigDataType: word32
T_852: (in fp - 0x00000088 : word32)
  Class: Eq_852
  DataType: word32
  OrigDataType: word32
T_853: (in Mem44[fp - 0x00000088:word32] : word32)
  Class: Eq_850
  DataType: word32
  OrigDataType: word32
T_854: (in lstrcpyA : ptr32)
  Class: Eq_246
  DataType: (ptr Eq_246)
  OrigDataType: (ptr (fn T_858 (T_856, T_857)))
T_855: (in 0x00000084 : word32)
  Class: Eq_855
  DataType: word32
  OrigDataType: word32
T_856: (in fp - 0x00000084 : word32)
  Class: Eq_248
  DataType: Eq_248
  OrigDataType: word32
T_857: (in 0x00406394 : word32)
  Class: Eq_249
  DataType: word32
  OrigDataType: word32
T_858: (in lstrcpyA(fp - 0x00000084, 0x00406394) : word32)
  Class: Eq_254
  DataType: word32
  OrigDataType: word32
T_859: (in dwArg04 : word32)
  Class: Eq_859
  DataType: (ptr word32)
  OrigDataType: (ptr (struct (0 T_862 t0000)))
T_860: (in 0x00000000 : word32)
  Class: Eq_860
  DataType: word32
  OrigDataType: word32
T_861: (in dwArg04 + 0x00000000 : word32)
  Class: Eq_861
  DataType: word32
  OrigDataType: word32
T_862: (in Mem52[dwArg04 + 0x00000000:word32] : word32)
  Class: Eq_825
  DataType: word32
  OrigDataType: word32
T_863:
  Class: Eq_863
  DataType: word16
  OrigDataType: (struct 0002 (0 T_689 t0000))
T_864:
  Class: Eq_863
  DataType: word16
  OrigDataType: (struct 0002 (0 T_703 t0000))
T_865:
  Class: Eq_863
  DataType: word16
  OrigDataType: (struct 0002 (0 T_718 t0000))
T_866:
  Class: Eq_866
  DataType: int32
  OrigDataType: 
T_867:
  Class: Eq_867
  DataType: Eq_867
  OrigDataType: 
T_868:
  Class: Eq_868
  DataType: Eq_868
  OrigDataType: 
*/
typedef Eq_27 Eq_1Eq_27 Eq_1Eq_285 Eq_1Eq_27 Eq_1Eq_186 Eq_1code Eq_1struct Globals {
	Eq_27 t402001;	// 402001
	Eq_27 t402005;	// 402005
	Eq_285 t4063F4;	// 4063F4
	word32 dw4063F8;	// 4063F8
	up32 dw4063FC;	// 4063FC
	word32 dw406400;	// 406400
	word32 dw406404;	// 406404
	word32 dw406408;	// 406408
	Eq_27 t40640C;	// 40640C
	Eq_186 * ptr406410;	// 406410
	code * ptr406414;	// 406414
} Eq_1;

typedef code * (Eq_25)(Eq_27, Eq_28);

typedef union Eq_27 {
	up32 u0;
	 HMODULE u1;
	 LPCSTR u2;
} Eq_27;

typedef union Eq_28 {
	word32 u0;
	 LPCSTR u1;
} Eq_28;

typedef Eq_27 (Eq_29)(Eq_27);

typedef word32 (Eq_36)(Eq_38, Eq_39);

typedef union Eq_38 {
	word32 u0;
	 LPSTR u1;
} Eq_38;

typedef union Eq_39 {
	word32 u0;
	 LPCSTR u1;
} Eq_39;

typedef Eq_27 Eq_40Eq_27 Eq_40Eq_27 Eq_40struct Eq_40 {
	Eq_27 tFFFFFF3C;	// FFFFFF3C
	word32 dwFFFFFF40;	// FFFFFF40
	Eq_27 tFFFFFF44;	// FFFFFF44
	word32 dwFFFFFF48;	// FFFFFF48
	word32 dwFFFFFF4C;	// FFFFFF4C
	Eq_27 tFFFFFF50;	// FFFFFF50
	word32 dwFFFFFF54;	// FFFFFF54
} Eq_40;

typedef word32 (Eq_46)(Eq_48, Eq_49, Eq_50, Eq_51, Eq_52, Eq_53, Eq_54);

typedef union Eq_48 {
	word32 u0;
	 LPCSTR u1;
} Eq_48;

typedef union Eq_49 {
	word32 u0;
	 DWORD u1;
} Eq_49;

typedef union Eq_50 {
	word32 u0;
	 DWORD u1;
} Eq_50;

typedef union Eq_51 {
	word32 u0;
	 LPSECURITY_ATTRIBUTES u1;
} Eq_51;

typedef union Eq_52 {
	word32 u0;
	 DWORD u1;
} Eq_52;

typedef union Eq_53 {
	word32 u0;
	 DWORD u1;
} Eq_53;

typedef union Eq_54 {
	word32 u0;
	 HANDLE u1;
} Eq_54;

typedef Eq_27 (Eq_138)(Eq_140);

typedef union Eq_140 {
	word32 u0;
	 LPCSTR u1;
} Eq_140;

typedef Eq_27 (Eq_155)(word32);

typedef void (Eq_165)(ptr32, Eq_27, word32);

typedef Eq_186 Eq_184struct Eq_184 {
	Eq_186 * ptr0018;	// 18
} Eq_184;

typedef Eq_737 Eq_186struct Eq_186 {
	Eq_737 * ptr0030;	// 30
} Eq_186;

typedef void (Eq_199)(word32, word32);

typedef void (Eq_211)(word32, word32);

typedef struct Eq_228 {
	word32 dw0008;	// 8
} Eq_228;

typedef struct Eq_235 {
	word32 dw0008;	// 8
} Eq_235;

typedef word32 (Eq_246)(Eq_248, Eq_249);

typedef union Eq_248 {
	word32 u0;
	 LPSTR u1;
} Eq_248;

typedef union Eq_249 {
	word32 u0;
	 LPCSTR u1;
} Eq_249;

typedef struct Eq_250 {
	word32 dwFFFFFFE4;	// FFFFFFE4
} Eq_250;

typedef Eq_353 Eq_279struct Eq_279 {
	word16 w0006;	// 6
	word16 w0014;	// 14
	Eq_353 t003C;	// 3C
} Eq_279;

typedef struct Eq_280 {
	word32 dw003C;	// 3C
} Eq_280;

typedef union Eq_285 {
	Eq_868* u0;
	 HANDLE u1;
} Eq_285;

typedef void (Eq_293)(Eq_285, Eq_280 *, Eq_285);

typedef Eq_328 Eq_328struct Eq_328 {	// size: 20 14
	word32 dw0000;	// 0
	word32 dw000C;	// C
	word32 dw0010;	// 10
	Eq_328 t0014;	// 14
} Eq_328;

typedef union Eq_353 {
	int32 u0;
	uint32 u1;
} Eq_353;

typedef union Eq_374 {
	int32 u0;
	uint32 u1;
} Eq_374;

typedef Eq_389 Eq_389struct Eq_389 {	// size: 4 4
	word32 dw0000;	// 0
	Eq_389 t0004;	// 4
} Eq_389;

typedef Eq_390 Eq_390struct Eq_390 {	// size: 4 4
	word32 dw0000;	// 0
	Eq_390 t0004;	// 4
} Eq_390;

typedef Eq_285 Eq_438Eq_285 Eq_438Eq_285 Eq_438struct Eq_438 {
	Eq_285 tFFFFFFF8;	// FFFFFFF8
	Eq_285 tFFFFFFFC;	// FFFFFFFC
	Eq_285 t0000;	// 0
} Eq_438;

typedef word32 (Eq_444)(Eq_285);

typedef void (Eq_474)(Eq_285);

typedef Eq_285 Eq_500Eq_285 Eq_500struct Eq_500 {
	word32 dwFFFFFFDC;	// FFFFFFDC
	Eq_285 tFFFFFFE0;	// FFFFFFE0
	word32 dwFFFFFFE4;	// FFFFFFE4
	word32 dwFFFFFFE8;	// FFFFFFE8
	Eq_285 tFFFFFFEC;	// FFFFFFEC
	word32 dwFFFFFFF0;	// FFFFFFF0
	word32 dwFFFFFFF4;	// FFFFFFF4
	word32 dwFFFFFFF8;	// FFFFFFF8
	word32 dwFFFFFFFC;	// FFFFFFFC
	word32 dw0000;	// 0
} Eq_500;

typedef word32 (Eq_549)(Eq_27, word32);

typedef word32 (Eq_619)(Eq_621, Eq_622, Eq_623, Eq_624);

typedef union Eq_621 {
	word32 u0;
	 LPVOID u1;
} Eq_621;

typedef union Eq_622 {
	word32 u0;
	 SIZE_T u1;
} Eq_622;

typedef union Eq_623 {
	word32 u0;
	 DWORD u1;
} Eq_623;

typedef union Eq_624 {
	word32 u0;
	 DWORD u1;
} Eq_624;

typedef  Eq_664[]struct Eq_664 {
	word32 dw0000;	// 0
	word32 dw0004;	// 4
	word16 a0008[];	// 8
} Eq_664;

typedef struct Eq_737 {
	word32 dw0008;	// 8
} Eq_737;

typedef word32 (Eq_769)(word32, word32);

typedef struct Eq_820 {
	word32 dwFFFFFF78;	// FFFFFF78
} Eq_820;

typedef Eq_830 Eq_830struct Eq_830 {	// size: 1 1
	byte b0000;	// 0
	Eq_830 t0001;	// 1
} Eq_830;

typedef DWORDLPVOIDBOOLstruct _SECURITY_ATTRIBUTES {
	DWORD;	// 0
	LPVOID;	// 4
	BOOL;	// 8
} Eq_867;

typedef code Eq_868Eq_285 Eq_868struct Eq_868 {	// size: 40 28
	word32 dw000C;	// C
	word32 dw0010;	// 10
	word32 dw0014;	// 14
	code * ptr0028;	// 28
	word32 dw0034;	// 34
	word32 dw003C;	// 3C
	Eq_285 t0050;	// 50
	word32 dw0080;	// 80
	word32 dw00A0;	// A0
	word32 dw00A4;	// A4
} Eq_868;

