// subject.h
// Generated on TIMESTAMP by decompiling from_pouet.net/with_source_247/ia32_com/subject.exe
// using Decompiler version VERSION

/*
// Equivalence classes ////////////
Eq_1: (struct "Globals" (FFFA0000 (ptr Eq_264) ptrFFFA0000) (FFFF0000 (ptr Eq_83) ptrFFFF0000) (C000 (ptr Eq_154) ptrC000) (50000 (ptr Eq_90) ptr50000) (60000 (ptr Eq_142) ptr60000))
	globals_t (in globals : (ptr (struct "Globals")))
Eq_2: (fn void (byte))
	T_2 (in bios_video_set_mode : ptr32)
	T_3 (in signature of bios_video_set_mode : void)
Eq_7: (fn byte (word16))
	T_7 (in __inb : ptr32)
Eq_14: (segment "Eq_14" (1FC (memptr (ptr Eq_14) byte) ptr01FC) (202 word32 dw0202) (206 byte b0206))
	T_14 (in ds : (ptr Eq_14))
	T_72 (in 0x5000 : word16)
	T_243 (in 0xA000 : word16)
	T_246 (in Mem197[ss:fp - 0x0002:word16] : word16)
Eq_55: (struct "Eq_55" 0001 (0 word16 w0000))
	T_55 (in si_237 : (memptr (ptr Eq_83) Eq_55))
	T_63 (in ((word16) (ds->*ds->ptr01FC) << 0x0003) + 0xFA6E : word16)
	T_104 (in si_237 + 0x0001 : word16)
Eq_65: (segment "Eq_65")
	T_65 (in ss : selector)
Eq_66: (union "Eq_66" ((memptr (ptr Eq_65) Eq_281) u0) (Eq_283 u1))
	T_66 (in fp : ptr16)
Eq_70: (struct "Eq_70" 0002 (0 (memptr (ptr Eq_142) ui8) ptr0000) (150 (memptr (ptr Eq_142) ui8) ptr0150))
	T_70 (in di_233 : (memptr (ptr Eq_90) Eq_70))
	T_71 (in 0x0140 : word16)
	T_98 (in di_233 + 0x0002 : word16)
	T_106 (in di_233 + 0x0290 : word16)
Eq_82: (fn bool (word16, word16))
	T_82 (in __bt : ptr32)
Eq_83: (segment "Eq_83")

  OrigDataType: (ptr (segment))
T_253: (in 0x0002 : word16)
  Class: Eq_253
  DataType: word16
  OrigDataType: word16
T_254: (in fp - 0x0002 : word16)
  Class: Eq_254
  DataType: word16
  OrigDataType: word16
T_255: (in Mem221[ss:fp - 0x0002:word16] : word16)
  Class: Eq_252
  DataType: (ptr Eq_252)
  OrigDataType: word16
T_256: (in __inb : ptr32)
  Class: Eq_256
  DataType: (ptr Eq_256)
  OrigDataType: (ptr (fn T_258 (T_257)))
T_257: (in 0x60 : byte)
  Class: Eq_257
  DataType: byte
  OrigDataType: byte
T_258: (in __inb(0x60) : byte)
  Class: Eq_258
  DataType: byte
  OrigDataType: byte
T_259: (in 0x01 : byte)
  Class: Eq_258
  DataType: byte
  OrigDataType: byte
T_260: (in __inb(0x60) != 0x01 : bool)
  Class: Eq_260
  DataType: bool
  OrigDataType: bool
T_261: (in 0x0000 : word16)
  Class: Eq_261
  DataType: word16
  OrigDataType: word16
T_262: (in si_200 + 0x0000 : word16)
  Class: Eq_262
  DataType: word16
  OrigDataType: word16
T_263: (in Mem197[0x6000:si_200 + 0x0000:word16] : word16)
  Class: Eq_263
  DataType: word16
  OrigDataType: word16
T_264: (in 0xA000 : selector)
  Class: Eq_264
  DataType: (ptr Eq_264)
  OrigDataType: (ptr (segment (0 (arr T_280) a0000)))
T_265: (in 0x0000 : word16)
  Class: Eq_265
  DataType: word16
  OrigDataType: word16
T_266: (in di_201 + 0x0000 : word16)
  Class: Eq_266
  DataType: word16
  OrigDataType: word16
T_267: (in Mem213[0xA000:di_201 + 0x0000:word16] : word16)
  Class: Eq_263
  DataType: word16
  OrigDataType: word16
T_268: (in 0x0002 : word16)
  Class: Eq_268
  DataType: word16
  OrigDataType: word16
T_269: (in si_200 + 0x0002 : word16)
  Class: Eq_247
  DataType: (memptr (ptr Eq_142) word16)
  OrigDataType: word16
T_270: (in 0x0002 : word16)
  Class: Eq_270
  DataType: word16
  OrigDataType: word16
T_271: (in di_201 + 0x0002 : word16)
  Class: Eq_249
  DataType: (memptr (ptr Eq_264) word16)
  OrigDataType: word16
T_272: (in 0x0001 : word16)
  Class: Eq_272
  DataType: word16
  OrigDataType: word16
T_273: (in cx - 0x0001 : word16)
  Class: Eq_87
  DataType: word16
  OrigDataType: word16
T_274: (in 0x0000 : word16)
  Class: Eq_87
  DataType: word16
  OrigDataType: word16
T_275: (in cx == 0x0000 : bool)
  Class: Eq_275
  DataType: bool
  OrigDataType: bool
T_276:
  Class: Eq_276
  DataType: byte
  OrigDataType: (struct 0001 (0 T_123 t0000))
T_277:
  Class: Eq_277
  DataType: byte
  OrigDataType: (struct 0001 (0 T_126 t0000))
T_278:
  Class: Eq_278
  DataType: Eq_278
  OrigDataType: (struct 0001 (0 T_145 t0000))
T_279:
  Class: Eq_278
  DataType: Eq_278
  OrigDataType: (struct 0002 (0 word16 w0000))
T_280:
  Class: Eq_280
  DataType: word16
  OrigDataType: (struct 0002 (0 T_267 t0000))
T_281:
  Class: Eq_281
  DataType: Eq_281
  OrigDataType: 
T_282:
  Class: Eq_282
  DataType: Eq_282
  OrigDataType: 
T_283:
  Class: Eq_283
  DataType: Eq_283
  OrigDataType: 
*/
typedef Eq_264 Eq_1Eq_83 Eq_1Eq_154 Eq_1Eq_90 Eq_1Eq_142 Eq_1struct Globals {
	Eq_264 * ptrFFFA0000;	// FFFA0000
	Eq_83 * ptrFFFF0000;	// FFFF0000
	Eq_154 * ptrC000;	// C000
	Eq_90 * ptr50000;	// 50000
	Eq_142 * ptr60000;	// 60000
} Eq_1;

typedef void (Eq_2)(byte);

typedef byte (Eq_7)(word16);

typedef struct Eq_14 {
	byte Eq_14::*ptr01FC;	// 1FC
	word32 dw0202;	// 202
	byte b0206;	// 206
} Eq_14;

typedef struct Eq_55 {	// size: 1 1
	word16 w0000;	// 0
} Eq_55;

typedef struct Eq_65 {
} Eq_65;

typedef union Eq_66 {
	Eq_281 Eq_65::* u0;
	Eq_283 u1;
} Eq_66;

typedef struct Eq_70 {	// size: 2 2
	ui8 Eq_142::*ptr0000;	// 0
	ui8 Eq_142::*ptr0150;	// 150
} Eq_70;

typedef bool (Eq_82)(word16, word16);

typedef struct Eq_83 {
} Eq_83;

typedef  Eq_90[][]Eq_70struct Eq_90 {
	byte aFFFFFFFF[];	// FFFFFFFF
	byte a0000[];	// 0
	Eq_70 t0140;	// 140
	byte bFFFF;	// FFFF
} Eq_90;

typedef Eq_278 Eq_142[]struct Eq_142 {
	Eq_278 a0000[];	// 0
} Eq_142;

typedef Eq_159 (Eq_152)(real16);

typedef union Eq_153 {
	real16 u0;
	real64 u1;
} Eq_153;

typedef struct Eq_154 {
	word16 w01FE;	// 1FE
	int16 w0200;	// 200
} Eq_154;

typedef union Eq_157 {
	real16 u0;
	real64 u1;
} Eq_157;

typedef union Eq_159 {
	real16 u0;
	real64 u1;
} Eq_159;

typedef union Eq_162 {
	real16 u0;
	real64 u1;
} Eq_162;

typedef union Eq_176 {
	byte u0;
	word16 u1;
} Eq_176;

typedef word16 (Eq_229)(word16, byte);

typedef struct Eq_252 {
} Eq_252;

typedef byte (Eq_256)(byte);

typedef  Eq_264[]struct Eq_264 {
	word16 a0000[];	// 0
} Eq_264;

typedef union Eq_278 {
	byte u0;
	word16 u1;
} Eq_278;

typedef Eq_252 Eq_281struct Eq_281 {
	Eq_252 * ptrFFFFFFFE;	// FFFFFFFE
} Eq_281;

typedef Eq_14 Eq_282struct Eq_282 {
	Eq_14 * ptrFFFFFFFE;	// FFFFFFFE
} Eq_282;

typedef union Eq_283 {
	ptr16 u0;
	Eq_282 Eq_65::* u1;
} Eq_283;

