// subject.h
// Generated on TIMESTAMP by decompiling malware_via_email/malware_1169/ia32_pe/subject.exe
// using Decompiler version VERSION

/*
// Equivalence classes ////////////
Eq_1: (struct "Globals" (FFFFFEBD Eq_182 tFFFFFEBD) (3E8 Eq_178 t03E8) (10FE47 Eq_178 t10FE47) (402001 (ptr Eq_178) ptr402001) (4079C0 (ptr Eq_178) ptr4079C0) (4079C4 word32 dw4079C4) (4079C8 int32 dw4079C8) (4079CC word32 dw4079CC) (4079D0 (ptr Eq_178) ptr4079D0) (4079D4 (ptr Eq_345) ptr4079D4) (4079D8 word32 dw4079D8) (4079DC (ptr Eq_178) ptr4079DC) (4079E0 word32 dw4079E0) (4079E4 (ptr Eq_178) ptr4079E4) (4079E8 (ptr Eq_342) ptr4079E8) (407A00 (ptr code) ptr407A00) (407A04 (ptr code) ptr407A04) (407A08 (ptr code) ptr407A08) (407A0C (ptr code) ptr407A0C) (407A10 (ptr code) ptr407A10) (407A14 (ptr code) ptr407A14) (407A18 (ptr code) ptr407A18) (407A1C (ptr code) ptr407A1C) (407A20 (ptr code) ptr407A20) (407A24 (ptr code) ptr407A24) (407A28 (ptr code) ptr407A28) (407A2C (ptr code) ptr407A2C) (407A30 (ptr code) ptr407A30) (407A34 (ptr code) ptr407A34) (407A38 (ptr code) ptr407A38) (407A3C (ptr code) ptr407A3C))
	globals_t (in globals : (ptr (struct "Globals")))
Eq_39: (fn word32 ())
	T_39 (in GetCommandLineA : ptr32)
	T_40 (in signature of GetCommandLineA : void)
	T_58 (in GetCommandLineA : ptr32)
	T_176 (in dwArg04 : (ptr Eq_39))
	T_177 (in GetCommandLineA : ptr32)
	T_185 (in GetCommandLineA : ptr32)
	T_200 (in GetCommandLineA : ptr32)

T_1305: (in Mem32[dwLoc0C_146 + 0x00000004:word32] : word32)
  Class: Eq_1249
  DataType: word32
  OrigDataType: word32
T_1306: (in 0x00000000 : word32)
  Class: Eq_1249
  DataType: word32
  OrigDataType: word32
T_1307: (in dwLoc0C_146->dw0004 == 0x00000000 : bool)
  Class: Eq_1307
  DataType: bool
  OrigDataType: bool
T_1308: (in edx_7 : (ptr Eq_342))
  Class: Eq_342
  DataType: (ptr Eq_342)
  OrigDataType: (ptr (struct (30 T_1314 t0030)))
T_1309: (in 0x004079E8 : ptr32)
  Class: Eq_1309
  DataType: (ptr (ptr Eq_342))
  OrigDataType: (ptr (struct (0 T_1310 t0000)))
T_1310: (in Mem0[0x004079E8:word32] : word32)
  Class: Eq_342
  DataType: (ptr Eq_342)
  OrigDataType: word32
T_1311: (in dwArg04 : word32)
  Class: Eq_1311
  DataType: word32
  OrigDataType: word32
T_1312: (in 0x00000030 : word32)
  Class: Eq_1312
  DataType: word32
  OrigDataType: word32
T_1313: (in edx_7 + 0x00000030 : word32)
  Class: Eq_1313
  DataType: word32
  OrigDataType: word32
T_1314: (in Mem0[edx_7 + 0x00000030:word32] : word32)
  Class: Eq_1174
  DataType: (ptr Eq_1174)
  OrigDataType: (ptr (struct (8 T_1317 t0008)))
T_1315: (in 0x00000008 : word32)
  Class: Eq_1315
  DataType: word32
  OrigDataType: word32
T_1316: (in Mem0[edx_7 + 0x00000030:word32] + 0x00000008 : word32)
  Class: Eq_1316
  DataType: word32
  OrigDataType: word32
T_1317: (in Mem12[Mem0[edx_7 + 0x00000030:word32] + 0x00000008:word32] : word32)
  Class: Eq_1311
  DataType: word32
  OrigDataType: word32
T_1318:
  Class: Eq_1318
  DataType: word16
  OrigDataType: (struct 0002 (0 T_166 t0000))
T_1319:
  Class: Eq_1319
  DataType: word32
  OrigDataType: (struct 0004 (0 T_170 t0000))
T_1320:
  Class: Eq_1320
  DataType: Eq_1320
  OrigDataType: (struct 0008 (0 T_436 t0000))
T_1321:
  Class: Eq_1321
  DataType: word16
  OrigDataType: (struct 0002 (0 T_906 t0000))
T_1322:
  Class: Eq_1321
  DataType: word16
  OrigDataType: (struct 0002 (0 T_918 t0000))
T_1323:
  Class: Eq_1321
  DataType: word16
  OrigDataType: (struct 0002 (0 T_931 t0000))
T_1324:
  Class: Eq_1324
  DataType: word16
  OrigDataType: (struct 0002 (0 T_1129 t0000))
T_1325:
  Class: Eq_1324
  DataType: word16
  OrigDataType: (struct 0002 (0 T_1141 t0000))
T_1326:
  Class: Eq_1324
  DataType: word16
  OrigDataType: (struct 0002 (0 T_1154 t0000))
T_1327:
  Class: Eq_1327
  DataType: word16
  OrigDataType: (struct 0002 (0 T_1266 t0000))
T_1328:
  Class: Eq_1327
  DataType: word16
  OrigDataType: (struct 0002 (0 T_1280 t0000))
T_1329:
  Class: Eq_1327
  DataType: word16
  OrigDataType: (struct 0002 (0 T_1295 t0000))
T_1330:
  Class: Eq_1330
  DataType: Eq_1330
  OrigDataType: 
T_1331:
  Class: Eq_1331
  DataType: Eq_1331
  OrigDataType: 
T_1332:
  Class: Eq_1332
  DataType: int32
  OrigDataType: 
*/
typedef Eq_182 Eq_1Eq_178 Eq_1Eq_178 Eq_1Eq_178 Eq_1Eq_178 Eq_1Eq_178 Eq_1Eq_345 Eq_1Eq_178 Eq_1Eq_178 Eq_1Eq_342 Eq_1code Eq_1code Eq_1code Eq_1code Eq_1code Eq_1code Eq_1code Eq_1code Eq_1code Eq_1code Eq_1code Eq_1code Eq_1code Eq_1code Eq_1code Eq_1code Eq_1struct Globals {
	Eq_182 tFFFFFEBD;	// FFFFFEBD
	Eq_178 t03E8;	// 3E8
	Eq_178 t10FE47;	// 10FE47
	Eq_178 * ptr402001;	// 402001
	Eq_178 * ptr4079C0;	// 4079C0
	word32 dw4079C4;	// 4079C4
	int32 dw4079C8;	// 4079C8
	word32 dw4079CC;	// 4079CC
	Eq_178 * ptr4079D0;	// 4079D0
	Eq_345 * ptr4079D4;	// 4079D4
	word32 dw4079D8;	// 4079D8
	Eq_178 * ptr4079DC;	// 4079DC
	word32 dw4079E0;	// 4079E0
	Eq_178 * ptr4079E4;	// 4079E4
	Eq_342 * ptr4079E8;	// 4079E8
	code * ptr407A00;	// 407A00
	code * ptr407A04;	// 407A04
	code * ptr407A08;	// 407A08
	code * ptr407A0C;	// 407A0C
	code * ptr407A10;	// 407A10
	code * ptr407A14;	// 407A14
	code * ptr407A18;	// 407A18
	code * ptr407A1C;	// 407A1C
	code * ptr407A20;	// 407A20
	code * ptr407A24;	// 407A24
	code * ptr407A28;	// 407A28
	code * ptr407A2C;	// 407A2C
	code * ptr407A30;	// 407A30
	code * ptr407A34;	// 407A34
	code * ptr407A38;	// 407A38
	code * ptr407A3C;	// 407A3C
} Eq_1;

typedef word32 (Eq_39)();

typedef Eq_88 Eq_80struct Eq_80 {	// size: 4096 1000
	Eq_88 t0000;	// 0
	word32 dw003C;	// 3C
} Eq_80;

typedef union Eq_88 {
	word16 u0;
	word32 u1;
} Eq_88;

typedef struct Eq_105 {
	uint32 dw0018;	// 18
	word32 dw001C;	// 1C
	word32 dw0020;	// 20
	word32 dw0024;	// 24
} Eq_105;

typedef struct Eq_106 {
	word32 dw003C;	// 3C
} Eq_106;

typedef struct Eq_110 {
	word32 dw0078;	// 78
} Eq_110;

typedef Eq_120 Eq_120struct Eq_120 {	// size: 4 4
	word32 dw0000;	// 0
	Eq_120 t0004;	// 4
} Eq_120;

typedef struct Eq_144 {
	word32 dwFFFFFFD0;	// FFFFFFD0
	word32 dwFFFFFFD4;	// FFFFFFD4
} Eq_144;

typedef word32 (Eq_152)(word32, word32, word32);

typedef Eq_178 * (Eq_174)( *);

typedef union Eq_178 {
	Eq_1330 u0;
	Eq_1331 u1;
} Eq_178;

typedef struct Eq_182 {
	word32 dwFFFFFE58;	// FFFFFE58
} Eq_182;

typedef code * (Eq_190)(Eq_178 *);

typedef union Eq_198 {
	int32 u0;
	up32 u1;
} Eq_198;

typedef code * (Eq_219)(Eq_178 *, Eq_222 *);

typedef struct Eq_222 {
	word32 dw003C;	// 3C
} Eq_222;

typedef Eq_178 * (Eq_267)(Eq_178 *);

typedef void (Eq_273)(Eq_178 *, byte, Eq_178 *);

typedef void (Eq_302)(Eq_178 *, Eq_222 *, Eq_178 *);

typedef Eq_178 * (Eq_318)(Eq_320, Eq_321);

typedef union Eq_320 {
	word32 u0;
	 HINSTANCE u1;
} Eq_320;

typedef union Eq_321 {
	word32 u0;
	 LPCSTR u1;
} Eq_321;

typedef Eq_342 Eq_340struct Eq_340 {
	Eq_342 * ptr0018;	// 18
} Eq_340;

typedef Eq_1174 Eq_342struct Eq_342 {
	Eq_1174 * ptr0030;	// 30
} Eq_342;

typedef Eq_178 Eq_345struct Eq_345 {
	Eq_178 * ptr0008;	// 8
} Eq_345;

typedef Eq_178 Eq_374struct Eq_374 {
	word32 dwFFFFFFFC;	// FFFFFFFC
	Eq_178 * ptr0000;	// 0
} Eq_374;

typedef void (Eq_386)(word32, Eq_178 *);

typedef void (Eq_398)(word32, word32);

typedef Eq_1320 Eq_429[]struct Eq_429 {
	Eq_1320 a0078[];	// 78
} Eq_429;

typedef struct Eq_437 {
	word32 dwFFFFFFEC;	// FFFFFFEC
} Eq_437;

typedef Eq_451 Eq_451struct Eq_451 {	// size: 40 28
	word32 dw000C;	// C
	word32 dw0010;	// 10
	word32 dw0014;	// 14
	Eq_451 t0028;	// 28
} Eq_451;

typedef union Eq_485 {
	int32 u0;
	uint32 u1;
} Eq_485;

typedef word32 (Eq_501)(Eq_178 *);

typedef union Eq_555 {
	int32 u0;
	uint32 u1;
} Eq_555;

typedef code Eq_576Eq_576 Eq_576struct Eq_576 {	// size: 4 4
	code * ptr0000;	// 0
	Eq_576 t0004;	// 4
} Eq_576;

typedef Eq_178 Eq_621Eq_178 Eq_621struct Eq_621 {
	Eq_178 * ptrFFFFFFEC;	// FFFFFFEC
	word32 dwFFFFFFF0;	// FFFFFFF0
	word32 dwFFFFFFF4;	// FFFFFFF4
	word32 dwFFFFFFF8;	// FFFFFFF8
	word32 dwFFFFFFFC;	// FFFFFFFC
	Eq_178 * ptr0000;	// 0
} Eq_621;

typedef Eq_178 Eq_688Eq_178 Eq_688struct Eq_688 {
	Eq_178 * ptrFFFFFFF4;	// FFFFFFF4
	word32 dwFFFFFFF8;	// FFFFFFF8
	word32 dwFFFFFFFC;	// FFFFFFFC
	Eq_178 * ptr0000;	// 0
} Eq_688;

typedef Eq_178 Eq_707struct Eq_707 {
	Eq_178 * ptrFFFFFFFC;	// FFFFFFFC
	word32 dw0000;	// 0
	word32 dw0004;	// 4
} Eq_707;

typedef Eq_178 Eq_730struct Eq_730 {
	Eq_178 * ptrFFFFFFFC;	// FFFFFFFC
	word32 dw0000;	// 0
	word32 dw0004;	// 4
} Eq_730;

typedef Eq_178 Eq_778Eq_178 Eq_778Eq_178 Eq_778Eq_178 Eq_778struct Eq_778 {
	Eq_178 * ptrFFFFFFF4;	// FFFFFFF4
	Eq_178 * ptrFFFFFFF8;	// FFFFFFF8
	Eq_178 * ptrFFFFFFFC;	// FFFFFFFC
	Eq_178 * ptr0000;	// 0
} Eq_778;

typedef void (Eq_809)(Eq_178 *);

typedef void (Eq_830)(Eq_178 *, Eq_222 *, Eq_178 *);

typedef  Eq_851[]struct Eq_851 {
	word32 dw0000;	// 0
	word32 dw0004;	// 4
	word16 a0008[];	// 8
} Eq_851;

typedef Eq_178 Eq_944struct Eq_944 {
	Eq_178 * ptrFFFFFFF4;	// FFFFFFF4
	word32 dwFFFFFFF8;	// FFFFFFF8
	word32 dwFFFFFFFC;	// FFFFFFFC
	word32 dw0000;	// 0
} Eq_944;

typedef Eq_178 Eq_964Eq_178 Eq_964Eq_178 Eq_964Eq_178 Eq_964struct Eq_964 {
	Eq_178 * ptrFFFFFFDC;	// FFFFFFDC
	Eq_178 * ptrFFFFFFE0;	// FFFFFFE0
	word32 dwFFFFFFE4;	// FFFFFFE4
	word32 dwFFFFFFE8;	// FFFFFFE8
	Eq_178 * ptrFFFFFFEC;	// FFFFFFEC
	word32 dwFFFFFFF0;	// FFFFFFF0
	word32 dwFFFFFFF4;	// FFFFFFF4
	word32 dwFFFFFFF8;	// FFFFFFF8
	word32 dwFFFFFFFC;	// FFFFFFFC
	Eq_178 * ptr0000;	// 0
} Eq_964;

typedef code Eq_1029struct Eq_1029 {
	byte b0000;	// 0
	code * ptr0001;	// 1
	byte b0005;	// 5
} Eq_1029;

typedef Eq_178 Eq_1045Eq_178 Eq_1045Eq_1029 Eq_1045struct Eq_1045 {
	Eq_178 * ptrFFFFFFE8;	// FFFFFFE8
	word32 dwFFFFFFEC;	// FFFFFFEC
	Eq_178 * ptrFFFFFFF0;	// FFFFFFF0
	Eq_1029 * ptrFFFFFFF4;	// FFFFFFF4
	word32 dwFFFFFFF8;	// FFFFFFF8
	word32 dwFFFFFFFC;	// FFFFFFFC
	word32 dw0000;	// 0
} Eq_1045;

typedef  Eq_1104[]struct Eq_1104 {
	word32 dw0000;	// 0
	word32 dw0004;	// 4
	word16 a0008[];	// 8
} Eq_1104;

typedef Eq_1169 Eq_1169struct Eq_1169 {
	Eq_1169 * ptr0000;	// 0
	word32 dw0018;	// 18
	word32 dw001C;	// 1C
} Eq_1169;

typedef Eq_1177 Eq_1174struct Eq_1174 {
	word32 dw0008;	// 8
	Eq_1177 * ptr000C;	// C
} Eq_1174;

typedef Eq_1169 Eq_1177struct Eq_1177 {
	Eq_1169 * ptr000C;	// C
} Eq_1177;

typedef  Eq_1241[]struct Eq_1241 {
	word32 dw0000;	// 0
	word32 dw0004;	// 4
	word16 a0008[];	// 8
} Eq_1241;

typedef struct Eq_1320 {	// size: 8 8
	word32 dw0000;	// 0
} Eq_1320;

typedef code Eq_1330Eq_178 Eq_1330struct Eq_1330 {	// size: 4 4
	code * ptr0000;	// 0
	Eq_178 * ptr0050;	// 50
	word32 dw00A0;	// A0
	word32 dw00A4;	// A4
} Eq_1330;

typedef code Eq_1331Eq_178 Eq_1331Eq_485 Eq_1331Eq_178 Eq_1331struct Eq_1331 {	// size: 20 14
	word32 dw0000;	// 0
	word16 w0006;	// 6
	word32 dw000C;	// C
	word32 dw0010;	// 10
	word16 w0014;	// 14
	word16 w0016;	// 16
	code * ptr0028;	// 28
	Eq_178 * ptr0034;	// 34
	Eq_485 t003C;	// 3C
	Eq_178 * ptr0050;	// 50
	word32 dw00A0;	// A0
	word32 dw00A4;	// A4
} Eq_1331;

