// subject.h
// Generated on TIMESTAMP by decompiling from_pouet.net/with_source_235/ia32_com/subject.exe
// using Decompiler version VERSION

/*
// Equivalence classes ////////////
Eq_1: (struct "Globals")
	globals_t (in globals : (ptr (struct "Globals")))
Eq_2: (fn void (byte))
	T_2 (in bios_video_set_mode : ptr32)
	T_3 (in signature of bios_video_set_mode : void)
	T_224 (in bios_video_set_mode : ptr32)
Eq_7: (union "Eq_7" ((memptr (ptr Eq_10) Eq_276) u0) (Eq_278 u1))
	T_7 (in sp_1 : Eq_7)
	T_8 (in fp : ptr16)
	T_11 (in sp_26 : Eq_7)
	T_208 (in sp_1 - 0x0002 : word16)
Eq_9: (segment "Eq_9" (FFFFF780 (arr byte) aFFFFF780) (0 (arr Eq_273) a0000) (2 Eq_23 t0002) (13A Eq_23 t013A) (1F3 int16 w01F3) (1F5 int16 w01F5) (1F7 Eq_78 t01F7) (1F9 Eq_82 t01F9) (1FB int16 w01FB) (1FC byte b01FC) (1FD int16 w01FD) (F780 byte bF780))
	T_9 (in 0x0000 : word16)
	T_14 (in Mem53[ss:sp_26 + 0x0000:word16] : word16)
	T_22 (in es_29 : selector)
	T_54 (in 0x0140 : word16)
	T_57 (in Mem73[ss:sp_26 - 0x0002:word16] : word16)
	T_62 (in cx_81 : word16)
	T_64 (in Mem73[ss:sp_26 - 0x0002:word16] : word16)
	T_79 (in ds_34 : selector)
	T_94 (in cx_81 - 0x0001 : word16)
	T_95 (in 0x0000 : word16)
	T_159 (in es : (ptr Eq_9))
	T_171 (in Mem131[ss:sp_26 - 0x0002:word16] : word16)
	T_172 (in ds_132 : selector)
	T_174 (in Mem131[ss:sp_26 - 0x0002:selector] : selector)
	T_175 (in 0xA000 : word16)
	T_178 (in Mem135[ss:sp_26 - 0x0002:word16] : word16)
	T_179 (in es_136 : selector)

  Class: Eq_246
  DataType: (ptr Eq_246)
  OrigDataType: (ptr (segment))
T_247: (in 0x0000 : word16)
  Class: Eq_247
  DataType: word16
  OrigDataType: word16
T_248: (in bp + 0x0000 : word16)
  Class: Eq_248
  DataType: word16
  OrigDataType: word16
T_249: (in Mem0[ss:bp + 0x0000:word16] : word16)
  Class: Eq_82
  DataType: Eq_82
  OrigDataType: int16
T_250: (in dx >= Mem0[ss:bp + 0x0000:word16] : bool)
  Class: Eq_250
  DataType: bool
  OrigDataType: bool
T_251: (in 0x000C : word16)
  Class: Eq_251
  DataType: word16
  OrigDataType: word16
T_252: (in dx - 0x000C : word16)
  Class: Eq_82
  DataType: Eq_82
  OrigDataType: cups16
T_253: (in 0x0000 : word16)
  Class: Eq_253
  DataType: word16
  OrigDataType: word16
T_254: (in bp + 0x0000 : word16)
  Class: Eq_254
  DataType: word16
  OrigDataType: word16
T_255: (in Mem0[ss:bp + 0x0000:word16] : word16)
  Class: Eq_82
  DataType: Eq_82
  OrigDataType: cups16
T_256: (in dx - 0x000C <=u Mem0[ss:bp + 0x0000:word16] : bool)
  Class: Eq_256
  DataType: bool
  OrigDataType: bool
T_257: (in 0x0000 : word16)
  Class: Eq_257
  DataType: word16
  OrigDataType: word16
T_258: (in bp + 0x0000 : word16)
  Class: Eq_258
  DataType: word16
  OrigDataType: word16
T_259: (in Mem0[ss:bp + 0x0000:word16] : word16)
  Class: Eq_82
  DataType: Eq_82
  OrigDataType: word16
T_260: (in 0x0001 : word16)
  Class: Eq_260
  DataType: word16
  OrigDataType: word16
T_261: (in Mem0[ss:bp + 0x0000:word16] - 0x0001 : word16)
  Class: Eq_82
  DataType: Eq_82
  OrigDataType: word16
T_262: (in 0x0000 : word16)
  Class: Eq_262
  DataType: word16
  OrigDataType: word16
T_263: (in bp + 0x0000 : word16)
  Class: Eq_263
  DataType: word16
  OrigDataType: word16
T_264: (in Mem13[ss:bp + 0x0000:word16] : word16)
  Class: Eq_82
  DataType: Eq_82
  OrigDataType: word16
T_265: (in 0x0000 : word16)
  Class: Eq_265
  DataType: word16
  OrigDataType: word16
T_266: (in bp + 0x0000 : word16)
  Class: Eq_266
  DataType: word16
  OrigDataType: word16
T_267: (in Mem0[ss:bp + 0x0000:word16] : word16)
  Class: Eq_82
  DataType: Eq_82
  OrigDataType: word16
T_268: (in 0x0001 : word16)
  Class: Eq_268
  DataType: word16
  OrigDataType: word16
T_269: (in Mem0[ss:bp + 0x0000:word16] + 0x0001 : word16)
  Class: Eq_82
  DataType: Eq_82
  OrigDataType: word16
T_270: (in 0x0000 : word16)
  Class: Eq_270
  DataType: word16
  OrigDataType: word16
T_271: (in bp + 0x0000 : word16)
  Class: Eq_271
  DataType: word16
  OrigDataType: word16
T_272: (in Mem21[ss:bp + 0x0000:word16] : word16)
  Class: Eq_82
  DataType: Eq_82
  OrigDataType: word16
T_273:
  Class: Eq_273
  DataType: Eq_273
  OrigDataType: (struct 0001 (0 T_36 t0000))
T_274:
  Class: Eq_274
  DataType: byte
  OrigDataType: (struct 0001 (0 T_71 t0000))
T_275:
  Class: Eq_273
  DataType: Eq_273
  OrigDataType: (struct 0002 (0 Eq_21 t0000))
T_276:
  Class: Eq_276
  DataType: Eq_276
  OrigDataType: 
T_277:
  Class: Eq_277
  DataType: Eq_277
  OrigDataType: 
T_278:
  Class: Eq_278
  DataType: Eq_278
  OrigDataType: 
*/
typedef struct Globals {
} Eq_1;

typedef void (Eq_2)(byte);

typedef union Eq_7 {
	Eq_276 Eq_10::* u0;
	Eq_278 u1;
} Eq_7;

typedef  Eq_9[]Eq_273[]Eq_23Eq_23Eq_78Eq_82struct Eq_9 {
	byte aFFFFF780[];	// FFFFF780
	Eq_273 a0000[];	// 0
	Eq_23 t0002;	// 2
	Eq_23 t013A;	// 13A
	int16 w01F3;	// 1F3
	int16 w01F5;	// 1F5
	Eq_78 t01F7;	// 1F7
	Eq_82 t01F9;	// 1F9
	int16 w01FB;	// 1FB
	byte b01FC;	// 1FC
	int16 w01FD;	// 1FD
	byte bF780;	// F780
} Eq_9;

typedef struct Eq_10 {
} Eq_10;

typedef union Eq_21 {
	byte u0;
	word16 u1;
} Eq_21;

typedef Eq_21 Eq_23struct Eq_23 {	// size: 1 1
	Eq_21 t0000;	// 0
} Eq_23;

typedef struct Eq_37 {
	byte b009E;	// 9E
	byte b013E;	// 13E
} Eq_37;

typedef union Eq_78 {
	int16 u0;
	cups16 u1;
} Eq_78;

typedef union Eq_82 {
	int16 u0;
	cups16 u1;
} Eq_82;

typedef struct Eq_121 {	// size: 320 140
	word32 dw0000;	// 0
} Eq_121;

typedef void (Eq_146)(Eq_82, Eq_82 Eq_246::*);

typedef void (Eq_155)(int16, Eq_23 Eq_9::*, Eq_9 *);

typedef void (Eq_187)(byte);

typedef struct Eq_230 {	// size: 320 140
	word32 dw0000;	// 0
} Eq_230;

typedef Eq_82 Eq_246Eq_82 Eq_246struct Eq_246 {
	Eq_82 t01F3;	// 1F3
	Eq_82 t01F5;	// 1F5
} Eq_246;

typedef union Eq_273 {
	byte u0;
	Eq_21 u1;
} Eq_273;

typedef Eq_9 Eq_276Eq_9 Eq_276struct Eq_276 {
	Eq_9 * ptrFFFFFFFE;	// FFFFFFFE
	Eq_9 * ptr0000;	// 0
} Eq_276;

typedef Eq_9 Eq_277Eq_9 Eq_277struct Eq_277 {
	Eq_9 * ptrFFFFFFFE;	// FFFFFFFE
	Eq_9 * ptr0000;	// 0
} Eq_277;

typedef union Eq_278 {
	ptr16 u0;
	Eq_277 Eq_10::* u1;
} Eq_278;

