// subject.h
// Generated on TIMESTAMP by decompiling malware_via_email/malware_1213/ia32_pe/subject.exe
// using Decompiler version VERSION

/*
// Equivalence classes ////////////
Eq_1: (struct "Globals" (405000 up32 dw405000) (405004 word32 dw405004) (4092A4 Eq_25 t4092A4) (4092A8 word32 dw4092A8) (4092AC up32 dw4092AC) (4092B0 word32 dw4092B0) (4092B4 Eq_25 t4092B4) (4092B8 word32 dw4092B8) (4092BC word32 dw4092BC) (4092C0 word32 dw4092C0) (4092C4 word32 dw4092C4) (4092C8 (ptr Eq_112) ptr4092C8) (4092CC (ptr code) ptr4092CC))
	globals_t (in globals : (ptr (struct "Globals")))
Eq_25: (union "Eq_25" ((ptr Eq_1098) u0) (HANDLE u1) (HMODULE u2) (LPCSTR u3) (LPVOID u4) (SIZE_T u5))
	T_25 (in eax_18 : Eq_25)
	T_28 (in lpModuleName : LPCSTR)
	T_29 (in 0x00000000 : word32)
	T_30 (in GetModuleHandleA(0x00000000) : word32)
	T_31 (in dwArg04 : word32)
	T_42 (in 0x00000000 : word32)
	T_59 (in dwArg04 : Eq_25)
	T_65 (in LoadLibraryA(0x004091F8) : word32)
	T_76 (in Mem188[0x004092B4:word32] : word32)
	T_142 (in dwArg08 : Eq_25)
	T_167 (in hModule : HMODULE)
	T_169 (in dwArg04 : word32)
	T_182 (in dwArg04 : word32)
	T_195 (in eax_40 : Eq_25)
	T_198 (in lpAddress : LPVOID)
	T_199 (in dwSize : SIZE_T)
	T_202 (in 0x00000000 : word32)
	T_205 (in Mem0[eax_23 + 0x00000050:word32] : word32)
	T_208 (in VirtualAlloc(0x00000000, eax_23->t0050, 0x00003000, 0x00000040) : word32)
	T_209 (in 0x00000000 : word32)
	T_228 (in Mem133[fp - 0x000000CC:word32] : word32)
	T_231 (in dwArg04 : Eq_25)

T_1073: (in ecx_26 : word32)
  Class: Eq_1063
  DataType: word32
  OrigDataType: word32
T_1074: (in 0x0000007F : word32)
  Class: Eq_1074
  DataType: word32
  OrigDataType: word32
T_1075: (in ecx_16 & 0x0000007F : word32)
  Class: Eq_1075
  DataType: word32
  OrigDataType: word32
T_1076: (in 0x00000007 : word32)
  Class: Eq_1076
  DataType: word32
  OrigDataType: word32
T_1077: (in dwLoc08_12 << 0x00000007 : word32)
  Class: Eq_1077
  DataType: ui32
  OrigDataType: ui32
T_1078: (in ecx_16 & 0x0000007F | dwLoc08_12 << 0x00000007 : word32)
  Class: Eq_1063
  DataType: word32
  OrigDataType: word32
T_1079: (in edx_29 : word32)
  Class: Eq_1065
  DataType: word32
  OrigDataType: word32
T_1080: (in 0x00000001 : word32)
  Class: Eq_1080
  DataType: word32
  OrigDataType: word32
T_1081: (in dwLoc10_13 + 0x00000001 : word32)
  Class: Eq_1065
  DataType: word32
  OrigDataType: word32
T_1082: (in 0x00000001 : word32)
  Class: Eq_1082
  DataType: word32
  OrigDataType: word32
T_1083: (in dwArg08 + 0x00000001 : word32)
  Class: Eq_1068
  DataType: (ptr Eq_1068)
  OrigDataType: word32
T_1084: (in 0x00000080 : word32)
  Class: Eq_1084
  DataType: word32
  OrigDataType: word32
T_1085: (in ecx_16 & 0x00000080 : word32)
  Class: Eq_1085
  DataType: word32
  OrigDataType: word32
T_1086: (in 0x00000000 : word32)
  Class: Eq_1085
  DataType: word32
  OrigDataType: word32
T_1087: (in (ecx_16 & 0x00000080) != 0x00000000 : bool)
  Class: Eq_1087
  DataType: bool
  OrigDataType: bool
T_1088: (in dwArg04 : word32)
  Class: Eq_1088
  DataType: (ptr word32)
  OrigDataType: (ptr (struct (0 T_1091 t0000)))
T_1089: (in 0x00000000 : word32)
  Class: Eq_1089
  DataType: word32
  OrigDataType: word32
T_1090: (in dwArg04 + 0x00000000 : word32)
  Class: Eq_1090
  DataType: word32
  OrigDataType: word32
T_1091: (in Mem39[dwArg04 + 0x00000000:word32] : word32)
  Class: Eq_1063
  DataType: word32
  OrigDataType: word32
T_1092:
  Class: Eq_1092
  DataType: word16
  OrigDataType: (struct 0002 (0 T_457 t0000))
T_1093:
  Class: Eq_1092
  DataType: word16
  OrigDataType: (struct 0002 (0 T_469 t0000))
T_1094:
  Class: Eq_1092
  DataType: word16
  OrigDataType: (struct 0002 (0 T_482 t0000))
T_1095:
  Class: Eq_1095
  DataType: word16
  OrigDataType: (struct 0002 (0 T_943 t0000))
T_1096:
  Class: Eq_1095
  DataType: word16
  OrigDataType: (struct 0002 (0 T_957 t0000))
T_1097:
  Class: Eq_1095
  DataType: word16
  OrigDataType: (struct 0002 (0 T_972 t0000))
T_1098:
  Class: Eq_1098
  DataType: Eq_1098
  OrigDataType: 
T_1099:
  Class: Eq_1099
  DataType: int32
  OrigDataType: 
*/
typedef Eq_25 Eq_1Eq_25 Eq_1Eq_112 Eq_1code Eq_1struct Globals {
	up32 dw405000;	// 405000
	word32 dw405004;	// 405004
	Eq_25 t4092A4;	// 4092A4
	word32 dw4092A8;	// 4092A8
	up32 dw4092AC;	// 4092AC
	word32 dw4092B0;	// 4092B0
	Eq_25 t4092B4;	// 4092B4
	word32 dw4092B8;	// 4092B8
	word32 dw4092BC;	// 4092BC
	word32 dw4092C0;	// 4092C0
	word32 dw4092C4;	// 4092C4
	Eq_112 * ptr4092C8;	// 4092C8
	code * ptr4092CC;	// 4092CC
} Eq_1;

typedef union Eq_25 {
	Eq_1098* u0;
	 HANDLE u1;
	 HMODULE u2;
	 LPCSTR u3;
	 LPVOID u4;
	 SIZE_T u5;
} Eq_25;

typedef Eq_25 (Eq_26)(Eq_25);

typedef struct Eq_52 {
	word32 dwFFFFFF60;	// FFFFFF60
} Eq_52;

typedef code * (Eq_57)(Eq_25, word32);

typedef Eq_25 (Eq_61)(Eq_63);

typedef union Eq_63 {
	word32 u0;
	 LPCSTR u1;
} Eq_63;

typedef word32 (Eq_86)(word32);

typedef void (Eq_92)(ptr32, word32, up32);

typedef Eq_112 Eq_110struct Eq_110 {
	Eq_112 * ptr0018;	// 18
} Eq_110;

typedef union Eq_111 {
	ptr32 u0;
	Eq_112* Eq_110::* u1;
} Eq_111;

typedef Eq_832 Eq_112struct Eq_112 {
	Eq_832 * ptr0030;	// 30
} Eq_112;

typedef struct Eq_124 {
	word32 dw0008;	// 8
} Eq_124;

typedef struct Eq_133 {
	word32 dw0008;	// 8
} Eq_133;

typedef void (Eq_139)(word32, Eq_25);

typedef void (Eq_153)(word32, word32);

typedef word32 (Eq_162)();

typedef code * (Eq_165)(Eq_25, Eq_168);

typedef union Eq_168 {
	word32 u0;
	 LPCSTR u1;
} Eq_168;

typedef word32 (Eq_172)(Eq_174, Eq_175);

typedef union Eq_174 {
	word32 u0;
	 LPSTR u1;
} Eq_174;

typedef union Eq_175 {
	word32 u0;
	 LPCSTR u1;
} Eq_175;

typedef Eq_25 Eq_176Eq_25 Eq_176struct Eq_176 {
	Eq_25 tFFFFFF20;	// FFFFFF20
	word32 dwFFFFFF2C;	// FFFFFF2C
	Eq_25 tFFFFFF34;	// FFFFFF34
	word32 dwFFFFFF38;	// FFFFFF38
	word32 dwFFFFFFE4;	// FFFFFFE4
} Eq_176;

typedef Eq_313 Eq_181Eq_25 Eq_181struct Eq_181 {
	word16 w0006;	// 6
	word16 w0014;	// 14
	Eq_313 t003C;	// 3C
	Eq_25 t0050;	// 50
} Eq_181;

typedef Eq_187 Eq_187struct Eq_187 {	// size: 40 28
	word32 dw000C;	// C
	word32 dw0010;	// 10
	word32 dw0014;	// 14
	Eq_187 t0028;	// 28
} Eq_187;

typedef Eq_25 (Eq_196)(Eq_25, Eq_25, Eq_200, Eq_201);

typedef union Eq_200 {
	word32 u0;
	 DWORD u1;
} Eq_200;

typedef union Eq_201 {
	word32 u0;
	 DWORD u1;
} Eq_201;

typedef void (Eq_229)(Eq_25, Eq_25, int32);

typedef union Eq_313 {
	int32 u0;
	uint32 u1;
} Eq_313;

typedef union Eq_334 {
	int32 u0;
	uint32 u1;
} Eq_334;

typedef Eq_347 Eq_347struct Eq_347 {	// size: 20 14
	word32 dw0000;	// 0
	word32 dw000C;	// C
	word32 dw0010;	// 10
	Eq_347 t0014;	// 14
} Eq_347;

typedef code Eq_356Eq_356 Eq_356struct Eq_356 {	// size: 4 4
	code * ptr0000;	// 0
	Eq_356 t0004;	// 4
} Eq_356;

typedef code Eq_357Eq_357 Eq_357struct Eq_357 {	// size: 4 4
	code * ptr0000;	// 0
	Eq_357 t0004;	// 4
} Eq_357;

typedef  Eq_418[]struct Eq_418 {
	word32 dw0000;	// 0
	word32 dw0004;	// 4
	word16 a0008[];	// 8
} Eq_418;

typedef Eq_25 Eq_573Eq_25 Eq_573Eq_25 Eq_573struct Eq_573 {
	Eq_25 tFFFFFFF8;	// FFFFFFF8
	Eq_25 tFFFFFFFC;	// FFFFFFFC
	Eq_25 t0000;	// 0
} Eq_573;

typedef word32 (Eq_579)(Eq_25);

typedef void (Eq_630)(Eq_25);

typedef void (Eq_648)(Eq_25, Eq_25);

typedef Eq_25 Eq_681Eq_25 Eq_681struct Eq_681 {
	Eq_25 tFFFFFFEC;	// FFFFFFEC
	word32 dwFFFFFFF0;	// FFFFFFF0
	word32 dwFFFFFFF4;	// FFFFFFF4
	word32 dwFFFFFFF8;	// FFFFFFF8
	word32 dwFFFFFFFC;	// FFFFFFFC
	Eq_25 t0000;	// 0
} Eq_681;

typedef Eq_25 Eq_712Eq_25 Eq_712struct Eq_712 {
	Eq_25 tFFFFFFEC;	// FFFFFFEC
	word32 dwFFFFFFF0;	// FFFFFFF0
	word32 dwFFFFFFF4;	// FFFFFFF4
	word32 dwFFFFFFF8;	// FFFFFFF8
	word32 dwFFFFFFFC;	// FFFFFFFC
	Eq_25 t0000;	// 0
} Eq_712;

typedef Eq_25 Eq_748Eq_25 Eq_748Eq_200 Eq_748Eq_201 Eq_748struct Eq_748 {
	Eq_25 tFFFFFFF4;	// FFFFFFF4
	Eq_25 tFFFFFFF8;	// FFFFFFF8
	Eq_200 tFFFFFFFC;	// FFFFFFFC
	Eq_201 t0000;	// 0
} Eq_748;

typedef Eq_25 Eq_787Eq_25 Eq_787Eq_200 Eq_787Eq_201 Eq_787struct Eq_787 {
	Eq_25 tFFFFFFF4;	// FFFFFFF4
	Eq_25 tFFFFFFF8;	// FFFFFFF8
	Eq_200 tFFFFFFFC;	// FFFFFFFC
	Eq_201 t0000;	// 0
} Eq_787;

typedef Eq_827 Eq_827struct Eq_827 {
	Eq_827 * ptr0000;	// 0
	word32 dw0018;	// 18
	word32 dw001C;	// 1C
} Eq_827;

typedef Eq_835 Eq_832struct Eq_832 {
	word32 dw0008;	// 8
	Eq_835 * ptr000C;	// C
} Eq_832;

typedef Eq_827 Eq_835struct Eq_835 {
	Eq_827 * ptr000C;	// C
} Eq_835;

typedef Eq_25 Eq_874struct Eq_874 {
	Eq_25 t0050;	// 50
	word32 dw00A0;	// A0
	word32 dw00A4;	// A4
} Eq_874;

typedef Eq_25 Eq_896Eq_25 Eq_896struct Eq_896 {
	Eq_25 tFFFFFFD0;	// FFFFFFD0
	Eq_25 tFFFFFFD4;	// FFFFFFD4
} Eq_896;

typedef  Eq_918[]struct Eq_918 {
	word32 dw0000;	// 0
	word32 dw0004;	// 4
	word16 a0008[];	// 8
} Eq_918;

typedef word32 (Eq_1017)(word32, word32);

typedef Eq_1068 Eq_1068struct Eq_1068 {	// size: 1 1
	byte b0000;	// 0
	Eq_1068 t0001;	// 1
} Eq_1068;

typedef code Eq_1098Eq_25 Eq_1098Eq_25 Eq_1098struct Eq_1098 {
	code * ptr0028;	// 28
	Eq_25 t0034;	// 34
	word32 dw003C;	// 3C
	Eq_25 t0050;	// 50
	word32 dw0080;	// 80
	word32 dw00A0;	// A0
	word32 dw00A4;	// A4
} Eq_1098;

