// subject.h
// Generated on TIMESTAMP by decompiling malware_via_email/malware_0754/ia32_pe/subject.exe
// using Decompiler version VERSION

/*
// Equivalence classes ////////////
Eq_1: (struct "Globals" (40407C (struct "Eq_2081" (0 up32 dw0000) (4 Eq_50 t0004) (3C word32 dw003C)) t40407C) (404088 word32 dw404088) (40408C int32 dw40408C) (404090 int32 dw404090) (404094 ui32 dw404094) (404098 int32 dw404098) (40409C word32 dw40409C) (4040A0 Eq_328 t4040A0) (4040A4 (ptr Eq_889) ptr4040A4) (4040A8 int32 dw4040A8) (4040AC word32 dw4040AC) (4040B0 word32 dw4040B0) (4040B4 Eq_50 t4040B4) (4040B8 word32 dw4040B8) (4040BC int32 dw4040BC) (4040C0 Eq_144 t4040C0) (4040C4 Eq_50 t4040C4) (4040C8 (ptr Eq_933) ptr4040C8) (4040CC (ptr code) ptr4040CC) (4040D0 int32 dw4040D0))
	globals_t (in globals : (ptr (struct "Globals")))
Eq_10: (fn word32 (Eq_12, int32, Eq_14))
	T_10 (in GetTextFaceA : ptr32)
	T_11 (in signature of GetTextFaceA : void)
	T_799 (in GetTextFaceA : ptr32)
Eq_12: (union "Eq_12" (word32 u0) (HDC u1))
	T_12 (in hdc : HDC)
	T_21 (in GetDC(GetDesktopWindow()) : word32)
	T_803 (in GetDC(GetDesktopWindow()) : word32)
Eq_14: (union "Eq_14" (word32 u0) (LPSTR u1))
	T_14 (in lpName : LPSTR)
	T_25 (in fp + 0xFFFFFEE4 : word32)
	T_806 (in fp + 0xFFFFFE84 : word32)
Eq_15: (fn Eq_12 (Eq_17))
	T_15 (in GetDC : ptr32)
	T_16 (in signature of GetDC : void)
	T_800 (in GetDC : ptr32)
Eq_17: (union "Eq_17" (word32 u0) (HWND u1))
	T_17 (in hWnd : HWND)
	T_20 (in GetDesktopWindow() : word32)

  Class: Eq_113
  DataType: int32
  OrigDataType: int32
T_2069: (in dwLoc08 *s globals->dw40408C : int32)
  Class: Eq_2069
  DataType: int32
  OrigDataType: int32
T_2070: (in dwLoc14 - dwLoc08 *s globals->dw40408C : word32)
  Class: Eq_113
  DataType: int32
  OrigDataType: word32
T_2071: (in 0x0040408C : ptr32)
  Class: Eq_2071
  DataType: (ptr int32)
  OrigDataType: (ptr (struct (0 T_2072 t0000)))
T_2072: (in Mem60[0x0040408C:word32] : word32)
  Class: Eq_113
  DataType: int32
  OrigDataType: word32
T_2073:
  Class: Eq_2073
  DataType: word16
  OrigDataType: (struct 0002 (0 T_1231 t0000))
T_2074:
  Class: Eq_2073
  DataType: word16
  OrigDataType: (struct 0002 (0 T_1245 t0000))
T_2075:
  Class: Eq_2073
  DataType: word16
  OrigDataType: (struct 0002 (0 T_1260 t0000))
T_2076:
  Class: Eq_2076
  DataType: word16
  OrigDataType: (struct 0002 (0 T_1547 t0000))
T_2077:
  Class: Eq_2076
  DataType: word16
  OrigDataType: (struct 0002 (0 T_1559 t0000))
T_2078:
  Class: Eq_2076
  DataType: word16
  OrigDataType: (struct 0002 (0 T_1572 t0000))
T_2079:
  Class: Eq_2079
  DataType: int32
  OrigDataType: 
T_2080:
  Class: Eq_2080
  DataType: int32
  OrigDataType: 
T_2081:
  Class: Eq_2081
  DataType: Eq_2081
  OrigDataType: 
T_2082:
  Class: Eq_2082
  DataType: int32
  OrigDataType: 
T_2083:
  Class: Eq_2083
  DataType: Eq_2083
  OrigDataType: 
T_2084:
  Class: Eq_2084
  DataType: Eq_2084
  OrigDataType: 
T_2085:
  Class: Eq_2085
  DataType: int32
  OrigDataType: 
T_2086:
  Class: Eq_2086
  DataType: int32
  OrigDataType: 
T_2087:
  Class: Eq_2087
  DataType: int32
  OrigDataType: 
T_2088:
  Class: Eq_2088
  DataType: int32
  OrigDataType: 
T_2089:
  Class: Eq_2089
  DataType: int32
  OrigDataType: 
T_2090:
  Class: Eq_2090
  DataType: int32
  OrigDataType: 
T_2091:
  Class: Eq_2091
  DataType: int32
  OrigDataType: 
T_2092:
  Class: Eq_2092
  DataType: int32
  OrigDataType: 
T_2093:
  Class: Eq_2093
  DataType: int32
  OrigDataType: 
T_2094:
  Class: Eq_2094
  DataType: Eq_2094
  OrigDataType: 
T_2095:
  Class: Eq_2095
  DataType: Eq_2095
  OrigDataType: 
T_2096:
  Class: Eq_2096
  DataType: Eq_2096
  OrigDataType: 
T_2097:
  Class: Eq_2097
  DataType: Eq_2097
  OrigDataType: 
T_2098:
  Class: Eq_2098
  DataType: Eq_2098
  OrigDataType: 
*/
typedef struct Eq_2081;
Eq_328 Eq_1Eq_889 Eq_1Eq_50 Eq_1Eq_144 Eq_1Eq_50 Eq_1Eq_933 Eq_1code Eq_1struct Globals {
	struct Eq_2081 t40407C;	// 40407C
	word32 dw404088;	// 404088
	int32 dw40408C;	// 40408C
	int32 dw404090;	// 404090
	ui32 dw404094;	// 404094
	int32 dw404098;	// 404098
	word32 dw40409C;	// 40409C
	Eq_328 t4040A0;	// 4040A0
	Eq_889 * ptr4040A4;	// 4040A4
	int32 dw4040A8;	// 4040A8
	word32 dw4040AC;	// 4040AC
	word32 dw4040B0;	// 4040B0
	Eq_50 t4040B4;	// 4040B4
	word32 dw4040B8;	// 4040B8
	int32 dw4040BC;	// 4040BC
	Eq_144 t4040C0;	// 4040C0
	Eq_50 t4040C4;	// 4040C4
	Eq_933 * ptr4040C8;	// 4040C8
	code * ptr4040CC;	// 4040CC
	int32 dw4040D0;	// 4040D0
} Eq_1;

typedef word32 (Eq_10)(Eq_12, int32, Eq_14);

typedef union Eq_12 {
	word32 u0;
	 HDC u1;
} Eq_12;

typedef union Eq_14 {
	word32 u0;
	 LPSTR u1;
} Eq_14;

typedef Eq_12 (Eq_15)(Eq_17);

typedef union Eq_17 {
	word32 u0;
	 HWND u1;
} Eq_17;

typedef Eq_17 (Eq_18)();

typedef int32 (Eq_48)(Eq_50);

typedef union Eq_50 {
	Eq_2081* u0;
	 HANDLE u1;
	 HINSTANCE u2;
	 LPCSTR u3;
	 LPSTR u4;
	 UINT u5;
} Eq_50;

typedef struct Eq_62 {
	word32 dwFFFFFFC4;	// FFFFFFC4
} Eq_62;

typedef void (Eq_66)(Eq_50);

typedef word32 (Eq_117)(word32, word32);

typedef union Eq_144 {
	int32 u0;
	ptr32 u1;
} Eq_144;

typedef Eq_192 Eq_192struct Eq_192 {	// size: 1 1
	byte b0000;	// 0
	Eq_192 t0001;	// 1
} Eq_192;

typedef word32 (Eq_227)(Eq_229, Eq_230, Eq_231, Eq_232, Eq_233, Eq_234, Eq_235);

typedef union Eq_229 {
	word32 u0;
	 LPCSTR u1;
} Eq_229;

typedef union Eq_230 {
	word32 u0;
	 DWORD u1;
} Eq_230;

typedef union Eq_231 {
	word32 u0;
	 DWORD u1;
} Eq_231;

typedef union Eq_232 {
	word32 u0;
	 LPSECURITY_ATTRIBUTES u1;
} Eq_232;

typedef union Eq_233 {
	word32 u0;
	 DWORD u1;
} Eq_233;

typedef union Eq_234 {
	word32 u0;
	 DWORD u1;
} Eq_234;

typedef union Eq_235 {
	word32 u0;
	 HANDLE u1;
} Eq_235;

typedef Eq_328 (Eq_324)(Eq_50);

typedef union Eq_328 {
	Eq_2084* u0;
	 DWORD u1;
	 HINSTANCE u2;
	 HMODULE u3;
	 LPCVOID u4;
	 LPVOID u5;
} Eq_328;

typedef word32 (Eq_342)(Eq_328, Eq_345);

typedef union Eq_345 {
	word32 u0;
	 LPCSTR u1;
} Eq_345;

typedef word32 (Eq_362)(Eq_364, Eq_365);

typedef union Eq_364 {
	word32 u0;
	 HINSTANCE u1;
} Eq_364;

typedef union Eq_365 {
	word32 u0;
	 LPCSTR u1;
} Eq_365;

typedef word32 (Eq_392)(WNDCLASSA *);

typedef WNDCLASSA;

typedef Eq_50 Eq_395Eq_50 Eq_395Eq_328 Eq_395Eq_328 Eq_395Eq_50 Eq_395struct Eq_395 {
	Eq_50 tFFFFFE5C;	// FFFFFE5C
	Eq_50 tFFFFFE60;	// FFFFFE60
	Eq_328 tFFFFFE64;	// FFFFFE64
	Eq_328 tFFFFFE68;	// FFFFFE68
	Eq_50 tFFFFFE6C;	// FFFFFE6C
	int32 dwFFFFFFD8;	// FFFFFFD8
	word32 dwFFFFFFE8;	// FFFFFFE8
} Eq_395;

typedef word32 (Eq_433)(Eq_435, Eq_436, Eq_437, Eq_438, int32, int32, int32, int32, Eq_443, Eq_444, Eq_50, Eq_446);

typedef union Eq_435 {
	word32 u0;
	 DWORD u1;
} Eq_435;

typedef union Eq_436 {
	word32 u0;
	 LPCSTR u1;
} Eq_436;

typedef union Eq_437 {
	word32 u0;
	 LPCSTR u1;
} Eq_437;

typedef union Eq_438 {
	word32 u0;
	 DWORD u1;
} Eq_438;

typedef union Eq_443 {
	word32 u0;
	 HWND u1;
} Eq_443;

typedef union Eq_444 {
	word32 u0;
	 HMENU u1;
} Eq_444;

typedef union Eq_446 {
	word32 u0;
	 LPVOID u1;
} Eq_446;

typedef Eq_556 Eq_503struct Eq_503 {
	word16 w0006;	// 6
	word16 w0014;	// 14
	Eq_556 t003C;	// 3C
} Eq_503;

typedef word32 (Eq_508)(Eq_510);

typedef union Eq_510 {
	word32 u0;
	 DWORD u1;
	 LPCSTR u2;
} Eq_510;

typedef struct Eq_531 {
	word32 dw0010;	// 10
	word32 dw0014;	// 14
} Eq_531;

typedef union Eq_556 {
	int32 u0;
	uint32 u1;
} Eq_556;

typedef union Eq_558 {
	word32 u0;
	 LONG u1;
} Eq_558;

typedef union Eq_569 {
	int32 u0;
	uint32 u1;
} Eq_569;

typedef Eq_50 (Eq_584)(word32);

typedef word32 (Eq_613)(Eq_615, Eq_50, Eq_510);

typedef union Eq_615 {
	word32 u0;
	 HMODULE u1;
} Eq_615;

typedef Eq_50 (Eq_637)(Eq_50);

typedef union Eq_674 {
	word32 u0;
	 DWORD u1;
} Eq_674;

typedef word32 (Eq_675)(Eq_50, Eq_678);

typedef union Eq_678 {
	word32 u0;
	 LPDWORD u1;
} Eq_678;

typedef word32 (Eq_710)(Eq_712, Eq_558, Eq_714, Eq_715);

typedef union Eq_712 {
	word32 u0;
	 HANDLE u1;
	 LPVOID u2;
} Eq_712;

typedef union Eq_714 {
	word32 u0;
	 PLONG u1;
} Eq_714;

typedef union Eq_715 {
	word32 u0;
	 DWORD u1;
} Eq_715;

typedef word32 (Eq_726)(Eq_728, Eq_712, Eq_674, Eq_731, Eq_732);

typedef union Eq_728 {
	word32 u0;
	 HANDLE u1;
} Eq_728;

typedef union Eq_731 {
	word32 u0;
	 LPDWORD u1;
} Eq_731;

typedef union Eq_732 {
	word32 u0;
	 LPOVERLAPPED u1;
} Eq_732;

typedef word32 (Eq_755)(Eq_757);

typedef union Eq_757 {
	word32 u0;
	 HANDLE u1;
} Eq_757;

typedef word32 (Eq_767)(int32);

typedef void (Eq_822)(Eq_50, Eq_50, Eq_328);

typedef struct Eq_868 {
	word32 dw0008;	// 8
} Eq_868;

typedef struct Eq_874 {
	word32 dw0008;	// 8
} Eq_874;

typedef Eq_50 Eq_889struct Eq_889 {
	word32 dwFFFFFFE0;	// FFFFFFE0
	int32 dwFFFFFFEC;	// FFFFFFEC
	int32 dwFFFFFFF0;	// FFFFFFF0
	Eq_50 tFFFFFFF4;	// FFFFFFF4
	int32 dwFFFFFFF8;	// FFFFFFF8
} Eq_889;

typedef Eq_889 * (Eq_890)(word32 *, word32, Eq_50, up32);

typedef Eq_933 Eq_931struct Eq_931 {
	Eq_933 * ptr0018;	// 18
} Eq_931;

typedef Eq_1944 Eq_933struct Eq_933 {
	Eq_1944 * ptr0030;	// 30
} Eq_933;

typedef void (Eq_1008)(word32);

typedef word32 (Eq_1036)(word32);

typedef void (Eq_1115)(word32);

typedef Eq_1147 Eq_1142struct Eq_1142 {
	Eq_1147 t0050;	// 50
	word32 dw00A0;	// A0
	word32 dw00A4;	// A4
} Eq_1142;

typedef union Eq_1147 {
	word32 u0;
	 SIZE_T u1;
} Eq_1147;

typedef Eq_328 Eq_1148Eq_1147 Eq_1148struct Eq_1148 {
	Eq_328 tFFFFFFC0;	// FFFFFFC0
	Eq_1147 tFFFFFFC4;	// FFFFFFC4
} Eq_1148;

typedef Eq_50 (Eq_1152)(Eq_328, Eq_1147, Eq_1156, Eq_328);

typedef union Eq_1156 {
	Eq_2097* u0;
	 DWORD u1;
} Eq_1156;

typedef  Eq_1193[]struct Eq_1193 {
	word32 dw0000;	// 0
	word32 dw0004;	// 4
	word16 a0008[];	// 8
} Eq_1193;

typedef Eq_1373 Eq_1275Eq_1147 Eq_1275struct Eq_1275 {
	word16 w0006;	// 6
	word16 w0014;	// 14
	Eq_1373 t003C;	// 3C
	Eq_1147 t0050;	// 50
} Eq_1275;

typedef Eq_1281 Eq_1281struct Eq_1281 {	// size: 40 28
	word32 dw000C;	// C
	word32 dw0010;	// 10
	word32 dw0014;	// 14
	Eq_1281 t0028;	// 28
} Eq_1281;

typedef Eq_1473 Eq_1319Eq_1670 Eq_1319Eq_328 Eq_1319Eq_328 Eq_1319Eq_1156 Eq_1319Eq_328 Eq_1319struct Eq_1319 {
	Eq_1473 tFFFFFF88;	// FFFFFF88
	Eq_1670 tFFFFFF8C;	// FFFFFF8C
	Eq_328 tFFFFFF90;	// FFFFFF90
	Eq_328 tFFFFFF94;	// FFFFFF94
	Eq_1156 tFFFFFF98;	// FFFFFF98
	Eq_328 tFFFFFF9C;	// FFFFFF9C
	word32 dwFFFFFFE8;	// FFFFFFE8
} Eq_1319;

typedef code Eq_1338Eq_328 Eq_1338Eq_328 Eq_1338struct Eq_1338 {
	code * ptr0028;	// 28
	Eq_328 t0034;	// 34
	Eq_328 t0050;	// 50
	word32 dw0080;	// 80
	word32 dw00A0;	// A0
	word32 dw00A4;	// A4
} Eq_1338;

typedef Eq_1343 Eq_1343struct Eq_1343 {	// size: 20 14
	word32 dw0000;	// 0
	word32 dw000C;	// C
	word32 dw0010;	// 10
	Eq_1343 t0014;	// 14
} Eq_1343;

typedef union Eq_1373 {
	int32 u0;
	uint32 u1;
} Eq_1373;

typedef union Eq_1394 {
	int32 u0;
	uint32 u1;
} Eq_1394;

typedef Eq_1414 Eq_1414struct Eq_1414 {	// size: 4 4
	word32 dw0000;	// 0
	Eq_1414 t0004;	// 4
} Eq_1414;

typedef Eq_1415 Eq_1415struct Eq_1415 {	// size: 4 4
	word32 dw0000;	// 0
	Eq_1415 t0004;	// 4
} Eq_1415;

typedef Eq_328 (Eq_1430)(Eq_1432);

typedef union Eq_1432 {
	word32 u0;
	 LPCSTR u1;
} Eq_1432;

typedef union Eq_1473 {
	word32 u0;
	 HANDLE u1;
} Eq_1473;

typedef Eq_1473 (Eq_1474)(Eq_1476, Eq_1477, Eq_1478, Eq_1479, Eq_328, Eq_1481);

typedef union Eq_1476 {
	word32 u0;
	 HANDLE u1;
} Eq_1476;

typedef union Eq_1477 {
	word32 u0;
	 LPSECURITY_ATTRIBUTES u1;
} Eq_1477;

typedef union Eq_1478 {
	word32 u0;
	 DWORD u1;
} Eq_1478;

typedef union Eq_1479 {
	word32 u0;
	 DWORD u1;
} Eq_1479;

typedef union Eq_1481 {
	word32 u0;
	 LPCSTR u1;
} Eq_1481;

typedef  Eq_1502[]struct Eq_1502 {
	word32 dw0000;	// 0
	word32 dw0004;	// 4
	word16 a0008[];	// 8
} Eq_1502;

typedef word32 (Eq_1587)(Eq_328, Eq_1590);

typedef union Eq_1590 {
	word32 u0;
	 LPCSTR u1;
} Eq_1590;

typedef union Eq_1670 {
	word32 u0;
	 DWORD u1;
} Eq_1670;

typedef Eq_50 (Eq_1677)(Eq_1473, Eq_1670, Eq_328, Eq_1682, Eq_1683, Eq_328);

typedef union Eq_1682 {
	word32 u0;
	 DWORD u1;
} Eq_1682;

typedef union Eq_1683 {
	word32 u0;
	 SIZE_T u1;
} Eq_1683;

typedef word32 (Eq_1748)(Eq_328);

typedef word32 (Eq_1772)(Eq_328, Eq_1683, Eq_1776);

typedef union Eq_1776 {
	word32 u0;
	 DWORD u1;
} Eq_1776;

typedef void (Eq_1783)(Eq_50);

typedef void (Eq_1789)(Eq_328, word32);

typedef Eq_1954 Eq_1939struct Eq_1939 {
	Eq_1954 * ptr000C;	// C
} Eq_1939;

typedef Eq_1939 Eq_1944struct Eq_1944 {
	word32 dw0008;	// 8
	Eq_1939 * ptr000C;	// C
} Eq_1944;

typedef Eq_1954 Eq_1954struct Eq_1954 {
	Eq_1954 * ptr0000;	// 0
	word32 dw0018;	// 18
	word32 dw001C;	// 1C
} Eq_1954;

typedef word32 (Eq_2009)(Eq_2011, Eq_2012, Eq_2013);

typedef union Eq_2011 {
	word32 u0;
	 HANDLE u1;
} Eq_2011;

typedef union Eq_2012 {
	word32 u0;
	 DWORD u1;
} Eq_2012;

typedef union Eq_2013 {
	word32 u0;
	 LPVOID u1;
} Eq_2013;

typedef Eq_2011 (Eq_2014)();

typedef word32 (Eq_2035)(Eq_17, Eq_2038, int32);

typedef union Eq_2038 {
	word32 u0;
	 LPSTR u1;
} Eq_2038;

typedef word32 (Eq_2055)(Eq_2011, Eq_2058, Eq_2059);

typedef union Eq_2058 {
	word32 u0;
	 DWORD u1;
} Eq_2058;

typedef union Eq_2059 {
	word32 u0;
	 SIZE_T u1;
} Eq_2059;

typedef struct Eq_2081 Eq_2081;

typedef DWORDLPVOIDBOOLstruct _SECURITY_ATTRIBUTES {
	DWORD;	// 0
	LPVOID;	// 4
	BOOL;	// 8
} Eq_2083;

typedef struct Eq_2084 {
	word32 dw003C;	// 3C
} Eq_2084;

typedef DWORDDWORDstruct struct_61 {
	DWORD;	// 0
	DWORD;	// 4
} Eq_2094;

typedef union Eq_2095 {
	 <anonymous> u0;
	 PVOID u1;
} Eq_2095;

typedef ULONG_PTRULONG_PTREq_2095 Eq_2096HANDLEstruct _OVERLAPPED {
	ULONG_PTR;	// 0
	ULONG_PTR;	// 4
	Eq_2095 t0008;	// 8
	HANDLE;	// 10
} Eq_2096;

typedef struct Eq_2097 {
	word32 dw003C;	// 3C
} Eq_2097;

typedef DWORDLPVOIDBOOLstruct _SECURITY_ATTRIBUTES {
	DWORD;	// 0
	LPVOID;	// 4
	BOOL;	// 8
} Eq_2098;

