// subject.h
// Generated on TIMESTAMP by decompiling malware_via_email/malware_0974/ia32_pe/subject.exe
// using Decompiler version VERSION

/*
// Equivalence classes ////////////
Eq_1: (struct "Globals" (405000 Eq_18 t405000) (405004 Eq_18 t405004) (4090CC Eq_18 t4090CC) (4090D0 word32 dw4090D0) (4090D4 word32 dw4090D4) (4090D8 Eq_18 t4090D8) (4090DC word32 dw4090DC) (4090E0 word32 dw4090E0) (4090E4 word32 dw4090E4) (4090E8 word32 dw4090E8) (4090EC (ptr Eq_454) ptr4090EC) (4090F0 (ptr code) ptr4090F0))
	globals_t (in globals : (ptr (struct "Globals")))
Eq_2: (fn word32 ())
	T_2 (in GetCommandLineA : ptr32)
	T_3 (in signature of GetCommandLineA : void)
	T_37 (in GetCommandLineA : ptr32)
	T_39 (in GetCommandLineA : ptr32)
	T_41 (in GetCommandLineA : ptr32)
	T_43 (in GetCommandLineA : ptr32)
	T_45 (in GetCommandLineA : ptr32)
	T_47 (in GetCommandLineA : ptr32)
	T_49 (in GetCommandLineA : ptr32)
	T_51 (in GetCommandLineA : ptr32)
	T_53 (in GetCommandLineA : ptr32)
	T_55 (in GetCommandLineA : ptr32)
	T_57 (in GetCommandLineA : ptr32)
	T_59 (in GetCommandLineA : ptr32)
	T_61 (in GetCommandLineA : ptr32)
	T_63 (in GetCommandLineA : ptr32)
	T_65 (in GetCommandLineA : ptr32)
	T_67 (in GetCommandLineA : ptr32)
	T_69 (in GetCommandLineA : ptr32)
	T_71 (in GetCommandLineA : ptr32)
	T_73 (in GetCommandLineA : ptr32)
	T_75 (in GetCommandLineA : ptr32)
	T_77 (in GetCommandLineA : ptr32)
	T_79 (in GetCommandLineA : ptr32)
	T_81 (in GetCommandLineA : ptr32)

T_1794: (in 0x00000007 : word32)
  Class: Eq_1794
  DataType: word32
  OrigDataType: word32
T_1795: (in dwLoc08_12 << 0x00000007 : word32)
  Class: Eq_1795
  DataType: ui32
  OrigDataType: ui32
T_1796: (in ecx_16 & 0x0000007F | dwLoc08_12 << 0x00000007 : word32)
  Class: Eq_1781
  DataType: word32
  OrigDataType: word32
T_1797: (in edx_29 : word32)
  Class: Eq_1783
  DataType: word32
  OrigDataType: word32
T_1798: (in 0x00000001 : word32)
  Class: Eq_1798
  DataType: word32
  OrigDataType: word32
T_1799: (in dwLoc10_13 + 0x00000001 : word32)
  Class: Eq_1783
  DataType: word32
  OrigDataType: word32
T_1800: (in 0x00000001 : word32)
  Class: Eq_1800
  DataType: word32
  OrigDataType: word32
T_1801: (in dwArg08 + 0x00000001 : word32)
  Class: Eq_1786
  DataType: (ptr Eq_1786)
  OrigDataType: word32
T_1802: (in 0x00000080 : word32)
  Class: Eq_1802
  DataType: word32
  OrigDataType: word32
T_1803: (in ecx_16 & 0x00000080 : word32)
  Class: Eq_1803
  DataType: word32
  OrigDataType: word32
T_1804: (in 0x00000000 : word32)
  Class: Eq_1803
  DataType: word32
  OrigDataType: word32
T_1805: (in (ecx_16 & 0x00000080) != 0x00000000 : bool)
  Class: Eq_1805
  DataType: bool
  OrigDataType: bool
T_1806: (in dwArg04 : word32)
  Class: Eq_1806
  DataType: (ptr word32)
  OrigDataType: (ptr (struct (0 T_1809 t0000)))
T_1807: (in 0x00000000 : word32)
  Class: Eq_1807
  DataType: word32
  OrigDataType: word32
T_1808: (in dwArg04 + 0x00000000 : word32)
  Class: Eq_1808
  DataType: word32
  OrigDataType: word32
T_1809: (in Mem39[dwArg04 + 0x00000000:word32] : word32)
  Class: Eq_1781
  DataType: word32
  OrigDataType: word32
T_1810:
  Class: Eq_1810
  DataType: word16
  OrigDataType: (struct 0002 (0 T_1149 t0000))
T_1811:
  Class: Eq_1810
  DataType: word16
  OrigDataType: (struct 0002 (0 T_1161 t0000))
T_1812:
  Class: Eq_1810
  DataType: word16
  OrigDataType: (struct 0002 (0 T_1174 t0000))
T_1813:
  Class: Eq_1813
  DataType: word16
  OrigDataType: (struct 0002 (0 T_1661 t0000))
T_1814:
  Class: Eq_1813
  DataType: word16
  OrigDataType: (struct 0002 (0 T_1675 t0000))
T_1815:
  Class: Eq_1813
  DataType: word16
  OrigDataType: (struct 0002 (0 T_1690 t0000))
T_1816:
  Class: Eq_1816
  DataType: Eq_1816
  OrigDataType: 
T_1817:
  Class: Eq_1817
  DataType: int32
  OrigDataType: 
T_1818:
  Class: Eq_1818
  DataType: int32
  OrigDataType: 
T_1819:
  Class: Eq_1819
  DataType: int32
  OrigDataType: 
T_1820:
  Class: Eq_1820
  DataType: int32
  OrigDataType: 
T_1821:
  Class: Eq_1821
  DataType: Eq_1821
  OrigDataType: 
*/
typedef Eq_18 Eq_1Eq_18 Eq_1Eq_18 Eq_1Eq_18 Eq_1Eq_454 Eq_1code Eq_1struct Globals {
	Eq_18 t405000;	// 405000
	Eq_18 t405004;	// 405004
	Eq_18 t4090CC;	// 4090CC
	word32 dw4090D0;	// 4090D0
	word32 dw4090D4;	// 4090D4
	Eq_18 t4090D8;	// 4090D8
	word32 dw4090DC;	// 4090DC
	word32 dw4090E0;	// 4090E0
	word32 dw4090E4;	// 4090E4
	word32 dw4090E8;	// 4090E8
	Eq_454 * ptr4090EC;	// 4090EC
	code * ptr4090F0;	// 4090F0
} Eq_1;

typedef word32 (Eq_2)();

typedef union Eq_18 {
	Eq_1816* u0;
	 DWORD u1;
	 HINSTANCE u2;
	 HMODULE u3;
	 LPCSTR u4;
	 LPVOID u5;
	 SIZE_T u6;
} Eq_18;

typedef Eq_18 (Eq_19)(Eq_18);

typedef word32 (Eq_24)(Eq_26, Eq_27, Eq_28);

typedef union Eq_26 {
	word32 u0;
	 HKEY u1;
} Eq_26;

typedef union Eq_27 {
	word32 u0;
	 LPCSTR u1;
} Eq_27;

typedef union Eq_28 {
	word32 u0;
	 PHKEY u1;
} Eq_28;

typedef Eq_18 Eq_31struct Eq_31 {
	ptr32 ptrFFFFFFC8;	// FFFFFFC8
	word32 dwFFFFFFCC;	// FFFFFFCC
	Eq_18 tFFFFFFD0;	// FFFFFFD0
} Eq_31;

typedef word32 (Eq_246)(Eq_18, Eq_249, Eq_250, Eq_251, Eq_252);

typedef union Eq_249 {
	word32 u0;
	 LPCSTR u1;
} Eq_249;

typedef union Eq_250 {
	word32 u0;
	 HWND u1;
} Eq_250;

typedef union Eq_251 {
	word32 u0;
	 DLGPROC u1;
} Eq_251;

typedef union Eq_252 {
	word32 u0;
	 LPARAM u1;
} Eq_252;

typedef word32 (Eq_282)(word32);

typedef void (Eq_301)(word32, word32, word32);

typedef Eq_454 Eq_452struct Eq_452 {
	Eq_454 * ptr0018;	// 18
} Eq_452;

typedef Eq_1545 Eq_454struct Eq_454 {
	Eq_1545 * ptr0030;	// 30
} Eq_454;

typedef struct Eq_466 {
	word32 dw0008;	// 8
} Eq_466;

typedef struct Eq_473 {
	word32 dw0008;	// 8
} Eq_473;

typedef void (Eq_482)(word32, word32);

typedef void (Eq_501)(word32, word32);

typedef code * (Eq_510)(Eq_18, Eq_513);

typedef union Eq_513 {
	word32 u0;
	 LPCSTR u1;
} Eq_513;

typedef Eq_656 Eq_524Eq_18 Eq_524struct Eq_524 {
	word16 w0006;	// 6
	word16 w0014;	// 14
	Eq_656 t003C;	// 3C
	Eq_18 t0050;	// 50
} Eq_524;

typedef Eq_530 Eq_530struct Eq_530 {	// size: 40 28
	word32 dw000C;	// C
	word32 dw0010;	// 10
	word32 dw0014;	// 14
	Eq_530 t0028;	// 28
} Eq_530;

typedef Eq_18 (Eq_539)(Eq_18, Eq_18, Eq_543, Eq_544);

typedef union Eq_543 {
	word32 u0;
	 DWORD u1;
} Eq_543;

typedef union Eq_544 {
	word32 u0;
	 DWORD u1;
} Eq_544;

typedef Eq_18 Eq_555Eq_18 Eq_555Eq_18 Eq_555struct Eq_555 {
	Eq_18 tFFFFFF98;	// FFFFFF98
	word32 dwFFFFFF9C;	// FFFFFF9C
	word32 dwFFFFFFA0;	// FFFFFFA0
	word32 dwFFFFFFA4;	// FFFFFFA4
	Eq_18 tFFFFFFA8;	// FFFFFFA8
	Eq_18 tFFFFFFAC;	// FFFFFFAC
	word32 dwFFFFFFE8;	// FFFFFFE8
} Eq_555;

typedef void (Eq_591)(Eq_18, Eq_18, int32);

typedef Eq_18 (Eq_620)(Eq_622, Eq_623, Eq_624, Eq_625, Eq_18, Eq_627);

typedef union Eq_622 {
	word32 u0;
	 HANDLE u1;
} Eq_622;

typedef union Eq_623 {
	word32 u0;
	 LPSECURITY_ATTRIBUTES u1;
} Eq_623;

typedef union Eq_624 {
	word32 u0;
	 DWORD u1;
} Eq_624;

typedef union Eq_625 {
	word32 u0;
	 DWORD u1;
} Eq_625;

typedef union Eq_627 {
	word32 u0;
	 LPCSTR u1;
} Eq_627;

typedef union Eq_656 {
	int32 u0;
	uint32 u1;
} Eq_656;

typedef union Eq_677 {
	int32 u0;
	uint32 u1;
} Eq_677;

typedef Eq_1037 Eq_1037struct Eq_1037 {	// size: 20 14
	word32 dw0000;	// 0
	word32 dw000C;	// C
	word32 dw0010;	// 10
	Eq_1037 t0014;	// 14
} Eq_1037;

typedef Eq_1046 Eq_1046struct Eq_1046 {	// size: 4 4
	word32 dw0000;	// 0
	Eq_1046 t0004;	// 4
} Eq_1046;

typedef Eq_1047 Eq_1047struct Eq_1047 {	// size: 4 4
	word32 dw0000;	// 0
	Eq_1047 t0004;	// 4
} Eq_1047;

typedef word32 (Eq_1049)(Eq_1051);

typedef union Eq_1051 {
	word32 u0;
	 LPCSTR u1;
} Eq_1051;

typedef  Eq_1110[]struct Eq_1110 {
	word32 dw0000;	// 0
	word32 dw0004;	// 4
	word16 a0008[];	// 8
} Eq_1110;

typedef word32 (Eq_1189)(word32, word32);

typedef Eq_18 Eq_1296Eq_18 Eq_1296Eq_18 Eq_1296struct Eq_1296 {
	Eq_18 tFFFFFFF8;	// FFFFFFF8
	Eq_18 tFFFFFFFC;	// FFFFFFFC
	Eq_18 t0000;	// 0
} Eq_1296;

typedef void (Eq_1343)(Eq_18);

typedef void (Eq_1361)(Eq_18, Eq_18);

typedef Eq_18 Eq_1394Eq_18 Eq_1394struct Eq_1394 {
	Eq_18 tFFFFFFEC;	// FFFFFFEC
	word32 dwFFFFFFF0;	// FFFFFFF0
	word32 dwFFFFFFF4;	// FFFFFFF4
	word32 dwFFFFFFF8;	// FFFFFFF8
	word32 dwFFFFFFFC;	// FFFFFFFC
	Eq_18 t0000;	// 0
} Eq_1394;

typedef Eq_18 Eq_1425Eq_18 Eq_1425struct Eq_1425 {
	Eq_18 tFFFFFFEC;	// FFFFFFEC
	word32 dwFFFFFFF0;	// FFFFFFF0
	word32 dwFFFFFFF4;	// FFFFFFF4
	word32 dwFFFFFFF8;	// FFFFFFF8
	word32 dwFFFFFFFC;	// FFFFFFFC
	Eq_18 t0000;	// 0
} Eq_1425;

typedef Eq_18 Eq_1461Eq_18 Eq_1461Eq_543 Eq_1461Eq_544 Eq_1461struct Eq_1461 {
	Eq_18 tFFFFFFF4;	// FFFFFFF4
	Eq_18 tFFFFFFF8;	// FFFFFFF8
	Eq_543 tFFFFFFFC;	// FFFFFFFC
	Eq_544 t0000;	// 0
} Eq_1461;

typedef Eq_18 Eq_1500Eq_18 Eq_1500Eq_543 Eq_1500Eq_544 Eq_1500struct Eq_1500 {
	Eq_18 tFFFFFFF4;	// FFFFFFF4
	Eq_18 tFFFFFFF8;	// FFFFFFF8
	Eq_543 tFFFFFFFC;	// FFFFFFFC
	Eq_544 t0000;	// 0
} Eq_1500;

typedef Eq_1540 Eq_1540struct Eq_1540 {
	Eq_1540 * ptr0000;	// 0
	word32 dw0018;	// 18
	word32 dw001C;	// 1C
} Eq_1540;

typedef Eq_1548 Eq_1545struct Eq_1545 {
	word32 dw0008;	// 8
	Eq_1548 * ptr000C;	// C
} Eq_1545;

typedef Eq_1540 Eq_1548struct Eq_1548 {
	Eq_1540 * ptr000C;	// C
} Eq_1548;

typedef word32 (Eq_1573)(Eq_1575, Eq_1576, Eq_1577);

typedef union Eq_1575 {
	word32 u0;
	 HANDLE u1;
} Eq_1575;

typedef union Eq_1576 {
	word32 u0;
	 DWORD u1;
} Eq_1576;

typedef union Eq_1577 {
	word32 u0;
	 SIZE_T u1;
} Eq_1577;

typedef Eq_1575 (Eq_1578)();

typedef Eq_18 Eq_1592struct Eq_1592 {
	Eq_18 t0050;	// 50
	word32 dw00A0;	// A0
	word32 dw00A4;	// A4
} Eq_1592;

typedef Eq_18 Eq_1614Eq_18 Eq_1614struct Eq_1614 {
	Eq_18 tFFFFFFD4;	// FFFFFFD4
	Eq_18 tFFFFFFD8;	// FFFFFFD8
} Eq_1614;

typedef  Eq_1636[]struct Eq_1636 {
	word32 dw0000;	// 0
	word32 dw0004;	// 4
	word16 a0008[];	// 8
} Eq_1636;

typedef word32 (Eq_1735)(word32, word32);

typedef Eq_1786 Eq_1786struct Eq_1786 {	// size: 1 1
	byte b0000;	// 0
	Eq_1786 t0001;	// 1
} Eq_1786;

typedef code Eq_1816Eq_18 Eq_1816Eq_18 Eq_1816struct Eq_1816 {
	code * ptr0028;	// 28
	Eq_18 t0034;	// 34
	word32 dw003C;	// 3C
	Eq_18 t0050;	// 50
	word32 dw0080;	// 80
	word32 dw00A0;	// A0
	word32 dw00A4;	// A4
} Eq_1816;

typedef DWORDLPVOIDBOOLstruct _SECURITY_ATTRIBUTES {
	DWORD;	// 0
	LPVOID;	// 4
	BOOL;	// 8
} Eq_1821;

