// subject.h
// Generated on TIMESTAMP by decompiling malware_via_email/malware_0586/ia32_pe/subject.exe
// using Decompiler version VERSION

/*
// Equivalence classes ////////////
Eq_1: (struct "Globals" (3000 Eq_616 t3000) (403034 word32 dw403034) (403038 word32 dw403038) (40303C word32 dw40303C) (403040 Eq_144 t403040) (403044 (ptr Eq_466) ptr403044) (403048 word32 dw403048) (40304C Eq_142 t40304C) (403050 word32 dw403050) (403054 (ptr Eq_616) ptr403054) (403058 (ptr Eq_501) ptr403058) (40305C (ptr code) ptr40305C) (403060 int32 dw403060))
	globals_t (in globals : (ptr (struct "Globals")))
Eq_43: (fn word32 (word32, word32))
	T_43 (in fn00401150 : ptr32)
	T_44 (in signature of fn00401150 : void)
	T_53 (in fn00401150 : ptr32)
Eq_93: (struct "Eq_93" 0001 (0 byte b0000) (1 Eq_93 t0001))
	T_93 (in dwArg08 : word32)
	T_108 (in dwArg08 + 0x00000001 : word32)
Eq_120: (fn word32 (Eq_122, Eq_123, Eq_124, Eq_125, Eq_126, Eq_127, Eq_128))
	T_120 (in CreateFileA : ptr32)
	T_121 (in signature of CreateFileA : void)
Eq_122: (union "Eq_122" (word32 u0) (LPCSTR u1))
	T_122 (in lpFileName : LPCSTR)
	T_129 (in dwArg04 : word32)
Eq_123: (union "Eq_123" (word32 u0) (DWORD u1))
	T_123 (in dwDesiredAccess : DWORD)
	T_130 (in 0x80000000 : word32)
Eq_124: (union "Eq_124" (word32 u0) (DWORD u1))
	T_124 (in dwShareMode : DWORD)
	T_131 (in 0x00000001 : word32)
Eq_125: (union "Eq_125" (word32 u0) (LPSECURITY_ATTRIBUTES u1))
	T_125 (in lpSecurityAttributes : LPSECURITY_ATTRIBUTES)

T_1386: (in HeapFree(GetProcessHeap(), 0x00000000, dwArg04) : word32)
  Class: Eq_1386
  DataType: word32
  OrigDataType: word32
T_1387: (in eax : word32)
  Class: Eq_1387
  DataType: word32
  OrigDataType: word32
T_1388: (in HeapAlloc : ptr32)
  Class: Eq_1388
  DataType: (ptr Eq_1388)
  OrigDataType: (ptr (fn T_1397 (T_1394, T_1395, T_1396)))
T_1389: (in signature of HeapAlloc : void)
  Class: Eq_1388
  DataType: (ptr Eq_1388)
  OrigDataType: 
T_1390: (in hHeap : HANDLE)
  Class: Eq_1378
  DataType: Eq_1378
  OrigDataType: HANDLE
T_1391: (in dwFlags : DWORD)
  Class: Eq_1391
  DataType: Eq_1391
  OrigDataType: DWORD
T_1392: (in dwBytes : SIZE_T)
  Class: Eq_1392
  DataType: Eq_1392
  OrigDataType: SIZE_T
T_1393: (in GetProcessHeap : ptr32)
  Class: Eq_1381
  DataType: (ptr Eq_1381)
  OrigDataType: (ptr (fn T_1394 ()))
T_1394: (in GetProcessHeap() : word32)
  Class: Eq_1378
  DataType: Eq_1378
  OrigDataType: word32
T_1395: (in 0x00000000 : word32)
  Class: Eq_1391
  DataType: word32
  OrigDataType: word32
T_1396: (in dwArg04 : word32)
  Class: Eq_1392
  DataType: Eq_1392
  OrigDataType: word32
T_1397: (in HeapAlloc(GetProcessHeap(), 0x00000000, dwArg04) : word32)
  Class: Eq_1397
  DataType: word32
  OrigDataType: word32
T_1398:
  Class: Eq_1398
  DataType: word16
  OrigDataType: (struct 0002 (0 T_675 t0000))
T_1399:
  Class: Eq_1398
  DataType: word16
  OrigDataType: (struct 0002 (0 T_689 t0000))
T_1400:
  Class: Eq_1398
  DataType: word16
  OrigDataType: (struct 0002 (0 T_704 t0000))
T_1401:
  Class: Eq_1401
  DataType: word16
  OrigDataType: (struct 0002 (0 T_967 t0000))
T_1402:
  Class: Eq_1401
  DataType: word16
  OrigDataType: (struct 0002 (0 T_979 t0000))
T_1403:
  Class: Eq_1401
  DataType: word16
  OrigDataType: (struct 0002 (0 T_992 t0000))
T_1404:
  Class: Eq_1404
  DataType: Eq_1404
  OrigDataType: 
T_1405:
  Class: Eq_1405
  DataType: Eq_1405
  OrigDataType: 
T_1406:
  Class: Eq_1406
  DataType: int32
  OrigDataType: 
T_1407:
  Class: Eq_1407
  DataType: Eq_1407
  OrigDataType: 
T_1408:
  Class: Eq_1408
  DataType: int32
  OrigDataType: 
T_1409:
  Class: Eq_1409
  DataType: int32
  OrigDataType: 
T_1410:
  Class: Eq_1410
  DataType: int32
  OrigDataType: 
T_1411:
  Class: Eq_1411
  DataType: int32
  OrigDataType: 
T_1412:
  Class: Eq_1412
  DataType: int32
  OrigDataType: 
T_1413:
  Class: Eq_1413
  DataType: int32
  OrigDataType: 
T_1414:
  Class: Eq_1414
  DataType: int32
  OrigDataType: 
T_1415:
  Class: Eq_1415
  DataType: int32
  OrigDataType: 
T_1416:
  Class: Eq_1416
  DataType: int32
  OrigDataType: 
T_1417:
  Class: Eq_1417
  DataType: Eq_1417
  OrigDataType: 
T_1418:
  Class: Eq_1418
  DataType: Eq_1418
  OrigDataType: 
T_1419:
  Class: Eq_1419
  DataType: Eq_1419
  OrigDataType: 
T_1420:
  Class: Eq_1420
  DataType: int32
  OrigDataType: 
T_1421:
  Class: Eq_1421
  DataType: Eq_1421
  OrigDataType: 
T_1422:
  Class: Eq_1422
  DataType: Eq_1422
  OrigDataType: 
*/
typedef Eq_616 Eq_1Eq_144 Eq_1Eq_466 Eq_1Eq_142 Eq_1Eq_616 Eq_1Eq_501 Eq_1code Eq_1struct Globals {
	Eq_616 t3000;	// 3000
	word32 dw403034;	// 403034
	word32 dw403038;	// 403038
	word32 dw40303C;	// 40303C
	Eq_144 t403040;	// 403040
	Eq_466 * ptr403044;	// 403044
	word32 dw403048;	// 403048
	Eq_142 t40304C;	// 40304C
	word32 dw403050;	// 403050
	Eq_616 * ptr403054;	// 403054
	Eq_501 * ptr403058;	// 403058
	code * ptr40305C;	// 40305C
	int32 dw403060;	// 403060
} Eq_1;

typedef word32 (Eq_43)(word32, word32);

typedef Eq_93 Eq_93struct Eq_93 {	// size: 1 1
	byte b0000;	// 0
	Eq_93 t0001;	// 1
} Eq_93;

typedef word32 (Eq_120)(Eq_122, Eq_123, Eq_124, Eq_125, Eq_126, Eq_127, Eq_128);

typedef union Eq_122 {
	word32 u0;
	 LPCSTR u1;
} Eq_122;

typedef union Eq_123 {
	word32 u0;
	 DWORD u1;
} Eq_123;

typedef union Eq_124 {
	word32 u0;
	 DWORD u1;
} Eq_124;

typedef union Eq_125 {
	word32 u0;
	 LPSECURITY_ATTRIBUTES u1;
} Eq_125;

typedef union Eq_126 {
	word32 u0;
	 DWORD u1;
} Eq_126;

typedef union Eq_127 {
	word32 u0;
	 DWORD u1;
} Eq_127;

typedef union Eq_128 {
	word32 u0;
	 HANDLE u1;
} Eq_128;

typedef Eq_144 (Eq_140)(Eq_142);

typedef union Eq_142 {
	Eq_1405* u0;
	void* u1;
	 DWORD u2;
	 HANDLE u3;
	 HINSTANCE u4;
	 LPCSTR u5;
	 LPSTR u6;
	 UINT u7;
} Eq_142;

typedef union Eq_144 {
	Eq_1407* u0;
	 DWORD u1;
	 HINSTANCE u2;
	 HMODULE u3;
	 LPCVOID u4;
	 LPVOID u5;
} Eq_144;

typedef word32 (Eq_145)(Eq_144, Eq_148);

typedef union Eq_148 {
	word32 u0;
	 LPCSTR u1;
} Eq_148;

typedef word32 (Eq_154)(Eq_156, Eq_157);

typedef union Eq_156 {
	word32 u0;
	 HINSTANCE u1;
} Eq_156;

typedef union Eq_157 {
	word32 u0;
	 LPCSTR u1;
} Eq_157;

typedef word32 (Eq_162)(WNDCLASSA *);

typedef WNDCLASSA;

typedef Eq_142 Eq_165Eq_142 Eq_165Eq_144 Eq_165Eq_144 Eq_165Eq_142 Eq_165struct Eq_165 {
	Eq_142 tFFFFFF70;	// FFFFFF70
	Eq_142 tFFFFFF74;	// FFFFFF74
	Eq_144 tFFFFFF78;	// FFFFFF78
	Eq_144 tFFFFFF7C;	// FFFFFF7C
	Eq_142 tFFFFFF80;	// FFFFFF80
} Eq_165;

typedef word32 (Eq_211)(Eq_213, Eq_214, Eq_215, Eq_216, int32, int32, int32, int32, Eq_221, Eq_222, Eq_142, Eq_224);

typedef union Eq_213 {
	word32 u0;
	 DWORD u1;
} Eq_213;

typedef union Eq_214 {
	word32 u0;
	 LPCSTR u1;
} Eq_214;

typedef union Eq_215 {
	word32 u0;
	 LPCSTR u1;
} Eq_215;

typedef union Eq_216 {
	word32 u0;
	 DWORD u1;
} Eq_216;

typedef union Eq_221 {
	word32 u0;
	 HWND u1;
} Eq_221;

typedef union Eq_222 {
	word32 u0;
	 HMENU u1;
} Eq_222;

typedef union Eq_224 {
	word32 u0;
	 LPVOID u1;
} Eq_224;

typedef Eq_278 Eq_248struct Eq_248 {
	word16 w0006;	// 6
	word16 w0014;	// 14
	Eq_278 t003C;	// 3C
} Eq_248;

typedef struct Eq_253 {
	word32 dw0010;	// 10
	word32 dw0014;	// 14
} Eq_253;

typedef union Eq_278 {
	int32 u0;
	uint32 u1;
} Eq_278;

typedef union Eq_280 {
	word32 u0;
	 LONG u1;
} Eq_280;

typedef union Eq_291 {
	int32 u0;
	uint32 u1;
} Eq_291;

typedef Eq_142 (Eq_305)(word32);

typedef word32 (Eq_319)(Eq_321, Eq_142, Eq_142);

typedef union Eq_321 {
	word32 u0;
	 HMODULE u1;
} Eq_321;

typedef Eq_142 (Eq_330)(word32);

typedef union Eq_337 {
	word32 u0;
	 DWORD u1;
} Eq_337;

typedef word32 (Eq_338)(Eq_142, Eq_341);

typedef union Eq_341 {
	word32 u0;
	 LPDWORD u1;
} Eq_341;

typedef word32 (Eq_361)(Eq_363, Eq_280, Eq_365, Eq_366);

typedef union Eq_363 {
	word32 u0;
	 HANDLE u1;
	 LPVOID u2;
} Eq_363;

typedef union Eq_365 {
	word32 u0;
	 PLONG u1;
} Eq_365;

typedef union Eq_366 {
	word32 u0;
	 DWORD u1;
} Eq_366;

typedef word32 (Eq_377)(Eq_379, Eq_363, Eq_337, Eq_382, Eq_383);

typedef union Eq_379 {
	word32 u0;
	 HANDLE u1;
} Eq_379;

typedef union Eq_382 {
	word32 u0;
	 LPDWORD u1;
} Eq_382;

typedef union Eq_383 {
	word32 u0;
	 LPOVERLAPPED u1;
} Eq_383;

typedef word32 (Eq_394)(Eq_396);

typedef union Eq_396 {
	word32 u0;
	 HANDLE u1;
} Eq_396;

typedef union Eq_401 {
	word32 u0;
	 HWND u1;
} Eq_401;

typedef Eq_401 (Eq_402)();

typedef union Eq_409 {
	byte u0;
	word32 u1;
} Eq_409;

typedef word32 (Eq_413)(Eq_401, Eq_142, int32);

typedef void (Eq_429)(word32);

typedef word32 (Eq_440)(Eq_142, void, Eq_444);

typedef union Eq_444 {
	word32 u0;
	 size_t u1;
} Eq_444;

typedef Eq_142 Eq_466struct Eq_466 {
	Eq_142 tFFFFFFF8;	// FFFFFFF8
} Eq_466;

typedef Eq_466 * (Eq_467)(word32 *, word32, Eq_142, Eq_409);

typedef Eq_501 Eq_499struct Eq_499 {
	Eq_501 * ptr0018;	// 18
} Eq_499;

typedef Eq_1339 Eq_501struct Eq_501 {
	Eq_1339 * ptr0030;	// 30
} Eq_501;

typedef void (Eq_508)(Eq_142);

typedef void (Eq_528)(word32);

typedef word32 (Eq_557)(word32);

typedef Eq_600 Eq_595struct Eq_595 {
	Eq_600 t0050;	// 50
	word32 dw00A0;	// A0
	word32 dw00A4;	// A4
} Eq_595;

typedef union Eq_600 {
	word32 u0;
	 SIZE_T u1;
} Eq_600;

typedef Eq_144 Eq_601Eq_600 Eq_601struct Eq_601 {
	Eq_144 tFFFFFFD0;	// FFFFFFD0
	Eq_600 tFFFFFFD4;	// FFFFFFD4
} Eq_601;

typedef Eq_616 * (Eq_605)(Eq_144, Eq_600, Eq_609, Eq_144);

typedef union Eq_609 {
	Eq_1421* u0;
	 DWORD u1;
} Eq_609;

typedef struct Eq_616 {
	word32 dw003C;	// 3C
} Eq_616;

typedef void (Eq_632)(Eq_616 *, Eq_616 *, Eq_144);

typedef  Eq_650[]struct Eq_650 {
	word32 dw0000;	// 0
	word32 dw0004;	// 4
	word16 a0008[];	// 8
} Eq_650;

typedef Eq_805 Eq_719Eq_600 Eq_719struct Eq_719 {
	word16 w0006;	// 6
	word16 w0014;	// 14
	Eq_805 t003C;	// 3C
	Eq_600 t0050;	// 50
} Eq_719;

typedef Eq_725 Eq_725struct Eq_725 {	// size: 40 28
	word32 dw000C;	// C
	word32 dw0010;	// 10
	word32 dw0014;	// 14
	Eq_725 t0028;	// 28
} Eq_725;

typedef Eq_899 Eq_756Eq_1083 Eq_756Eq_144 Eq_756Eq_144 Eq_756Eq_609 Eq_756Eq_144 Eq_756struct Eq_756 {
	Eq_899 tFFFFFFA0;	// FFFFFFA0
	Eq_1083 tFFFFFFA4;	// FFFFFFA4
	Eq_144 tFFFFFFA8;	// FFFFFFA8
	Eq_144 tFFFFFFAC;	// FFFFFFAC
	Eq_609 tFFFFFFB0;	// FFFFFFB0
	Eq_144 tFFFFFFB4;	// FFFFFFB4
	word32 dwFFFFFFF0;	// FFFFFFF0
} Eq_756;

typedef code Eq_775Eq_144 Eq_775Eq_144 Eq_775struct Eq_775 {
	code * ptr0028;	// 28
	Eq_144 t0034;	// 34
	Eq_144 t0050;	// 50
	word32 dw0080;	// 80
	word32 dw00A0;	// A0
	word32 dw00A4;	// A4
} Eq_775;

typedef Eq_780 Eq_780struct Eq_780 {	// size: 20 14
	word32 dw0000;	// 0
	word32 dw000C;	// C
	word32 dw0010;	// 10
	Eq_780 t0014;	// 14
} Eq_780;

typedef union Eq_805 {
	int32 u0;
	uint32 u1;
} Eq_805;

typedef union Eq_826 {
	int32 u0;
	uint32 u1;
} Eq_826;

typedef Eq_846 Eq_846struct Eq_846 {	// size: 4 4
	word32 dw0000;	// 0
	Eq_846 t0004;	// 4
} Eq_846;

typedef Eq_847 Eq_847struct Eq_847 {	// size: 4 4
	word32 dw0000;	// 0
	Eq_847 t0004;	// 4
} Eq_847;

typedef Eq_144 (Eq_859)(Eq_861);

typedef union Eq_861 {
	word32 u0;
	 LPCSTR u1;
} Eq_861;

typedef union Eq_899 {
	word32 u0;
	 HANDLE u1;
} Eq_899;

typedef Eq_899 (Eq_900)(Eq_902, Eq_903, Eq_904, Eq_905, Eq_144, Eq_907);

typedef union Eq_902 {
	word32 u0;
	 HANDLE u1;
} Eq_902;

typedef union Eq_903 {
	word32 u0;
	 LPSECURITY_ATTRIBUTES u1;
} Eq_903;

typedef union Eq_904 {
	word32 u0;
	 DWORD u1;
} Eq_904;

typedef union Eq_905 {
	word32 u0;
	 DWORD u1;
} Eq_905;

typedef union Eq_907 {
	word32 u0;
	 LPCSTR u1;
} Eq_907;

typedef  Eq_928[]struct Eq_928 {
	word32 dw0000;	// 0
	word32 dw0004;	// 4
	word16 a0008[];	// 8
} Eq_928;

typedef word32 (Eq_1007)(Eq_144, Eq_1010);

typedef union Eq_1010 {
	word32 u0;
	 LPCSTR u1;
} Eq_1010;

typedef union Eq_1083 {
	word32 u0;
	 DWORD u1;
} Eq_1083;

typedef Eq_616 * (Eq_1090)(Eq_899, Eq_1083, Eq_144, Eq_1095, Eq_1096, Eq_144);

typedef union Eq_1095 {
	word32 u0;
	 DWORD u1;
} Eq_1095;

typedef union Eq_1096 {
	word32 u0;
	 SIZE_T u1;
} Eq_1096;

typedef word32 (Eq_1150)(Eq_144);

typedef word32 (Eq_1174)(Eq_144, Eq_1096, Eq_1178);

typedef union Eq_1178 {
	word32 u0;
	 DWORD u1;
} Eq_1178;

typedef void (Eq_1185)(Eq_616 *);

typedef void (Eq_1191)(Eq_144, word32);

typedef Eq_1334 Eq_1334struct Eq_1334 {
	Eq_1334 * ptr0000;	// 0
	word32 dw0018;	// 18
	word32 dw001C;	// 1C
} Eq_1334;

typedef Eq_1342 Eq_1339struct Eq_1339 {
	word32 dw0008;	// 8
	Eq_1342 * ptr000C;	// C
} Eq_1339;

typedef Eq_1334 Eq_1342struct Eq_1342 {
	Eq_1334 * ptr000C;	// C
} Eq_1342;

typedef word32 (Eq_1376)(Eq_1378, Eq_1379, Eq_1380);

typedef union Eq_1378 {
	word32 u0;
	 HANDLE u1;
} Eq_1378;

typedef union Eq_1379 {
	word32 u0;
	 DWORD u1;
} Eq_1379;

typedef union Eq_1380 {
	word32 u0;
	 LPVOID u1;
} Eq_1380;

typedef Eq_1378 (Eq_1381)();

typedef word32 (Eq_1388)(Eq_1378, Eq_1391, Eq_1392);

typedef union Eq_1391 {
	word32 u0;
	 DWORD u1;
} Eq_1391;

typedef union Eq_1392 {
	word32 u0;
	 SIZE_T u1;
} Eq_1392;

typedef DWORDLPVOIDBOOLstruct _SECURITY_ATTRIBUTES {
	DWORD;	// 0
	LPVOID;	// 4
	BOOL;	// 8
} Eq_1404;

typedef Eq_409 Eq_1405struct Eq_1405 {
	Eq_409 t0000;	// 0
	word32 dw0004;	// 4
} Eq_1405;

typedef struct Eq_1407 {
	word32 dw003C;	// 3C
} Eq_1407;

typedef DWORDDWORDstruct struct_61 {
	DWORD;	// 0
	DWORD;	// 4
} Eq_1417;

typedef union Eq_1418 {
	 <anonymous> u0;
	 PVOID u1;
} Eq_1418;

typedef ULONG_PTRULONG_PTREq_1418 Eq_1419HANDLEstruct _OVERLAPPED {
	ULONG_PTR;	// 0
	ULONG_PTR;	// 4
	Eq_1418 t0008;	// 8
	HANDLE;	// 10
} Eq_1419;

typedef struct Eq_1421 {
	word32 dw003C;	// 3C
} Eq_1421;

typedef DWORDLPVOIDBOOLstruct _SECURITY_ATTRIBUTES {
	DWORD;	// 0
	LPVOID;	// 4
	BOOL;	// 8
} Eq_1422;

