// subject.h
// Generated on TIMESTAMP by decompiling malware_via_email/malware_0670/ia32_pe/subject.exe
// using Decompiler version VERSION

/*
// Equivalence classes ////////////
Eq_1: (struct "Globals" (40 Eq_95 t0040) (100 Eq_95 t0100))
	globals_t (in globals : (ptr (struct "Globals")))
Eq_31: (fn word32 (word32, word32, word32, word32, word32, (ptr Eq_38), word32, word32, word32, (ptr word32), (ptr word32), (ptr word32), (ptr word32)))
	T_31 (in fn004010D0 : ptr32)
	T_32 (in signature of fn004010D0 : void)
	T_64 (in fn004010D0 : ptr32)
Eq_38: (segment (0 (arr Eq_1273) a0000))
	T_38 (in fs : selector)
	T_49 (in fs : selector)
Eq_72: word16
	T_72 (in eax_21 : word32)
	T_75 (in DPB(dwArg00, 0x0000, 0, 16) : word32)
Eq_93: (struct (FFFFFECC (ptr Eq_95) ptrFFFFFECC) (FFFFFED0 (ptr Eq_95) ptrFFFFFED0) (FFFFFED4 word32 dwFFFFFED4) (FFFFFFC4 (ptr Eq_95) ptrFFFFFFC4) (FFFFFFC8 (ptr Eq_95) ptrFFFFFFC8) (FFFFFFCC (ptr Eq_95) ptrFFFFFFCC) (FFFFFFD0 (ptr Eq_95) ptrFFFFFFD0) (FFFFFFD4 (ptr Eq_95) ptrFFFFFFD4) (FFFFFFD8 (ptr Eq_100) ptrFFFFFFD8) (FFFFFFDC (ptr Eq_95) ptrFFFFFFDC) (FFFFFFE0 (ptr Eq_95) ptrFFFFFFE0) (FFFFFFE4 word32 dwFFFFFFE4) (FFFFFFE8 word32 dwFFFFFFE8) (FFFFFFEC (ptr Eq_95) ptrFFFFFFEC) (FFFFFFF0 word32 dwFFFFFFF0) (FFFFFFF4 word32 dwFFFFFFF4) (FFFFFFF8 (ptr Eq_95) ptrFFFFFFF8) (0 word32 dw0000) (14 (ptr Eq_100) ptr0014) (18 word32 dw0018))
	T_93 (in fp : ptr32)

T_1243: (in esp - 0x00000004 : word32)
  Class: Eq_784
  DataType: (ptr Eq_784)
  OrigDataType: word32
T_1244: (in 0x00000000 : word32)
  Class: Eq_1244
  DataType: word32
  OrigDataType: word32
T_1245: (in esp + 0x00000000 : word32)
  Class: Eq_1245
  DataType: word32
  OrigDataType: word32
T_1246: (in Mem0[esp + 0x00000000:word32] : word32)
  Class: Eq_778
  DataType: Eq_778
  OrigDataType: word32
T_1247: (in 0x00000000 : word32)
  Class: Eq_1247
  DataType: word32
  OrigDataType: word32
T_1248: (in esp + 0x00000000 : word32)
  Class: Eq_1248
  DataType: word32
  OrigDataType: word32
T_1249: (in Mem0[esp + 0x00000000:word32] : word32)
  Class: Eq_778
  DataType: Eq_778
  OrigDataType: word32
T_1250: (in 0x00000004 : word32)
  Class: Eq_1250
  DataType: word32
  OrigDataType: word32
T_1251: (in esp + 0x00000004 : word32)
  Class: Eq_784
  DataType: (ptr Eq_784)
  OrigDataType: word32
T_1252: (in 0x00000004 : word32)
  Class: Eq_1252
  DataType: word32
  OrigDataType: word32
T_1253: (in eax + 0x00000004 : word32)
  Class: Eq_778
  DataType: Eq_778
  OrigDataType: word32
T_1254: (in cond(eax) : byte)
  Class: Eq_788
  DataType: bool
  OrigDataType: byte
T_1255: (in 0x00000004 : word32)
  Class: Eq_1255
  DataType: word32
  OrigDataType: word32
T_1256: (in esp - 0x00000004 : word32)
  Class: Eq_784
  DataType: (ptr Eq_784)
  OrigDataType: word32
T_1257: (in 0x00000000 : word32)
  Class: Eq_1257
  DataType: word32
  OrigDataType: word32
T_1258: (in esp + 0x00000000 : word32)
  Class: Eq_1258
  DataType: word32
  OrigDataType: word32
T_1259: (in Mem0[esp + 0x00000000:word32] : word32)
  Class: Eq_778
  DataType: Eq_778
  OrigDataType: word32
T_1260: (in 0x00000000 : word32)
  Class: Eq_1260
  DataType: word32
  OrigDataType: word32
T_1261: (in esp + 0x00000000 : word32)
  Class: Eq_1261
  DataType: word32
  OrigDataType: word32
T_1262: (in Mem0[esp + 0x00000000:word32] : word32)
  Class: Eq_778
  DataType: Eq_778
  OrigDataType: word32
T_1263: (in (word16) eax : word16)
  Class: Eq_778
  DataType: Eq_778
  OrigDataType: word16
T_1264: (in SLICE(eax, byte, 8) : byte)
  Class: Eq_818
  DataType: byte
  OrigDataType: byte
T_1265: (in (byte) eax : byte)
  Class: Eq_820
  DataType: byte
  OrigDataType: byte
T_1266: (in 0x00000004 : word32)
  Class: Eq_1266
  DataType: word32
  OrigDataType: word32
T_1267: (in esp + 0x00000004 : word32)
  Class: Eq_784
  DataType: (ptr Eq_784)
  OrigDataType: word32
T_1268: (in (byte) ebx : byte)
  Class: Eq_778
  DataType: Eq_778
  OrigDataType: byte
T_1269: (in SLICE(ebx, byte, 8) : byte)
  Class: Eq_805
  DataType: byte
  OrigDataType: byte
T_1270: (in 0x00000008 : word32)
  Class: Eq_1270
  DataType: word32
  OrigDataType: word32
T_1271: (in esp + 0x00000008 : word32)
  Class: Eq_784
  DataType: (ptr Eq_784)
  OrigDataType: word32
T_1272: (in cond(esp) : byte)
  Class: Eq_788
  DataType: bool
  OrigDataType: byte
T_1273:
  Class: Eq_1273
  DataType: Eq_1273
  OrigDataType: (struct 0008 (0 T_148 t0000))
*/
typedef  Eq_1 Eq_1struct Globals {
	 t0040;	// 40
	 t0100;	// 100
} Eq_1;

typedef word32 (Eq_31)(word32, word32, word32, word32, word32,  *, word32, word32, word32, word32 *, word32 *, word32 *, word32 *);

typedef  Eq_38[]struct  {
	 a0000[];	// 0
} Eq_38;

typedef word16 Eq_72;

typedef  Eq_93 Eq_93 Eq_93 Eq_93 Eq_93 Eq_93 Eq_93 Eq_93 Eq_93 Eq_93 Eq_93 Eq_93 Eq_93struct  {
	 * ptrFFFFFECC;	// FFFFFECC
	 * ptrFFFFFED0;	// FFFFFED0
	word32 dwFFFFFED4;	// FFFFFED4
	 * ptrFFFFFFC4;	// FFFFFFC4
	 * ptrFFFFFFC8;	// FFFFFFC8
	 * ptrFFFFFFCC;	// FFFFFFCC
	 * ptrFFFFFFD0;	// FFFFFFD0
	 * ptrFFFFFFD4;	// FFFFFFD4
	 * ptrFFFFFFD8;	// FFFFFFD8
	 * ptrFFFFFFDC;	// FFFFFFDC
	 * ptrFFFFFFE0;	// FFFFFFE0
	word32 dwFFFFFFE4;	// FFFFFFE4
	word32 dwFFFFFFE8;	// FFFFFFE8
	 * ptrFFFFFFEC;	// FFFFFFEC
	word32 dwFFFFFFF0;	// FFFFFFF0
	word32 dwFFFFFFF4;	// FFFFFFF4
	 * ptrFFFFFFF8;	// FFFFFFF8
	word32 dw0000;	// 0
	 * ptr0014;	// 14
	word32 dw0018;	// 18
} Eq_93;

typedef  Eq_95union  {
	byte u0;
	word16 u1;
	word32 u2;
} Eq_95union  {
	Eq_95 u0;
	Eq_627 u1;
} Eq_95union  {
	word32 u0;
	Eq_95 u1;
} Eq_95code Eq_95code Eq_95struct  {
	 * ptrFFFFFFFC;	// FFFFFFFC
	union  {
		byte u0;
		word16 u1;
		word32 u2;
	} u0000;	// 0
	union  {
		Eq_95 u0;
		Eq_627 u1;
	} u0001;	// 1
	union  {
		word32 u0;
		Eq_95 u1;
	} u0003;	// 3
	code * ptr0010;	// 10
	code * ptr0018;	// 18
} Eq_95;

typedef code Eq_100code Eq_100code Eq_100code Eq_100struct  {
	code * ptr0000;	// 0
	code * ptr0010;	// 10
	code * ptr0018;	// 18
	code * ptr001C;	// 1C
} Eq_100;

typedef word32 (Eq_105)(word32, word32, word32 *, word32 *, word32 *, word32 *, word32 *);

typedef struct  {
	word32 dw002F;	// 2F
} Eq_217;

typedef union  {
	byte u0;
	word16 u1;
	word32 u2;
} Eq_267;

typedef  Eq_344 Eq_344 Eq_344struct  {
	 * ptr0000;	// 0
	 * ptr0004;	// 4
	 t0140;	// 140
} Eq_344;

typedef byte Eq_356;

typedef  Eq_422 Eq_422 Eq_422 Eq_422struct  {
	 * ptrFFFFFFF0;	// FFFFFFF0
	 * ptrFFFFFFF4;	// FFFFFFF4
	 * ptrFFFFFFF8;	// FFFFFFF8
	 * ptrFFFFFFFC;	// FFFFFFFC
	word32 dw0000;	// 0
	up32 dw011C;	// 11C
} Eq_422;

typedef  Eq_567byte Eq_567struct  {
	 * ptr0000;	// 0
	byte * ptr0018;	// 18
} Eq_567;

typedef byte Eq_582;

typedef  Eq_585byte Eq_585struct  {
	 * ptr0000;	// 0
	byte t001C;	// 1C
} Eq_585;

typedef byte Eq_596;

typedef byte Eq_627;

typedef byte Eq_671;

typedef byte Eq_680;

typedef word32 (Eq_723)(word32, word32, word32, word32, word32, word32, word32, word32, word32, word32, word32 *, word32 *, word32 *, word32 *, word32 *);

typedef union  {
	byte u0;
	word16 u1;
	struct <anonymous>* u2;
} Eq_778;

typedef  Eq_783struct  {
	word16 wFFFFFFFF;	// FFFFFFFF
	 t0001;	// 1
} Eq_783;

typedef  Eq_784 Eq_784 Eq_784 Eq_784 Eq_784 Eq_784 Eq_784 Eq_784 Eq_784 Eq_784 Eq_784 Eq_784 Eq_784 Eq_784 Eq_784 Eq_784 Eq_784 Eq_784struct  {
	 t0000;	// 0
	 t0002;	// 2
	 t0004;	// 4
	 t0004;	// 4
	 t0004;	// 4
	 t0004;	// 4
	 t0004;	// 4
	 t0008;	// 8
	 t000C;	// C
	 t0010;	// 10
	 t0018;	// 18
	 t0018;	// 18
	 t0118;	// 118
	 t011C;	// 11C
	 t0120;	// 120
	 t0140;	// 140
	 t0144;	// 144
	 t0148;	// 148
} Eq_784;

typedef  Eq_848struct  {
	 t0000;	// 0
} Eq_848;

typedef struct  {
	byte b0000;	// 0
} Eq_923;

typedef struct  {
	byte b0000;	// 0
} Eq_928;

typedef  Eq_962struct  {
	 t0000;	// 0
} Eq_962;

typedef struct  {	// size: 8 8
	word16 w0000;	// 0
} Eq_1273;

