// subject.h
// Generated on TIMESTAMP by decompiling from_pouet.net/with_source_244/ia32_com/subject.exe
// using Decompiler version VERSION

/*
// Equivalence classes ////////////
Eq_1: (struct "Globals" (FFFA0000 (ptr Eq_194) ptrFFFA0000))
	globals_t (in globals : (ptr (struct "Globals")))
Eq_2: (fn void (byte))
	T_2 (in bios_video_set_mode : ptr32)
	T_3 (in signature of bios_video_set_mode : void)
	T_261 (in bios_video_set_mode : ptr32)
Eq_14: (fn void (word16, uint8))
	T_14 (in __outb : ptr32)
Eq_17: (union "Eq_17" (uint8 u0) (uint16 u1))
	T_17 (in al_17 : Eq_17)
	T_19 (in cl_13 >>u 0x01 : word16)
Eq_20: (fn void (word16, Eq_17))
	T_20 (in __outb : ptr32)
Eq_29: (fn void (word16, ui8))
	T_29 (in __outb : ptr32)
Eq_32: (union "Eq_32" (byte u0) (word16 u1))
	T_32 (in al_24 : Eq_32)
	T_38 (in al_20 * 0x02 + (ax_18 >>u 0x0007 <u 0x0000) : word16)
Eq_39: (fn void (word16, Eq_32))
	T_39 (in __outb : ptr32)
Eq_52: (segment "Eq_52" (FFFFF9E0 word16 wFFFFF9E0) (0 byte b0000) (13E word16 w013E) (13F byte b013F) (15F word16 w015F) (160 int8 b0160) (17C word16 w017C) (18D int8 b018D) (18E int8 b018E) (1EC word16 w01EC) (1FE word16 w01FE) (F9E0 word16 wF9E0))
	T_52 (in ds : (ptr Eq_52))
	T_222 (in ds : (ptr Eq_52))
Eq_72: (union "Eq_72" (uint8 u0) (uint16 u1))
	T_72 (in cl_119 : Eq_72)
	T_73 (in 0x0C : byte)
	T_118 (in cl_191 >>u 0x01 : word16)
	T_130 (in (byte) cx_148 : byte)
Eq_82: (struct "Eq_82" 000A (0 byte b0000))
	T_82 (in 0x0000 : word16)

  Class: Eq_247
  DataType: byte
  OrigDataType: byte
T_251: (in 0x018D : word16)
  Class: Eq_251
  DataType: word16
  OrigDataType: word16
T_252: (in bx : word16)
  Class: Eq_251
  DataType: word16
  OrigDataType: word16
T_253: (in 0x01 : byte)
  Class: Eq_253
  DataType: byte
  OrigDataType: byte
T_254: (in al_305 - 0x01 : byte)
  Class: Eq_254
  DataType: byte
  OrigDataType: byte
T_255: (in DPB(ax_297, al_305 - 0x01, 0, 8) : word16)
  Class: Eq_44
  DataType: word16
  OrigDataType: word16
T_256: (in 0x01 : byte)
  Class: Eq_247
  DataType: byte
  OrigDataType: byte
T_257: (in al_305 != 0x01 : bool)
  Class: Eq_257
  DataType: bool
  OrigDataType: bool
T_258: (in 0x01FE : word16)
  Class: Eq_126
  DataType: (memptr (ptr Eq_52) word16)
  OrigDataType: word16
T_259: (in 0x03 : byte)
  Class: Eq_259
  DataType: byte
  OrigDataType: byte
T_260: (in DPB(bx, 0x03, 8, 8) : word16)
  Class: Eq_53
  DataType: (memptr (ptr Eq_52) byte)
  OrigDataType: word16
T_261: (in bios_video_set_mode : ptr32)
  Class: Eq_2
  DataType: (ptr Eq_2)
  OrigDataType: (ptr (fn T_263 (T_262)))
T_262: (in 0x03 : byte)
  Class: Eq_4
  DataType: byte
  OrigDataType: byte
T_263: (in bios_video_set_mode(0x03) : void)
  Class: Eq_6
  DataType: void
  OrigDataType: void
T_264: (in fn0C00_01E7 : ptr32)
  Class: Eq_217
  DataType: (ptr Eq_217)
  OrigDataType: (ptr (fn T_268 (T_265, T_266, T_267, T_52)))
T_265: (in 0x018D : word16)
  Class: Eq_219
  DataType: (memptr (ptr Eq_52) int8)
  OrigDataType: word16
T_266: (in 0x05 : byte)
  Class: Eq_220
  DataType: uint8
  OrigDataType: byte
T_267: (in 0x00 : byte)
  Class: Eq_221
  DataType: byte
  OrigDataType: byte
T_268: (in fn0C00_01E7(&Eq_52::b018D, 0x05, 0x00, ds) : byte)
  Class: Eq_227
  DataType: byte
  OrigDataType: byte
T_269: (in al : byte)
  Class: Eq_269
  DataType: byte
  OrigDataType: byte
T_270: (in 0x0000 : word16)
  Class: Eq_270
  DataType: word16
  OrigDataType: word16
T_271: (in bx + 0x0000 : word16)
  Class: Eq_271
  DataType: word16
  OrigDataType: word16
T_272: (in Mem0[ds:bx + 0x0000:byte] : byte)
  Class: Eq_272
  DataType: int8
  OrigDataType: byte
T_273: (in ds->*bx + ah : byte)
  Class: Eq_272
  DataType: int8
  OrigDataType: byte
T_274: (in 0x0000 : word16)
  Class: Eq_274
  DataType: word16
  OrigDataType: word16
T_275: (in bx + 0x0000 : word16)
  Class: Eq_275
  DataType: word16
  OrigDataType: word16
T_276: (in Mem7[ds:bx + 0x0000:byte] : byte)
  Class: Eq_272
  DataType: int8
  OrigDataType: byte
T_277: (in 0x0000 : word16)
  Class: Eq_277
  DataType: word16
  OrigDataType: word16
T_278: (in bx + 0x0000 : word16)
  Class: Eq_278
  DataType: word16
  OrigDataType: word16
T_279: (in Mem7[ds:bx + 0x0000:byte] : byte)
  Class: Eq_272
  DataType: int8
  OrigDataType: int8
T_280: (in ds->*bx >> cl : word16)
  Class: Eq_280
  DataType: int16
  OrigDataType: int16
*/
typedef Eq_194 Eq_1struct Globals {
	Eq_194 * ptrFFFA0000;	// FFFA0000
} Eq_1;

typedef void (Eq_2)(byte);

typedef void (Eq_14)(word16, uint8);

typedef union Eq_17 {
	uint8 u0;
	uint16 u1;
} Eq_17;

typedef void (Eq_20)(word16, Eq_17);

typedef void (Eq_29)(word16, ui8);

typedef union Eq_32 {
	byte u0;
	word16 u1;
} Eq_32;

typedef void (Eq_39)(word16, Eq_32);

typedef struct Eq_52 {
	word16 wFFFFF9E0;	// FFFFF9E0
	byte b0000;	// 0
	word16 w013E;	// 13E
	byte b013F;	// 13F
	word16 w015F;	// 15F
	int8 b0160;	// 160
	word16 w017C;	// 17C
	int8 b018D;	// 18D
	int8 b018E;	// 18E
	word16 w01EC;	// 1EC
	word16 w01FE;	// 1FE
	word16 wF9E0;	// F9E0
} Eq_52;

typedef union Eq_72 {
	uint8 u0;
	uint16 u1;
} Eq_72;

typedef struct Eq_82 {	// size: 10 A
	byte b0000;	// 0
} Eq_82;

typedef union Eq_85 {
	int8 u0;
	int16 u1;
	uint16 u2;
} Eq_85;

typedef uint8 (Eq_102)(Eq_72, byte);

typedef union Eq_105 {
	int32 u0;
	uint32 u1;
} Eq_105;

typedef union Eq_113 {
	int16 u0;
	uint16 u1;
} Eq_113;

typedef uint8 (Eq_144)(uint8, byte);

typedef union Eq_145 {
	int32 u0;
	uint32 u1;
} Eq_145;

typedef union Eq_149 {
	int16 u0;
	uint16 u1;
} Eq_149;

typedef byte (Eq_176)(word16);

typedef union Eq_183 {
	cups16 u0;
	word16 Eq_194::* u1;
} Eq_183;

typedef struct Eq_194 {
} Eq_194;

typedef byte (Eq_217)(int8 Eq_52::*, uint8, Eq_221, Eq_52 *);

typedef union Eq_221 {
	int16 u0;
	byte u1;
} Eq_221;

typedef byte (Eq_248)(byte);

