// subject.h
// Generated on TIMESTAMP by decompiling malware_via_email/malware_1265/ia32_pe/subject.exe
// using Decompiler version VERSION

/*
// Equivalence classes ////////////
Eq_1: (struct "Globals" (403010 word32 dw403010) (403014 int32 dw403014) (403018 word32 dw403018) (40301C Eq_209 t40301C) (403020 (ptr Eq_521) ptr403020) (403024 word32 dw403024) (403028 Eq_207 t403028) (40302C word32 dw40302C) (403030 int32 dw403030) (403034 int32 dw403034) (403038 Eq_207 t403038) (40303C (ptr Eq_545) ptr40303C) (403040 (ptr code) ptr403040) (403044 int32 dw403044))
	globals_t (in globals : (ptr (struct "Globals")))
Eq_43: (fn word32 (word32, word32))
	T_43 (in fn004011B0 : ptr32)
	T_44 (in signature of fn004011B0 : void)
	T_53 (in fn004011B0 : ptr32)
Eq_93: (struct "Eq_93" 0001 (0 byte b0000) (1 Eq_93 t0001))
	T_93 (in dwArg08 : word32)
	T_108 (in dwArg08 + 0x00000001 : word32)
Eq_120: (fn word32 (Eq_122, Eq_123, Eq_124, Eq_125, Eq_126, Eq_127, Eq_128))
	T_120 (in CreateFileA : ptr32)
	T_121 (in signature of CreateFileA : void)
Eq_122: (union "Eq_122" (word32 u0) (LPCSTR u1))
	T_122 (in lpFileName : LPCSTR)
	T_129 (in dwArg04 : word32)
Eq_123: (union "Eq_123" (word32 u0) (DWORD u1))
	T_123 (in dwDesiredAccess : DWORD)
	T_130 (in 0x80000000 : word32)
Eq_124: (union "Eq_124" (word32 u0) (DWORD u1))
	T_124 (in dwShareMode : DWORD)
	T_131 (in 0x00000001 : word32)
Eq_125: (union "Eq_125" (word32 u0) (LPSECURITY_ATTRIBUTES u1))
	T_125 (in lpSecurityAttributes : LPSECURITY_ATTRIBUTES)

T_1513: (in signature of HeapAlloc : void)
  Class: Eq_1512
  DataType: (ptr Eq_1512)
  OrigDataType: 
T_1514: (in hHeap : HANDLE)
  Class: Eq_1502
  DataType: Eq_1502
  OrigDataType: HANDLE
T_1515: (in dwFlags : DWORD)
  Class: Eq_1515
  DataType: Eq_1515
  OrigDataType: DWORD
T_1516: (in dwBytes : SIZE_T)
  Class: Eq_1516
  DataType: Eq_1516
  OrigDataType: SIZE_T
T_1517: (in GetProcessHeap : ptr32)
  Class: Eq_1505
  DataType: (ptr Eq_1505)
  OrigDataType: (ptr (fn T_1518 ()))
T_1518: (in GetProcessHeap() : word32)
  Class: Eq_1502
  DataType: Eq_1502
  OrigDataType: word32
T_1519: (in 0x00000000 : word32)
  Class: Eq_1515
  DataType: word32
  OrigDataType: word32
T_1520: (in dwArg04 : word32)
  Class: Eq_1516
  DataType: Eq_1516
  OrigDataType: word32
T_1521: (in HeapAlloc(GetProcessHeap(), 0x00000000, dwArg04) : word32)
  Class: Eq_1521
  DataType: word32
  OrigDataType: word32
T_1522:
  Class: Eq_1522
  DataType: word16
  OrigDataType: (struct 0002 (0 T_799 t0000))
T_1523:
  Class: Eq_1522
  DataType: word16
  OrigDataType: (struct 0002 (0 T_813 t0000))
T_1524:
  Class: Eq_1522
  DataType: word16
  OrigDataType: (struct 0002 (0 T_828 t0000))
T_1525:
  Class: Eq_1525
  DataType: word16
  OrigDataType: (struct 0002 (0 T_1091 t0000))
T_1526:
  Class: Eq_1525
  DataType: word16
  OrigDataType: (struct 0002 (0 T_1103 t0000))
T_1527:
  Class: Eq_1525
  DataType: word16
  OrigDataType: (struct 0002 (0 T_1116 t0000))
T_1528:
  Class: Eq_1528
  DataType: Eq_1528
  OrigDataType: 
T_1529:
  Class: Eq_1529
  DataType: Eq_1529
  OrigDataType: 
T_1530:
  Class: Eq_1530
  DataType: Eq_1530
  OrigDataType: 
T_1531:
  Class: Eq_1531
  DataType: int32
  OrigDataType: 
T_1532:
  Class: Eq_1532
  DataType: int32
  OrigDataType: 
T_1533:
  Class: Eq_1533
  DataType: int32
  OrigDataType: 
T_1534:
  Class: Eq_1534
  DataType: int32
  OrigDataType: 
T_1535:
  Class: Eq_1535
  DataType: int32
  OrigDataType: 
T_1536:
  Class: Eq_1536
  DataType: Eq_1536
  OrigDataType: 
T_1537:
  Class: Eq_1537
  DataType: Eq_1537
  OrigDataType: 
T_1538:
  Class: Eq_1538
  DataType: Eq_1538
  OrigDataType: 
T_1539:
  Class: Eq_1539
  DataType: Eq_1539
  OrigDataType: 
T_1540:
  Class: Eq_1540
  DataType: Eq_1540
  OrigDataType: 
T_1541:
  Class: Eq_1541
  DataType: Eq_1541
  OrigDataType: 
*/
typedef Eq_209 Eq_1Eq_521 Eq_1Eq_207 Eq_1Eq_207 Eq_1Eq_545 Eq_1code Eq_1struct Globals {
	word32 dw403010;	// 403010
	int32 dw403014;	// 403014
	word32 dw403018;	// 403018
	Eq_209 t40301C;	// 40301C
	Eq_521 * ptr403020;	// 403020
	word32 dw403024;	// 403024
	Eq_207 t403028;	// 403028
	word32 dw40302C;	// 40302C
	int32 dw403030;	// 403030
	int32 dw403034;	// 403034
	Eq_207 t403038;	// 403038
	Eq_545 * ptr40303C;	// 40303C
	code * ptr403040;	// 403040
	int32 dw403044;	// 403044
} Eq_1;

typedef word32 (Eq_43)(word32, word32);

typedef Eq_93 Eq_93struct Eq_93 {	// size: 1 1
	byte b0000;	// 0
	Eq_93 t0001;	// 1
} Eq_93;

typedef word32 (Eq_120)(Eq_122, Eq_123, Eq_124, Eq_125, Eq_126, Eq_127, Eq_128);

typedef union Eq_122 {
	word32 u0;
	 LPCSTR u1;
} Eq_122;

typedef union Eq_123 {
	word32 u0;
	 DWORD u1;
} Eq_123;

typedef union Eq_124 {
	word32 u0;
	 DWORD u1;
} Eq_124;

typedef union Eq_125 {
	word32 u0;
	 LPSECURITY_ATTRIBUTES u1;
} Eq_125;

typedef union Eq_126 {
	word32 u0;
	 DWORD u1;
} Eq_126;

typedef union Eq_127 {
	word32 u0;
	 DWORD u1;
} Eq_127;

typedef union Eq_128 {
	word32 u0;
	 HANDLE u1;
} Eq_128;

typedef Eq_209 (Eq_205)(Eq_207);

typedef union Eq_207 {
	Eq_1529* u0;
	 HANDLE u1;
	 LPCSTR u2;
	 LPVOID u3;
	 UINT u4;
} Eq_207;

typedef union Eq_209 {
	Eq_1530* u0;
	 DWORD u1;
	 HMODULE u2;
	 LPCVOID u3;
	 LPVOID u4;
} Eq_209;

typedef word32 (Eq_256)(WNDCLASSA *);

typedef WNDCLASSA;

typedef Eq_207 Eq_259Eq_207 Eq_259WNDCLASSA Eq_259struct Eq_259 {
	Eq_207 tFFFFFF28;	// FFFFFF28
	Eq_207 tFFFFFF2C;	// FFFFFF2C
	WNDCLASSA tFFFFFF44;	// FFFFFF44
} Eq_259;

typedef Eq_365 Eq_306struct Eq_306 {
	word16 w0006;	// 6
	word16 w0014;	// 14
	Eq_365 t003C;	// 3C
} Eq_306;

typedef void (Eq_315)(word32, byte, word32);

typedef void (Eq_325)(Eq_327);

typedef union Eq_327 {
	word32 u0;
	 LPSTARTUPINFOA u1;
} Eq_327;

typedef struct Eq_340 {
	word32 dw0010;	// 10
	word32 dw0014;	// 14
} Eq_340;

typedef union Eq_365 {
	int32 u0;
	uint32 u1;
} Eq_365;

typedef union Eq_367 {
	word32 u0;
	 LONG u1;
} Eq_367;

typedef union Eq_378 {
	int32 u0;
	uint32 u1;
} Eq_378;

typedef Eq_207 (Eq_388)(word32);

typedef word32 (Eq_402)(Eq_209, Eq_405, Eq_406);

typedef union Eq_405 {
	word32 u0;
	 LPSTR u1;
} Eq_405;

typedef union Eq_406 {
	word32 u0;
	 DWORD u1;
} Eq_406;

typedef Eq_207 (Eq_414)(word32);

typedef union Eq_421 {
	word32 u0;
	 DWORD u1;
} Eq_421;

typedef word32 (Eq_422)(Eq_207, Eq_425);

typedef union Eq_425 {
	word32 u0;
	 LPDWORD u1;
} Eq_425;

typedef word32 (Eq_442)(Eq_207, Eq_367, Eq_446, Eq_447);

typedef union Eq_446 {
	word32 u0;
	 PLONG u1;
} Eq_446;

typedef union Eq_447 {
	word32 u0;
	 DWORD u1;
} Eq_447;

typedef word32 (Eq_451)(Eq_207, Eq_207, Eq_421, Eq_456, Eq_457);

typedef union Eq_456 {
	word32 u0;
	 LPDWORD u1;
} Eq_456;

typedef union Eq_457 {
	word32 u0;
	 LPOVERLAPPED u1;
} Eq_457;

typedef word32 (Eq_469)(Eq_471);

typedef union Eq_471 {
	word32 u0;
	 HANDLE u1;
} Eq_471;

typedef void (Eq_475)(Eq_207, Eq_207, Eq_209);

typedef struct Eq_508 {
	word32 dw0008;	// 8
} Eq_508;

typedef struct Eq_514 {
	word32 dw0008;	// 8
} Eq_514;

typedef Eq_207 Eq_521struct Eq_521 {
	ui32 dwFFFFFFE0;	// FFFFFFE0
	int32 dwFFFFFFEC;	// FFFFFFEC
	word32 dwFFFFFFF0;	// FFFFFFF0
	Eq_207 tFFFFFFF4;	// FFFFFFF4
	int32 dwFFFFFFF8;	// FFFFFFF8
} Eq_521;

typedef Eq_521 * (Eq_522)(word32 *, word32, Eq_207, up32);

typedef Eq_545 Eq_543struct Eq_543 {
	Eq_545 * ptr0018;	// 18
} Eq_543;

typedef Eq_1463 Eq_545struct Eq_545 {
	Eq_1463 * ptr0030;	// 30
} Eq_545;

typedef void (Eq_563)(Eq_207);

typedef void (Eq_583)(word32);

typedef word32 (Eq_611)(word32);

typedef void (Eq_696)(word32);

typedef Eq_728 Eq_723struct Eq_723 {
	Eq_728 t0050;	// 50
	word32 dw00A0;	// A0
	word32 dw00A4;	// A4
} Eq_723;

typedef union Eq_728 {
	word32 u0;
	 SIZE_T u1;
} Eq_728;

typedef Eq_209 Eq_729Eq_728 Eq_729struct Eq_729 {
	Eq_209 tFFFFFFBC;	// FFFFFFBC
	Eq_728 tFFFFFFC0;	// FFFFFFC0
} Eq_729;

typedef Eq_207 (Eq_733)(Eq_209, Eq_728, Eq_737, Eq_209);

typedef union Eq_737 {
	Eq_1540* u0;
	 DWORD u1;
} Eq_737;

typedef  Eq_774[]struct Eq_774 {
	word32 dw0000;	// 0
	word32 dw0004;	// 4
	word16 a0008[];	// 8
} Eq_774;

typedef Eq_929 Eq_843Eq_728 Eq_843struct Eq_843 {
	word16 w0006;	// 6
	word16 w0014;	// 14
	Eq_929 t003C;	// 3C
	Eq_728 t0050;	// 50
} Eq_843;

typedef Eq_849 Eq_849struct Eq_849 {	// size: 40 28
	word32 dw000C;	// C
	word32 dw0010;	// 10
	word32 dw0014;	// 14
	Eq_849 t0028;	// 28
} Eq_849;

typedef Eq_1023 Eq_880Eq_1207 Eq_880Eq_209 Eq_880Eq_209 Eq_880Eq_737 Eq_880Eq_209 Eq_880struct Eq_880 {
	Eq_1023 tFFFFFF8C;	// FFFFFF8C
	Eq_1207 tFFFFFF90;	// FFFFFF90
	Eq_209 tFFFFFF94;	// FFFFFF94
	Eq_209 tFFFFFF98;	// FFFFFF98
	Eq_737 tFFFFFF9C;	// FFFFFF9C
	Eq_209 tFFFFFFA0;	// FFFFFFA0
	word32 dwFFFFFFEC;	// FFFFFFEC
} Eq_880;

typedef code Eq_899Eq_209 Eq_899Eq_209 Eq_899struct Eq_899 {
	code * ptr0028;	// 28
	Eq_209 t0034;	// 34
	Eq_209 t0050;	// 50
	word32 dw0080;	// 80
	word32 dw00A0;	// A0
	word32 dw00A4;	// A4
} Eq_899;

typedef Eq_904 Eq_904struct Eq_904 {	// size: 20 14
	word32 dw0000;	// 0
	word32 dw000C;	// C
	word32 dw0010;	// 10
	Eq_904 t0014;	// 14
} Eq_904;

typedef union Eq_929 {
	int32 u0;
	uint32 u1;
} Eq_929;

typedef union Eq_950 {
	int32 u0;
	uint32 u1;
} Eq_950;

typedef Eq_970 Eq_970struct Eq_970 {	// size: 4 4
	word32 dw0000;	// 0
	Eq_970 t0004;	// 4
} Eq_970;

typedef Eq_971 Eq_971struct Eq_971 {	// size: 4 4
	word32 dw0000;	// 0
	Eq_971 t0004;	// 4
} Eq_971;

typedef Eq_209 (Eq_983)(Eq_985);

typedef union Eq_985 {
	word32 u0;
	 LPCSTR u1;
} Eq_985;

typedef union Eq_1023 {
	word32 u0;
	 HANDLE u1;
} Eq_1023;

typedef Eq_1023 (Eq_1024)(Eq_1026, Eq_1027, Eq_1028, Eq_1029, Eq_209, Eq_1031);

typedef union Eq_1026 {
	word32 u0;
	 HANDLE u1;
} Eq_1026;

typedef union Eq_1027 {
	word32 u0;
	 LPSECURITY_ATTRIBUTES u1;
} Eq_1027;

typedef union Eq_1028 {
	word32 u0;
	 DWORD u1;
} Eq_1028;

typedef union Eq_1029 {
	word32 u0;
	 DWORD u1;
} Eq_1029;

typedef union Eq_1031 {
	word32 u0;
	 LPCSTR u1;
} Eq_1031;

typedef  Eq_1052[]struct Eq_1052 {
	word32 dw0000;	// 0
	word32 dw0004;	// 4
	word16 a0008[];	// 8
} Eq_1052;

typedef word32 (Eq_1131)(Eq_209, Eq_1134);

typedef union Eq_1134 {
	word32 u0;
	 LPCSTR u1;
} Eq_1134;

typedef union Eq_1207 {
	word32 u0;
	 DWORD u1;
} Eq_1207;

typedef Eq_207 (Eq_1214)(Eq_1023, Eq_1207, Eq_209, Eq_1219, Eq_1220, Eq_209);

typedef union Eq_1219 {
	word32 u0;
	 DWORD u1;
} Eq_1219;

typedef union Eq_1220 {
	word32 u0;
	 SIZE_T u1;
} Eq_1220;

typedef word32 (Eq_1274)(Eq_209);

typedef word32 (Eq_1298)(Eq_209, Eq_1220, Eq_1302);

typedef union Eq_1302 {
	word32 u0;
	 DWORD u1;
} Eq_1302;

typedef void (Eq_1309)(Eq_207);

typedef void (Eq_1315)(Eq_209, word32);

typedef Eq_1458 Eq_1458struct Eq_1458 {
	Eq_1458 * ptr0000;	// 0
	word32 dw0018;	// 18
	word32 dw001C;	// 1C
} Eq_1458;

typedef Eq_1466 Eq_1463struct Eq_1463 {
	word32 dw0008;	// 8
	Eq_1466 * ptr000C;	// C
} Eq_1463;

typedef Eq_1458 Eq_1466struct Eq_1466 {
	Eq_1458 * ptr000C;	// C
} Eq_1466;

typedef word32 (Eq_1500)(Eq_1502, Eq_1503, Eq_1504);

typedef union Eq_1502 {
	word32 u0;
	 HANDLE u1;
} Eq_1502;

typedef union Eq_1503 {
	word32 u0;
	 DWORD u1;
} Eq_1503;

typedef union Eq_1504 {
	word32 u0;
	 LPVOID u1;
} Eq_1504;

typedef Eq_1502 (Eq_1505)();

typedef word32 (Eq_1512)(Eq_1502, Eq_1515, Eq_1516);

typedef union Eq_1515 {
	word32 u0;
	 DWORD u1;
} Eq_1515;

typedef union Eq_1516 {
	word32 u0;
	 SIZE_T u1;
} Eq_1516;

typedef DWORDLPVOIDBOOLstruct _SECURITY_ATTRIBUTES {
	DWORD;	// 0
	LPVOID;	// 4
	BOOL;	// 8
} Eq_1528;

typedef Eq_207 Eq_1529struct Eq_1529 {
	up32 dw0000;	// 0
	Eq_207 t0004;	// 4
	word32 dw003C;	// 3C
} Eq_1529;

typedef struct Eq_1530 {
	word32 dw003C;	// 3C
} Eq_1530;

typedef DWORDLPSTRLPSTRLPSTRDWORDDWORDDWORDDWORDDWORDDWORDDWORDDWORDWORDWORDLPBYTEHANDLEHANDLEHANDLEstruct _STARTUPINFOA {
	DWORD;	// 0
	LPSTR;	// 4
	LPSTR;	// 8
	LPSTR;	// C
	DWORD;	// 10
	DWORD;	// 14
	DWORD;	// 18
	DWORD;	// 1C
	DWORD;	// 20
	DWORD;	// 24
	DWORD;	// 28
	DWORD;	// 2C
	WORD;	// 30
	WORD;	// 32
	LPBYTE;	// 34
	HANDLE;	// 38
	HANDLE;	// 3C
	HANDLE;	// 40
} Eq_1536;

typedef DWORDDWORDstruct struct_61 {
	DWORD;	// 0
	DWORD;	// 4
} Eq_1537;

typedef union Eq_1538 {
	 <anonymous> u0;
	 PVOID u1;
} Eq_1538;

typedef ULONG_PTRULONG_PTREq_1538 Eq_1539HANDLEstruct _OVERLAPPED {
	ULONG_PTR;	// 0
	ULONG_PTR;	// 4
	Eq_1538 t0008;	// 8
	HANDLE;	// 10
} Eq_1539;

typedef struct Eq_1540 {
	word32 dw003C;	// 3C
} Eq_1540;

typedef DWORDLPVOIDBOOLstruct _SECURITY_ATTRIBUTES {
	DWORD;	// 0
	LPVOID;	// 4
	BOOL;	// 8
} Eq_1541;

