// subject.h
// Generated on TIMESTAMP by decompiling malware_via_email/malware_0718/ia32_pe/subject.exe
// using Decompiler version VERSION

/*
// Equivalence classes ////////////
Eq_1: (struct "Globals" (0 byte b0000) (402001 up32 dw402001) (402005 word32 dw402005) (406334 Eq_213 t406334) (406338 word32 dw406338) (40633C int32 dw40633C) (406340 word32 dw406340) (406344 word32 dw406344) (406348 word32 dw406348) (40634C word32 dw40634C) (406350 (ptr Eq_112) ptr406350) (406354 word32 dw406354) (406358 (ptr code) ptr406358))
	globals_t (in globals : (ptr (struct "Globals")))
Eq_42: (union "Eq_42" (word32 u0) (HMODULE u1))
	T_42 (in eax_46 : Eq_42)
	T_47 (in GetModuleHandleA(0x00000000) : word32)
	T_128 (in dwArg08 : Eq_42)
	T_176 (in hModule : HMODULE)
	T_178 (in dwArg04 : word32)
	T_181 (in eax_9 : Eq_42)
	T_184 (in GetModuleHandleA(0x00406288) : word32)
	T_701 (in GetModuleHandleA(0x00406308) : word32)
Eq_43: (fn Eq_42 (Eq_45))
	T_43 (in GetModuleHandleA : ptr32)
	T_44 (in signature of GetModuleHandleA : void)
	T_182 (in GetModuleHandleA : ptr32)
	T_699 (in GetModuleHandleA : ptr32)
Eq_45: (union "Eq_45" (word32 u0) (LPCSTR u1))
	T_45 (in lpModuleName : LPCSTR)
	T_46 (in 0x00000000 : word32)
	T_183 (in 0x00406288 : word32)
	T_700 (in 0x00406308 : word32)
Eq_48: (fn word32 (Eq_50, Eq_51, Eq_52))
	T_48 (in RegOpenKeyA : ptr32)
	T_49 (in signature of RegOpenKeyA : void)
Eq_50: (union "Eq_50" (word32 u0) (HKEY u1))
	T_50 (in hKey : HKEY)
	T_53 (in 0x80000000 : word32)

T_893: (in Mem0[dwArg08 + 0x00000000:byte] : byte)
  Class: Eq_893
  DataType: byte
  OrigDataType: byte
T_894: (in (word32) dwArg08->b0000 : word32)
  Class: Eq_889
  DataType: word32
  OrigDataType: word32
T_895: (in edx_33 : word32)
  Class: Eq_885
  DataType: word32
  OrigDataType: word32
T_896: (in 0x0000007F : word32)
  Class: Eq_896
  DataType: word32
  OrigDataType: word32
T_897: (in edx_23 & 0x0000007F : word32)
  Class: Eq_897
  DataType: word32
  OrigDataType: word32
T_898: (in 0x00000007 : word32)
  Class: Eq_898
  DataType: word32
  OrigDataType: word32
T_899: (in dwLoc08_19 << 0x00000007 : word32)
  Class: Eq_899
  DataType: ui32
  OrigDataType: ui32
T_900: (in edx_23 & 0x0000007F | dwLoc08_19 << 0x00000007 : word32)
  Class: Eq_885
  DataType: word32
  OrigDataType: word32
T_901: (in eax_36 : word32)
  Class: Eq_887
  DataType: word32
  OrigDataType: word32
T_902: (in 0x00000001 : word32)
  Class: Eq_902
  DataType: word32
  OrigDataType: word32
T_903: (in dwLoc10_20 + 0x00000001 : word32)
  Class: Eq_887
  DataType: word32
  OrigDataType: word32
T_904: (in 0x00000001 : word32)
  Class: Eq_904
  DataType: word32
  OrigDataType: word32
T_905: (in dwArg08 + 0x00000001 : word32)
  Class: Eq_890
  DataType: (ptr Eq_890)
  OrigDataType: word32
T_906: (in 0x00000080 : word32)
  Class: Eq_906
  DataType: word32
  OrigDataType: word32
T_907: (in edx_23 & 0x00000080 : word32)
  Class: Eq_907
  DataType: word32
  OrigDataType: word32
T_908: (in 0x00000000 : word32)
  Class: Eq_907
  DataType: word32
  OrigDataType: word32
T_909: (in (edx_23 & 0x00000080) != 0x00000000 : bool)
  Class: Eq_909
  DataType: bool
  OrigDataType: bool
T_910: (in dwArg04 : word32)
  Class: Eq_910
  DataType: (ptr word32)
  OrigDataType: (ptr (struct (0 T_913 t0000)))
T_911: (in 0x00000000 : word32)
  Class: Eq_911
  DataType: word32
  OrigDataType: word32
T_912: (in dwArg04 + 0x00000000 : word32)
  Class: Eq_912
  DataType: word32
  OrigDataType: word32
T_913: (in Mem46[dwArg04 + 0x00000000:word32] : word32)
  Class: Eq_885
  DataType: word32
  OrigDataType: word32
T_914:
  Class: Eq_914
  DataType: word16
  OrigDataType: (struct 0002 (0 T_751 t0000))
T_915:
  Class: Eq_914
  DataType: word16
  OrigDataType: (struct 0002 (0 T_765 t0000))
T_916:
  Class: Eq_914
  DataType: word16
  OrigDataType: (struct 0002 (0 T_780 t0000))
T_917:
  Class: Eq_917
  DataType: int32
  OrigDataType: 
T_918:
  Class: Eq_918
  DataType: int32
  OrigDataType: 
T_919:
  Class: Eq_919
  DataType: int32
  OrigDataType: 
T_920:
  Class: Eq_920
  DataType: Eq_920
  OrigDataType: 
*/
typedef Eq_213 Eq_1Eq_112 Eq_1code Eq_1struct Globals {
	byte b0000;	// 0
	up32 dw402001;	// 402001
	word32 dw402005;	// 402005
	Eq_213 t406334;	// 406334
	word32 dw406338;	// 406338
	int32 dw40633C;	// 40633C
	word32 dw406340;	// 406340
	word32 dw406344;	// 406344
	word32 dw406348;	// 406348
	word32 dw40634C;	// 40634C
	Eq_112 * ptr406350;	// 406350
	word32 dw406354;	// 406354
	code * ptr406358;	// 406358
} Eq_1;

typedef union Eq_42 {
	word32 u0;
	 HMODULE u1;
} Eq_42;

typedef Eq_42 (Eq_43)(Eq_45);

typedef union Eq_45 {
	word32 u0;
	 LPCSTR u1;
} Eq_45;

typedef word32 (Eq_48)(Eq_50, Eq_51, Eq_52);

typedef union Eq_50 {
	word32 u0;
	 HKEY u1;
} Eq_50;

typedef union Eq_51 {
	word32 u0;
	 LPCSTR u1;
} Eq_51;

typedef union Eq_52 {
	word32 u0;
	 PHKEY u1;
} Eq_52;

typedef struct Eq_55 {
	ptr32 ptrFFFFFFC0;	// FFFFFFC0
	word32 dwFFFFFFC4;	// FFFFFFC4
} Eq_55;

typedef word32 (Eq_78)(word32);

typedef void (Eq_93)(word32, word32, up32);

typedef Eq_112 Eq_110struct Eq_110 {
	Eq_112 * ptr0018;	// 18
} Eq_110;

typedef Eq_799 Eq_112struct Eq_112 {
	Eq_799 * ptr0030;	// 30
} Eq_112;

typedef void (Eq_125)(word32, Eq_42);

typedef void (Eq_134)(word32, word32);

typedef struct Eq_155 {
	word32 dw0008;	// 8
} Eq_155;

typedef struct Eq_162 {
	word32 dw0008;	// 8
} Eq_162;

typedef code * (Eq_174)(Eq_42, Eq_177);

typedef union Eq_177 {
	word32 u0;
	 LPCSTR u1;
} Eq_177;

typedef Eq_288 Eq_207struct Eq_207 {
	word16 w0006;	// 6
	word16 w0014;	// 14
	Eq_288 t003C;	// 3C
} Eq_207;

typedef struct Eq_208 {
	word32 dw003C;	// 3C
} Eq_208;

typedef union Eq_213 {
	Eq_920* u0;
	 DWORD u1;
	 HANDLE u2;
	 SIZE_T u3;
} Eq_213;

typedef struct Eq_221 {
	word32 dwFFFFFFE8;	// FFFFFFE8
} Eq_221;

typedef void (Eq_225)(Eq_213, Eq_208 *, Eq_213);

typedef Eq_263 Eq_263struct Eq_263 {	// size: 20 14
	word32 dw0000;	// 0
	word32 dw000C;	// C
	word32 dw0010;	// 10
	Eq_263 t0014;	// 14
} Eq_263;

typedef union Eq_288 {
	int32 u0;
	uint32 u1;
} Eq_288;

typedef union Eq_309 {
	int32 u0;
	uint32 u1;
} Eq_309;

typedef union Eq_315 {
	word32 u0;
	 DWORD u1;
	 LPCVOID u2;
	 LPVOID u3;
} Eq_315;

typedef Eq_315 Eq_319Eq_540 Eq_319Eq_315 Eq_319Eq_213 Eq_319Eq_315 Eq_319struct Eq_319 {
	Eq_315 tFFFFFFE0;	// FFFFFFE0
	Eq_540 tFFFFFFE4;	// FFFFFFE4
	Eq_315 tFFFFFFE8;	// FFFFFFE8
	Eq_213 tFFFFFFEC;	// FFFFFFEC
	word32 dwFFFFFFF0;	// FFFFFFF0
	word32 dwFFFFFFF4;	// FFFFFFF4
	word32 dwFFFFFFF8;	// FFFFFFF8
	word32 dwFFFFFFFC;	// FFFFFFFC
	Eq_315 t0000;	// 0
} Eq_319;

typedef Eq_352 Eq_352struct Eq_352 {	// size: 4 4
	word32 dw0000;	// 0
	Eq_352 t0004;	// 4
} Eq_352;

typedef Eq_353 Eq_353struct Eq_353 {	// size: 4 4
	word32 dw0000;	// 0
	Eq_353 t0004;	// 4
} Eq_353;

typedef Eq_213 Eq_404Eq_213 Eq_404Eq_213 Eq_404struct Eq_404 {
	Eq_213 tFFFFFFF8;	// FFFFFFF8
	Eq_213 tFFFFFFFC;	// FFFFFFFC
	Eq_213 t0000;	// 0
} Eq_404;

typedef word32 (Eq_410)(Eq_213);

typedef void (Eq_440)(Eq_213);

typedef word32 (Eq_466)(Eq_315);

typedef Eq_213 Eq_474Eq_495 Eq_474Eq_315 Eq_474Eq_213 Eq_474Eq_483 Eq_474Eq_315 Eq_474struct Eq_474 {
	Eq_213 tFFFFFFEC;	// FFFFFFEC
	Eq_495 tFFFFFFF0;	// FFFFFFF0
	Eq_315 tFFFFFFF4;	// FFFFFFF4
	Eq_213 tFFFFFFF8;	// FFFFFFF8
	Eq_483 tFFFFFFFC;	// FFFFFFFC
	Eq_315 t0000;	// 0
} Eq_474;

typedef union Eq_483 {
	word32 u0;
	 DWORD u1;
	 SIZE_T u2;
} Eq_483;

typedef union Eq_495 {
	word32 u0;
	 DWORD u1;
} Eq_495;

typedef Eq_213 (Eq_502)(Eq_213, Eq_495, Eq_315, Eq_213, Eq_483, Eq_315);

typedef union Eq_540 {
	word32 u0;
	 SIZE_T u1;
} Eq_540;

typedef word32 (Eq_552)(Eq_315, Eq_540, Eq_315);

typedef Eq_263 Eq_577struct Eq_577 {
	Eq_263 * ptrFFFFFFFC;	// FFFFFFFC
	word32 dw0000;	// 0
	word32 dw0004;	// 4
} Eq_577;

typedef word32 (Eq_592)(Eq_213, Eq_208 *);

typedef Eq_263 Eq_602struct Eq_602 {
	Eq_263 * ptrFFFFFFFC;	// FFFFFFFC
	word32 dw0000;	// 0
	word32 dw0004;	// 4
} Eq_602;

typedef Eq_213 (Eq_661)(Eq_315, Eq_213, Eq_483, Eq_315);

typedef  Eq_726[]struct Eq_726 {
	word32 dw0000;	// 0
	word32 dw0004;	// 4
	word16 a0008[];	// 8
} Eq_726;

typedef struct Eq_799 {
	word32 dw0008;	// 8
} Eq_799;

typedef word32 (Eq_808)(Eq_810, Eq_811);

typedef union Eq_810 {
	word32 u0;
	 LPSTR u1;
} Eq_810;

typedef union Eq_811 {
	word32 u0;
	 LPCSTR u1;
} Eq_811;

typedef word32 (Eq_834)(word32, word32);

typedef Eq_890 Eq_890struct Eq_890 {	// size: 1 1
	byte b0000;	// 0
	Eq_890 t0001;	// 1
} Eq_890;

typedef code Eq_920Eq_315 Eq_920Eq_213 Eq_920struct Eq_920 {	// size: 40 28
	word32 dw000C;	// C
	word32 dw0010;	// 10
	word32 dw0014;	// 14
	code * ptr0028;	// 28
	Eq_315 t0034;	// 34
	word32 dw003C;	// 3C
	Eq_213 t0050;	// 50
	word32 dw0080;	// 80
	word32 dw00A0;	// A0
	word32 dw00A4;	// A4
} Eq_920;

