// subject.h
// Generated on TIMESTAMP by decompiling malware_via_email/malware_0434/ia32_pe/subject.exe
// using Decompiler version VERSION

/*
// Equivalence classes ////////////
Eq_1: (struct "Globals" (0 word16 w0000) (2 byte b0002) (456C6C65 Eq_10581 t456C6C65))
	globals_t (in globals : (ptr (struct "Globals")))
Eq_10252: (struct "Eq_10252" 0001 (FFFFFFB0 byte bFFFFFFB0) (FFFFFFB1 byte bFFFFFFB1) (0 byte b0000))
	T_10252 (in eax_2937 : (ptr Eq_10252))
	T_10254 (in DPB(eax, 0x00, 0, 8) : word32)
	T_10368 (in DPB(eax_2989, 0x00, 0, 8) : word32)
Eq_10429: (struct "Eq_10429" (AE0000B1 byte bAE0000B1) (FFFFFFB2 byte bFFFFFFB2) (FFFFFFB3 byte bFFFFFFB3) (0 byte b0000))
	T_10429 (in esi : (ptr Eq_10429))
Eq_10463: (struct "Eq_10463" (FFFFFFB1 byte bFFFFFFB1))
	T_10463 (in edx : (ptr Eq_10463))
Eq_10476: (struct "Eq_10476" (FFFFFFFC word32 dwFFFFFFFC) (0 (ptr Eq_10476) ptr0000))
	T_10476 (in esp_3036 : (ptr Eq_10476))
	T_10478 (in esp_1 - 0x00000004 : word32)
	T_10481 (in Mem3037[esp_3036 + 0x00000000:word32] : word32)
Eq_10505: (union "Eq_10505" ((ptr Eq_23729) u0) ((memptr (ptr Eq_11424) byte) u1) ((memptr (ptr Eq_23360) byte) u2))
	T_10505 (in ebx : Eq_10505)
	T_10507 (in DPB(ebx, 0x00, 0, 8) : word32)
	T_10584 (in edx_3083 : Eq_10505)
	T_10586 (in edx_3073 - 0x00000001 : word32)
	T_10701 (in DPB(edx_3083, 0x00, 0, 8) : word32)
	T_10705 (in DPB(ebx, 0x00, 0, 8) : word32)
	T_10741 (in Mem3153[esp_3124 - 0x00000005:word32] : word32)
	T_10762 (in eax_3154 : Eq_10505)

T_23704: (in 0x00000000 : word32)
  Class: Eq_23704
  DataType: word32
  OrigDataType: word32
T_23705: (in eax_3154 + 0x00000000 : word32)
  Class: Eq_23705
  DataType: word32
  OrigDataType: word32
T_23706: (in Mem3169[eax_3154 + 0x00000000:word16] : word16)
  Class: Eq_10749
  DataType: Eq_10749
  OrigDataType: word16
T_23707: (in &Mem3169[eax_3154 + 0x00000000:word16] : ptr32)
  Class: Eq_23707
  DataType: (ptr word16)
  OrigDataType: (ptr word16)
T_23708: (in __arpl(Mem3169[eax_3154 + 0x00000000:word16], bx, &Mem3169[eax_3154 + 0x00000000:word16]) : bool)
  Class: Eq_23708
  DataType: bool
  OrigDataType: bool
T_23709: (in 0x00000001 : word32)
  Class: Eq_23709
  DataType: word32
  OrigDataType: word32
T_23710: (in ebx + 0x00000001 : word32)
  Class: Eq_23450
  DataType: word32
  OrigDataType: word32
T_23711: (in (word16) ebx_8892 : word16)
  Class: Eq_10508
  DataType: word16
  OrigDataType: word16
T_23712:
  Class: Eq_23712
  DataType: Eq_23712
  OrigDataType: (struct 0004 (0 T_10554 t0000))
T_23713:
  Class: Eq_23712
  DataType: Eq_23712
  OrigDataType: (struct 0004 (0 T_10557 t0000))
T_23714:
  Class: Eq_23714
  DataType: Eq_23714
  OrigDataType: (struct 0004 (0 T_10609 t0000))
T_23715:
  Class: Eq_23714
  DataType: Eq_23714
  OrigDataType: (struct 0004 (0 T_10613 t0000))
T_23716:
  Class: Eq_10749
  DataType: Eq_10749
  OrigDataType: (struct 0004 (0 T_10629 t0000))
T_23717:
  Class: Eq_10749
  DataType: Eq_10749
  OrigDataType: (struct 0004 (0 T_10633 t0000))
T_23718:
  Class: Eq_10749
  DataType: Eq_10749
  OrigDataType: (struct 0004 (0 T_10660 t0000))
T_23719:
  Class: Eq_10749
  DataType: Eq_10749
  OrigDataType: (struct 0004 (0 T_10664 t0000))
T_23720:
  Class: Eq_23720
  DataType: word16
  OrigDataType: (struct 0002 (0 T_10806 t0000))
T_23721:
  Class: Eq_23720
  DataType: word16
  OrigDataType: (struct 0002 (0 T_10811 t0000))
T_23722:
  Class: Eq_23722
  DataType: Eq_23722
  OrigDataType: (struct 0002 (0 T_11278 t0000))
T_23723:
  Class: Eq_23722
  DataType: Eq_23722
  OrigDataType: (struct 0002 (0 T_11284 t0000))
T_23724:
  Class: Eq_23724
  DataType: Eq_23724
  OrigDataType: (struct 0002 (0 T_23396 t0000))
T_23725:
  Class: Eq_23724
  DataType: Eq_23724
  OrigDataType: (struct 0002 (0 T_23402 t0000))
T_23726:
  Class: Eq_23726
  DataType: Eq_23726
  OrigDataType: (struct 0002 (0 T_23520 t0000))
T_23727:
  Class: Eq_23726
  DataType: Eq_23726
  OrigDataType: (struct 0002 (0 T_23528 t0000))
T_23728:
  Class: Eq_11403
  DataType: Eq_11403
  OrigDataType: (struct "Eq_11403" 0002 (0 Eq_23733 t0000))
T_23729:
  Class: Eq_23729
  DataType: Eq_23729
  OrigDataType: 
T_23730:
  Class: Eq_23730
  DataType: Eq_23730
  OrigDataType: 
T_23731:
  Class: Eq_23731
  DataType: Eq_23731
  OrigDataType: 
T_23732:
  Class: Eq_23732
  DataType: Eq_23732
  OrigDataType: 
T_23733:
  Class: Eq_23733
  DataType: Eq_23733
  OrigDataType: 
*/
typedef Eq_10581 Eq_1struct Globals {
	word16 w0000;	// 0
	byte b0002;	// 2
	Eq_10581 t456C6C65;	// 456C6C65
} Eq_1;

typedef struct Eq_10252 {	// size: 1 1
	byte bFFFFFFB0;	// FFFFFFB0
	byte bFFFFFFB1;	// FFFFFFB1
	byte b0000;	// 0
} Eq_10252;

typedef struct Eq_10429 {
	byte bAE0000B1;	// AE0000B1
	byte bFFFFFFB2;	// FFFFFFB2
	byte bFFFFFFB3;	// FFFFFFB3
	byte b0000;	// 0
} Eq_10429;

typedef struct Eq_10463 {
	byte bFFFFFFB1;	// FFFFFFB1
} Eq_10463;

typedef Eq_10476 Eq_10476struct Eq_10476 {
	word32 dwFFFFFFFC;	// FFFFFFFC
	Eq_10476 * ptr0000;	// 0
} Eq_10476;

typedef union Eq_10505 {
	Eq_23729* u0;
	byte Eq_11424::* u1;
	byte Eq_23360::* u2;
} Eq_10505;

typedef struct Eq_10541 {
	byte b960000B2;	// 960000B2
	byte bB60000B2;	// B60000B2
	int8 b0000;	// 0
} Eq_10541;

typedef Eq_23712 Eq_10549[]struct Eq_10549 {
	byte bB2360000;	// B2360000
	Eq_23712 a0000[];	// 0
} Eq_10549;

typedef Eq_10581 Eq_10581 Eq_10581[]struct Eq_10581 {
	Eq_10581 t0001;	// 1
	word16 a0063[];	// 63
	word16 w0064;	// 64
	word16 w006C;	// 6C
} Eq_10581;

typedef Eq_10746 Eq_10644Eq_10505 Eq_10644Eq_10647 Eq_10644Eq_10505 Eq_10644Eq_10505 Eq_10644Eq_10581 Eq_10644Eq_10505 Eq_10644struct Eq_10644 {
	Eq_10746 tFFFFFFF8;	// FFFFFFF8
	Eq_10505 tFFFFFFFB;	// FFFFFFFB
	word32 dwFFFFFFFC;	// FFFFFFFC
	word32 dwFFFFFFFE;	// FFFFFFFE
	Eq_10647 * ptr0000;	// 0
	word32 dw0002;	// 2
	Eq_10505 t0008;	// 8
	Eq_10505 t000C;	// C
	Eq_10581 * ptr0010;	// 10
	Eq_10505 t0014;	// 14
} Eq_10644;

typedef struct Eq_10647 {
	word16 w0075;	// 75
	word16 w0077;	// 77
} Eq_10647;

typedef Eq_10505 Eq_10716struct Eq_10716 {
	Eq_10505 tFFFFFFFC;	// FFFFFFFC
} Eq_10716;

typedef union Eq_10746 {
	byte u0;
	Eq_23730* u1;
	Eq_23731 Eq_11424::* u2;
} Eq_10746;

typedef union Eq_10749 {
	int8 u0;
	int32 u1;
	bcu8 u2;
	word16 u3;
	Eq_23732 u4;
} Eq_10749;

typedef Eq_10767 Eq_10752struct Eq_10752 {
	Eq_10767 t0001;	// 1
	byte b0079;	// 79
} Eq_10752;

typedef struct Eq_10767 {
	byte b0000;	// 0
	byte b0001;	// 1
	byte b0002;	// 2
	int32 dw0065;	// 65
} Eq_10767;

typedef bool (Eq_10801)(word16, word16, word16 *);

typedef void (Eq_10814)(Eq_10505, Eq_10505);

typedef void (Eq_10817)(Eq_10505, byte);

typedef bool (Eq_10861)(word16, word16, word16 *);

typedef Eq_10746 (Eq_10883)(Eq_10505);

typedef byte (Eq_10888)(Eq_10505);

typedef bool (Eq_10901)(word16, word16, word16 *);

typedef Eq_10746 Eq_10957Eq_10746 Eq_10957struct Eq_10957 {
	Eq_10746 tFFFFFFFC;	// FFFFFFFC
	Eq_10746 t0000;	// 0
} Eq_10957;

typedef void (Eq_10967)(Eq_10505, Eq_10505);

typedef void (Eq_10984)(Eq_10505, Eq_10505);

typedef bool (Eq_10986)(word32);

typedef bool (Eq_10991)(word32);

typedef bool (Eq_10995)(word32);

typedef bool (Eq_10999)(word32);

typedef union Eq_11018 {
	int32 u0;
	word16 u1;
} Eq_11018;

typedef struct Eq_11022 {
	byte b0000;	// 0
	byte b0002;	// 2
	byte b0004;	// 4
} Eq_11022;

typedef byte (Eq_11025)(Eq_10505);

typedef byte (Eq_11030)(Eq_10505);

typedef byte (Eq_11035)(Eq_10505);

typedef void (Eq_11040)(Eq_10505, Eq_10505);

typedef bool (Eq_11042)(word16, word16, word16 *);

typedef Eq_11103 Eq_11051Eq_11080 Eq_11051Eq_11051 Eq_11051Eq_11173 Eq_11051Eq_11177 Eq_11051Eq_10746 Eq_11051Eq_11219 Eq_11051Eq_10505 Eq_11051Eq_10505 Eq_11051Eq_10581 Eq_11051Eq_10505 Eq_11051struct Eq_11051 {
	Eq_11103 * ptrFFFFFFF8;	// FFFFFFF8
	Eq_11080 * ptrFFFFFFFC;	// FFFFFFFC
	Eq_11051 * ptr0000;	// 0
	word32 dw000C;	// C
	word32 dw0014;	// 14
	Eq_11173 * ptr0017;	// 17
	Eq_11177 * ptr001B;	// 1B
	word32 dw002B;	// 2B
	word32 dw0033;	// 33
	Eq_10746 t0036;	// 36
	Eq_11219 * ptr003A;	// 3A
	Eq_10505 t0046;	// 46
	Eq_10505 t004A;	// 4A
	Eq_10581 * ptr004E;	// 4E
	Eq_10505 t0052;	// 52
} Eq_11051;

typedef struct Eq_11060 {
	int32 dw0065;	// 65
} Eq_11060;

typedef void (Eq_11068)(Eq_10505, Eq_10505);

typedef bool (Eq_11070)(word16, word16, word16 *);

typedef struct Eq_11080 {
	int32 dw0066;	// 66
} Eq_11080;

typedef struct Eq_11083 {
	int32 dw0065;	// 65
} Eq_11083;

typedef void (Eq_11091)(Eq_10505, Eq_10505);

typedef bool (Eq_11093)(word16, word16, word16 *);

typedef Eq_11160 Eq_11103Eq_11165 Eq_11103struct Eq_11103 {
	Eq_11160 t0000;	// 0
	Eq_11165 t0004;	// 4
} Eq_11103;

typedef void (Eq_11116)(Eq_10505, Eq_10505);

typedef void (Eq_11120)(Eq_10505, Eq_10505);

typedef Eq_10746 (Eq_11122)(Eq_10505);

typedef Eq_11128 (Eq_11127)(Eq_10505);

typedef union Eq_11128 {
	byte u0;
	word32 u1;
} Eq_11128;

typedef void (Eq_11147)(word32, byte);

typedef void (Eq_11157)(word32, word32);

typedef Eq_11160 (Eq_11159)(word32);

typedef union Eq_11160 {
	byte u0;
	word32 u1;
} Eq_11160;

typedef Eq_11165 (Eq_11164)(word32);

typedef union Eq_11165 {
	byte u0;
	word32 u1;
} Eq_11165;

typedef Eq_11198 Eq_11173Eq_11203 Eq_11173struct Eq_11173 {
	Eq_11198 t0000;	// 0
	Eq_11203 t0004;	// 4
} Eq_11173;

typedef struct Eq_11177 {
	int32 dw0066;	// 66
} Eq_11177;

typedef void (Eq_11185)(word32, byte);

typedef void (Eq_11195)(word32, word32);

typedef Eq_11198 (Eq_11197)(word32);

typedef union Eq_11198 {
	byte u0;
	word32 u1;
} Eq_11198;

typedef Eq_11203 (Eq_11202)(word32);

typedef union Eq_11203 {
	byte u0;
	word32 u1;
} Eq_11203;

typedef struct Eq_11219 {
	int32 dw0066;	// 66
} Eq_11219;

typedef void (Eq_11227)(Eq_10505, byte);

typedef Eq_10746 (Eq_11242)(Eq_10505);

typedef Eq_10767 Eq_11247Eq_11285 Eq_11247Eq_10505 Eq_11247Eq_10505 Eq_11247struct Eq_11247 {
	Eq_10767 * ptr0000;	// 0
	Eq_11285 * ptr0010;	// 10
	Eq_10505 t0014;	// 14
	Eq_10505 t001C;	// 1C
} Eq_11247;

typedef void (Eq_11253)(Eq_10505, byte);

typedef Eq_23722 Eq_11255[]struct Eq_11255 {
	byte b0000;	// 0
	Eq_23722 a0064[];	// 64
} Eq_11255;

typedef byte (Eq_11258)(Eq_10505);

typedef void (Eq_11263)(Eq_10505, Eq_10505);

typedef bool (Eq_11265)(Eq_10749, word16, word16 *);

typedef struct Eq_11285 {
	bcu8 b006C;	// 6C
} Eq_11285;

typedef byte (Eq_11299)(Eq_10505);

typedef byte (Eq_11304)(Eq_10505);

typedef byte (Eq_11309)(Eq_10505);

typedef void (Eq_11314)(Eq_10505, Eq_10505);

typedef bool (Eq_11316)(Eq_10749, word16, word16 *);

typedef void (Eq_11336)(Eq_10505, Eq_10505);

typedef void (Eq_11344)(Eq_10505, byte);

typedef struct Eq_11346 {
	word32 dwFFFFFFF4;	// FFFFFFF4
	word32 dwFFFFFFF8;	// FFFFFFF8
	word32 dwFFFFFFFC;	// FFFFFFFC
	word32 dw0000;	// 0
} Eq_11346;

typedef void (Eq_11360)(Eq_10505, byte);

typedef void (Eq_11368)(Eq_10505, byte);

typedef void (Eq_11376)(Eq_10505, byte);

typedef Eq_10746 (Eq_11396)(Eq_10505);

typedef Eq_23733 Eq_11403struct Eq_11403 {	// size: 2 2
	Eq_23733 t0000;	// 0
} Eq_11403;

typedef Eq_23726 Eq_11424[]struct Eq_11424 {
	Eq_23726 a0000[];	// 0
} Eq_11424;

typedef void (Eq_11432)(Eq_10505, Eq_10505);

typedef Eq_10746 (Eq_11434)(Eq_10505);

typedef void (Eq_11439)(Eq_10505, Eq_10505);

typedef void (Eq_11451)(Eq_10505, byte);

typedef Eq_10746 (Eq_11453)(Eq_10505);

typedef Eq_10505 Eq_11479Eq_10505 Eq_11479struct Eq_11479 {
	Eq_10505 t0010;	// 10
	Eq_10505 t0018;	// 18
} Eq_11479;

typedef struct Eq_11492 {
	word16 w0000;	// 0
	word16 w0002;	// 2
	word16 w0006;	// 6
	word16 w0008;	// 8
	word16 w000A;	// A
	word16 w000C;	// C
} Eq_11492;

typedef Eq_10746 (Eq_11530)(Eq_10505);

typedef byte (Eq_11538)(Eq_10505);

typedef void (Eq_11543)(Eq_10505, Eq_10505);

typedef bool (Eq_11545)(Eq_10749, word16, word16 *);

typedef byte (Eq_11570)(Eq_10505);

typedef void (Eq_11575)(Eq_10505, Eq_10505);

typedef bool (Eq_11577)(word16, word16, word16 *);

typedef bool (Eq_11592)(word16, word16, word16 *);

typedef Eq_10746 (Eq_11601)(Eq_10505);

typedef void (Eq_11606)(Eq_10505, Eq_10505);

typedef bool (Eq_11608)(Eq_10749, word16, word16 *);

typedef void (Eq_11623)(Eq_10505, Eq_10505);

typedef union Eq_11650 {
	int32 u0;
	up32 u1;
} Eq_11650;

typedef void (Eq_11668)(Eq_10505, byte);

typedef void (Eq_11676)(Eq_10505, Eq_10505);

typedef Eq_10746 Eq_11700Eq_10767 Eq_11700Eq_10505 Eq_11700Eq_10581 Eq_11700Eq_10505 Eq_11700struct Eq_11700 {
	Eq_10746 t0000;	// 0
	Eq_10767 * ptr0004;	// 4
	word32 dw000C;	// C
	Eq_10505 t0010;	// 10
	Eq_10581 * ptr0014;	// 14
	Eq_10505 t0018;	// 18
} Eq_11700;

typedef Eq_10505 Eq_11728Eq_10505 Eq_11728struct Eq_11728 {
	word32 dw000C;	// C
	Eq_10505 t0010;	// 10
	Eq_10505 t0018;	// 18
} Eq_11728;

typedef Eq_10746 (Eq_11745)(Eq_10505);

typedef byte (Eq_11755)(Eq_10505);

typedef void (Eq_11760)(Eq_10505, Eq_10505);

typedef Eq_10505 Eq_11790Eq_10505 Eq_11790Eq_10716 Eq_11790Eq_10746 Eq_11790Eq_10505 Eq_11790Eq_10505 Eq_11790Eq_10716 Eq_11790Eq_11883 Eq_11790Eq_10505 Eq_11790Eq_10505 Eq_11790struct Eq_11790 {
	word32 dw0020;	// 20
	Eq_10505 t0030;	// 30
	Eq_10505 t0038;	// 38
	Eq_10716 t003C;	// 3C
	Eq_10746 t005C;	// 5C
	word32 dw006C;	// 6C
	Eq_10505 t0070;	// 70
	Eq_10505 t0078;	// 78
	Eq_10716 t007C;	// 7C
	Eq_11883 * ptr009C;	// 9C
	word32 dw00A3;	// A3
	word32 dw00A8;	// A8
	word32 dw00AC;	// AC
	Eq_10505 t00B0;	// B0
	word32 dw00B4;	// B4
	Eq_10505 t00B8;	// B8
} Eq_11790;

typedef bool (Eq_11815)(word32);

typedef void (Eq_11819)(Eq_10505, Eq_10505);

typedef void (Eq_11823)(Eq_10505, Eq_10505);

typedef Eq_12012 Eq_11883Eq_12019 Eq_11883struct Eq_11883 {
	byte b0000;	// 0
	byte b0001;	// 1
	Eq_12012 t0002;	// 2
	Eq_12019 t0006;	// 6
} Eq_11883;

typedef byte (Eq_11911)(Eq_10505);

typedef byte (Eq_11936)(Eq_10505);

typedef Eq_12012 (Eq_12011)(Eq_10505);

typedef union Eq_12012 {
	byte u0;
	word32 u1;
} Eq_12012;

typedef bool (Eq_12016)(Eq_10749);

typedef Eq_12019 (Eq_12018)(Eq_10505);

typedef union Eq_12019 {
	byte u0;
	word32 u1;
} Eq_12019;

typedef bool (Eq_12023)(Eq_10749);

typedef Eq_10746 (Eq_12076)(Eq_10505);

typedef struct Eq_22823 {
	word32 dwFFFFFFF8;	// FFFFFFF8
	word32 dwFFFFFFFC;	// FFFFFFFC
	word32 dw0000;	// 0
} Eq_22823;

typedef Eq_10746 (Eq_22838)(Eq_10505);

typedef Eq_10746 (Eq_22957)(Eq_10505);

typedef void (Eq_22990)(word32, Eq_10505);

typedef Eq_23021 Eq_23014Eq_23035 Eq_23014Eq_23070 Eq_23014Eq_23074 Eq_23014Eq_10505 Eq_23014struct Eq_23014 {
	Eq_23021 * ptr0004;	// 4
	word32 dw000C;	// C
	word32 dw0010;	// 10
	Eq_23035 * ptr0018;	// 18
	Eq_23070 * ptr001C;	// 1C
	Eq_23074 * ptr0024;	// 24
	word32 dw002C;	// 2C
	word32 dw0030;	// 30
	Eq_10505 t0038;	// 38
} Eq_23014;

typedef struct Eq_23021 {
	word16 w0049;	// 49
} Eq_23021;

typedef struct Eq_23035 {
	byte b0072;	// 72
} Eq_23035;

typedef bool (Eq_23039)(word16, word16, word16 *);

typedef bool (Eq_23048)(Eq_11018, word16, word16 *);

typedef struct Eq_23070 {
	word16 w006E;	// 6E
} Eq_23070;

typedef struct Eq_23074 {
	word16 w0049;	// 49
} Eq_23074;

typedef bool (Eq_23083)(word16, word16, word16 *);

typedef bool (Eq_23092)(word16, word16, word16 *);

typedef union Eq_23101 {
	int32 u0;
	byte u1;
} Eq_23101;

typedef Eq_10505 Eq_23122struct Eq_23122 {
	Eq_10505 t0018;	// 18
} Eq_23122;

typedef Eq_10746 Eq_23261Eq_10746 Eq_23261Eq_10505 Eq_23261Eq_10716 Eq_23261struct Eq_23261 {
	Eq_10746 t0000;	// 0
	word32 dw0014;	// 14
	Eq_10746 t001C;	// 1C
	Eq_10505 t0030;	// 30
	Eq_10716 t003C;	// 3C
} Eq_23261;

typedef Eq_10746 (Eq_23291)(word32);

typedef Eq_10746 (Eq_23310)(Eq_10505);

typedef Eq_10505 Eq_23316struct Eq_23316 {
	Eq_10505 t000E;	// E
} Eq_23316;

typedef Eq_10746 (Eq_23348)(Eq_10505);

typedef struct Eq_23360 {
} Eq_23360;

typedef Eq_10746 (Eq_23368)(Eq_10505);

typedef Eq_23724 Eq_23373[]struct Eq_23373 {
	byte b0000;	// 0
	Eq_23724 a0064[];	// 64
} Eq_23373;

typedef byte (Eq_23376)(Eq_10505);

typedef void (Eq_23381)(Eq_10505, Eq_10505);

typedef bool (Eq_23383)(Eq_10749, word16, word16 *);

typedef Eq_10746 (Eq_23403)(Eq_10505);

typedef byte (Eq_23411)(Eq_10505);

typedef void (Eq_23416)(Eq_10505, Eq_10505);

typedef Eq_10505 Eq_23420Eq_10505 Eq_23420Eq_10581 Eq_23420Eq_10505 Eq_23420struct Eq_23420 {
	word32 dw0000;	// 0
	up32 dw0004;	// 4
	Eq_10505 t000C;	// C
	Eq_10505 t0010;	// 10
	Eq_10581 * ptr0014;	// 14
	Eq_10505 t0018;	// 18
} Eq_23420;

typedef bool (Eq_23453)(Eq_10749, word16, word16 *);

typedef void (Eq_23473)(Eq_10505, Eq_10505);

typedef void (Eq_23475)(Eq_10505, byte);

typedef Eq_10767 Eq_23481Eq_10505 Eq_23481Eq_10505 Eq_23481Eq_10581 Eq_23481Eq_10505 Eq_23481struct Eq_23481 {
	word32 dw0000;	// 0
	Eq_10767 * ptr0004;	// 4
	Eq_10505 t000C;	// C
	Eq_10505 t0010;	// 10
	Eq_10581 * ptr0014;	// 14
	Eq_10505 t0018;	// 18
} Eq_23481;

typedef void (Eq_23508)(Eq_10505, byte);

typedef Eq_10746 (Eq_23510)(Eq_10505);

typedef Eq_10767 Eq_23539Eq_10505 Eq_23539Eq_10505 Eq_23539Eq_10505 Eq_23539struct Eq_23539 {
	Eq_10767 * ptr0004;	// 4
	Eq_10505 t000C;	// C
	Eq_10505 t0010;	// 10
	word32 dw0014;	// 14
	Eq_10505 t0018;	// 18
} Eq_23539;

typedef void (Eq_23579)(Eq_10505, byte);

typedef void (Eq_23581)(Eq_10505, word16);

typedef bool (Eq_23595)(word16, word16, word16 *);

typedef void (Eq_23612)(Eq_10505, Eq_10505);

typedef void (Eq_23614)(Eq_10505, byte);

typedef void (Eq_23652)(Eq_10505, byte);

typedef void (Eq_23654)(Eq_10505, byte);

typedef void (Eq_23692)(Eq_10505, Eq_10505);

typedef void (Eq_23694)(Eq_10505, Eq_10505);

typedef void (Eq_23696)(Eq_10505, Eq_10505);

typedef bool (Eq_23700)(Eq_10749, word16, word16 *);

typedef struct Eq_23712 {	// size: 4 4
	byte b0000;	// 0
} Eq_23712;

typedef struct Eq_23714 {	// size: 4 4
	byte b0000;	// 0
} Eq_23714;

typedef struct Eq_23722 {	// size: 2 2
	byte b0000;	// 0
} Eq_23722;

typedef struct Eq_23724 {	// size: 2 2
	byte b0000;	// 0
} Eq_23724;

typedef struct Eq_23726 {	// size: 2 2
	byte b0000;	// 0
} Eq_23726;

typedef Eq_10749 Eq_23729[]Eq_23101struct Eq_23729 {
	Eq_10749 a0000[];	// 0
	byte b0045;	// 45
	int32 dw0065;	// 65
	byte b0068;	// 68
	Eq_23101 t0072;	// 72
	int32 dw0074;	// 74
} Eq_23729;

typedef Eq_10505 Eq_23730Eq_10746 Eq_23730Eq_11128 Eq_23730Eq_11403 Eq_23730[]Eq_11018struct Eq_23730 {
	Eq_10505 tFFFFFFFC;	// FFFFFFFC
	Eq_10746 t0000;	// 0
	byte b0001;	// 1
	Eq_11128 t0004;	// 4
	Eq_11403 a0065[];	// 65
	int32 dw0067;	// 67
	byte b0069;	// 69
	byte b006C;	// 6C
	Eq_11018 t006E;	// 6E
	byte b006F;	// 6F
} Eq_23730;

typedef struct Eq_23731 {
	byte b006C;	// 6C
} Eq_23731;

typedef struct Eq_23732 {	// size: 4 4
	byte b0000;	// 0
} Eq_23732;

typedef union Eq_23733 {
	int32 u0;
	bcu8 u1;
} Eq_23733;

