// subject.h
// Generated on TIMESTAMP by decompiling from_pouet.net/with_source_316/ia32_com/subject.exe
// using Decompiler version VERSION

/*
// Equivalence classes ////////////
Eq_1: (struct "Globals" (FFFA0000 (ptr Eq_146) ptrFFFA0000))
	globals_t (in globals : (ptr (struct "Globals")))
Eq_2: (fn void (byte))
	T_2 (in bios_video_set_mode : ptr32)
	T_3 (in signature of bios_video_set_mode : void)
Eq_7: (fn void (word16, byte))
	T_7 (in __outb : ptr32)
Eq_27: (fn void (word16, byte))
	T_27 (in __outb : ptr32)
Eq_30: (fn void (word16, byte))
	T_30 (in __outb : ptr32)
Eq_33: (fn void (word16, byte))
	T_33 (in __outb : ptr32)
Eq_46: (segment "Eq_46" (64 Eq_50 t0064) (2C1 word16 w02C1) (2C3 word16 w02C3) (2C5 word16 w02C5) (2C7 int16 w02C7) (2C9 word16 w02C9) (2CB word16 w02CB) (2CD word16 w02CD) (2CF word16 w02CF) (2D1 Eq_395 t02D1) (2D5 word16 w02D5) (2D7 word16 w02D7) (2D9 word16 w02D9) (2DB word16 w02DB) (2DD int16 w02DD) (2DF int16 w02DF) (2E1 int16 w02E1) (2E3 int16 w02E3) (2E5 word16 w02E5) (2E7 word16 w02E7) (2E9 word16 w02E9) (2EB Eq_215 t02EB))
	T_46 (in ds : (ptr Eq_46))
	T_95 (in ds : (ptr Eq_46))
	T_195 (in ds : (ptr Eq_46))
Eq_50: (segment "Eq_50" (0 (arr word16) a0000))
	T_50 (in es_151 : (ptr Eq_50))
	T_51 (in ds + 0x0064 : word16)
	T_94 (in es : (ptr Eq_50))
Eq_89: (fn void (word32, word32, word32, (ptr Eq_50), (ptr Eq_46)))
	T_89 (in fn0C00_01E1 : ptr32)
	T_90 (in signature of fn0C00_01E1 : void)
	T_99 (in fn0C00_01E1 : ptr32)
Eq_137: (fn byte (byte))

  Class: Eq_403
  DataType: word16
  OrigDataType: word16
T_404: (in ds->w02E1 + 0x0062 : word16)
  Class: Eq_404
  DataType: uint16
  OrigDataType: uint16
T_405: (in 0x0140 : word16)
  Class: Eq_405
  DataType: uint16
  OrigDataType: uint16
T_406: (in (ds->w02E1 + 0x0062) *u 0x0140 : uint32)
  Class: Eq_406
  DataType: uint32
  OrigDataType: uint32
T_407: (in (word16) ((ds->w02E1 + 0x0062) *u 0x0140) : word16)
  Class: Eq_407
  DataType: word16
  OrigDataType: word16
T_408: (in 0x00A0 : word16)
  Class: Eq_408
  DataType: word16
  OrigDataType: word16
T_409: (in (word16) ((ds->w02E1 + 0x0062) *u 0x0140) + 0x00A0 : word16)
  Class: Eq_409
  DataType: word16
  OrigDataType: word16
T_410: (in 0x02DF : word16)
  Class: Eq_410
  DataType: (memptr (ptr Eq_46) int16)
  OrigDataType: (memptr T_95 (struct (0 T_411 t0000)))
T_411: (in Mem78[ds:0x02DF:word16] : word16)
  Class: Eq_280
  DataType: int16
  OrigDataType: word16
T_412: (in (word16) ((ds->w02E1 + 0x0062) *u 0x0140) + 0x00A0 + ds->w02DF : word16)
  Class: Eq_400
  DataType: (memptr (ptr Eq_50) bcu8)
  OrigDataType: word16
T_413: (in 0x02DD : word16)
  Class: Eq_413
  DataType: (memptr (ptr Eq_46) int16)
  OrigDataType: (memptr T_95 (struct (0 T_414 t0000)))
T_414: (in Mem78[ds:0x02DD:word16] : word16)
  Class: Eq_366
  DataType: int16
  OrigDataType: word16
T_415: (in SLICE(ds->w02DD, byte, 8) : byte)
  Class: Eq_415
  DataType: byte
  OrigDataType: byte
T_416: (in 0x00 : byte)
  Class: Eq_415
  DataType: byte
  OrigDataType: byte
T_417: (in SLICE(ds->w02DD, byte, 8) == 0x00 : bool)
  Class: Eq_417
  DataType: bool
  OrigDataType: bool
T_418: (in 0x0000 : word16)
  Class: Eq_418
  DataType: word16
  OrigDataType: word16
T_419: (in bx_86 + 0x0000 : word16)
  Class: Eq_419
  DataType: word16
  OrigDataType: word16
T_420: (in Mem78[es:bx_86 + 0x0000:byte] : byte)
  Class: Eq_420
  DataType: bcu8
  OrigDataType: bcu8
T_421: (in 0xFA : byte)
  Class: Eq_420
  DataType: bcu8
  OrigDataType: bcu8
T_422: (in es->*bx_86 >u 0xFA : bool)
  Class: Eq_422
  DataType: bool
  OrigDataType: bool
T_423: (in 0xFA : byte)
  Class: Eq_420
  DataType: bcu8
  OrigDataType: byte
T_424: (in 0x0000 : word16)
  Class: Eq_424
  DataType: word16
  OrigDataType: word16
T_425: (in bx_86 + 0x0000 : word16)
  Class: Eq_425
  DataType: word16
  OrigDataType: word16
T_426: (in Mem100[es:bx_86 + 0x0000:byte] : byte)
  Class: Eq_420
  DataType: bcu8
  OrigDataType: byte
T_427:
  Class: Eq_427
  DataType: word16
  OrigDataType: (struct 0002 (0 T_74 t0000))
T_428:
  Class: Eq_427
  DataType: word16
  OrigDataType: (struct 0002 (0 T_145 t0000))
T_429:
  Class: Eq_429
  DataType: word16
  OrigDataType: (struct 0002 (0 T_149 t0000))
*/
typedef Eq_146 Eq_1struct Globals {
	Eq_146 * ptrFFFA0000;	// FFFA0000
} Eq_1;

typedef void (Eq_2)(byte);

typedef void (Eq_7)(word16, byte);

typedef void (Eq_27)(word16, byte);

typedef void (Eq_30)(word16, byte);

typedef void (Eq_33)(word16, byte);

typedef Eq_50 Eq_46Eq_395 Eq_46Eq_215 Eq_46struct Eq_46 {
	Eq_50 t0064;	// 64
	word16 w02C1;	// 2C1
	word16 w02C3;	// 2C3
	word16 w02C5;	// 2C5
	int16 w02C7;	// 2C7
	word16 w02C9;	// 2C9
	word16 w02CB;	// 2CB
	word16 w02CD;	// 2CD
	word16 w02CF;	// 2CF
	Eq_395 t02D1;	// 2D1
	word16 w02D5;	// 2D5
	word16 w02D7;	// 2D7
	word16 w02D9;	// 2D9
	word16 w02DB;	// 2DB
	int16 w02DD;	// 2DD
	int16 w02DF;	// 2DF
	int16 w02E1;	// 2E1
	int16 w02E3;	// 2E3
	word16 w02E5;	// 2E5
	word16 w02E7;	// 2E7
	word16 w02E9;	// 2E9
	Eq_215 t02EB;	// 2EB
} Eq_46;

typedef  Eq_50[]struct Eq_50 {
	word16 a0000[];	// 0
} Eq_50;

typedef void (Eq_89)(word32, word32, word32, Eq_50 *, Eq_46 *);

typedef byte (Eq_137)(byte);

typedef  Eq_146[]struct Eq_146 {
	word16 a0000[];	// 0
} Eq_146;

typedef void (Eq_159)();

typedef struct Eq_177 {
	word16 w0002;	// 2
	word16 w0004;	// 4
	word16 w0006;	// 6
} Eq_177;

typedef struct Eq_183 {
} Eq_183;

typedef Eq_215 (Eq_211)(real64);

typedef union Eq_215 {
	real16 u0;
	real32 u1;
	real64 u2;
} Eq_215;

typedef real64 (Eq_219)(real64, real64);

typedef union Eq_232 {
	real16 u0;
	real64 u1;
} Eq_232;

typedef union Eq_235 {
	real16 u0;
	real64 u1;
} Eq_235;

typedef union Eq_236 {
	real16 u0;
	real64 u1;
} Eq_236;

typedef union Eq_238 {
	real16 u0;
	real64 u1;
} Eq_238;

typedef Eq_238 (Eq_239)(real64);

typedef Eq_242 (Eq_241)(real64);

typedef union Eq_242 {
	real16 u0;
	real64 u1;
} Eq_242;

typedef struct Eq_257 {
	int16 w0002;	// 2
	int16 w0004;	// 4
} Eq_257;

