// subject.h
// Generated on TIMESTAMP by decompiling from_pouet.net/with_source_286/ia32_com/subject.exe
// using Decompiler version VERSION

/*
// Equivalence classes ////////////
Eq_1: (struct "Globals" (FFFA0000 (ptr Eq_121) ptrFFFA0000))
	globals_t (in globals : (ptr (struct "Globals")))
Eq_2: (fn void (byte))
	T_2 (in bios_video_set_mode : ptr32)
	T_3 (in signature of bios_video_set_mode : void)
	T_394 (in bios_video_set_mode : ptr32)
Eq_7: (fn void (word16, byte))
	T_7 (in __outb : ptr32)
Eq_21: (fn void (word16, uint16))
	T_21 (in __outb : ptr32)
Eq_28: (fn void (word16, byte))
	T_28 (in __outb : ptr32)
Eq_32: (fn void (word16, byte))
	T_32 (in __outb : ptr32)
Eq_51: (fn void (word16, byte))
	T_51 (in __outb : ptr32)
Eq_58: (fn void (word16, byte))
	T_58 (in __outb : ptr32)
Eq_64: (fn void (word16, byte))
	T_64 (in __outb : ptr32)
Eq_80: (fn void (word16, byte))
	T_80 (in __outb : ptr32)
Eq_84: (fn void (word16, byte))
	T_84 (in __outb : ptr32)
Eq_93: (fn void (word16, byte))
	T_93 (in __outb : ptr32)
Eq_111: (fn byte ((ptr byte), (ptr byte), (ptr byte)))
	T_111 (in msdos_get_system_time : ptr32)
	T_112 (in signature of msdos_get_system_time : void)
Eq_121: (segment "Eq_121" (FFFFA000 (struct "Eq_256" 0001 (0 Eq_146 t0000)) tFFFFA000) (0 (arr uint16) a0000) (1FF byte b01FF) (200 (arr Eq_402) a0200) (7FA0 (arr Eq_146) a7FA0) (8040 word16 w8040) (A000 Eq_256 tA000))
	T_121 (in ds : (ptr Eq_121))
	T_148 (in 0xA000 : selector)

T_383: (in cx_348 != 0x0001 : bool)
  Class: Eq_383
  DataType: bool
  OrigDataType: bool
T_384: (in 0x0000 : word16)
  Class: Eq_146
  DataType: word16
  OrigDataType: word16
T_385: (in 0x0000 : word16)
  Class: Eq_385
  DataType: word16
  OrigDataType: word16
T_386: (in di_229 + 0x0000 : word16)
  Class: Eq_386
  DataType: word16
  OrigDataType: word16
T_387: (in Mem342[0xA000:di_229 + 0x0000:word16] : word16)
  Class: Eq_146
  DataType: Eq_146
  OrigDataType: word16
T_388: (in 0x0002 : word16)
  Class: Eq_388
  DataType: word16
  OrigDataType: word16
T_389: (in di_229 + 0x0002 : word16)
  Class: Eq_256
  DataType: (memptr (ptr Eq_121) Eq_256)
  OrigDataType: word16
T_390: (in 0x0001 : word16)
  Class: Eq_390
  DataType: word16
  OrigDataType: word16
T_391: (in cx_262 - 0x0001 : word16)
  Class: Eq_287
  DataType: word16
  OrigDataType: word16
T_392: (in 0x0000 : word16)
  Class: Eq_287
  DataType: word16
  OrigDataType: word16
T_393: (in cx_262 == 0x0000 : bool)
  Class: Eq_393
  DataType: bool
  OrigDataType: bool
T_394: (in bios_video_set_mode : ptr32)
  Class: Eq_2
  DataType: (ptr Eq_2)
  OrigDataType: (ptr (fn T_396 (T_395)))
T_395: (in 0x03 : byte)
  Class: Eq_4
  DataType: byte
  OrigDataType: byte
T_396: (in bios_video_set_mode(0x03) : void)
  Class: Eq_6
  DataType: void
  OrigDataType: void
T_397: (in msdos_terminate_program20 : ptr32)
  Class: Eq_397
  DataType: (ptr Eq_397)
  OrigDataType: (ptr (fn T_399 ()))
T_398: (in signature of msdos_terminate_program20 : void)
  Class: Eq_397
  DataType: (ptr Eq_397)
  OrigDataType: 
T_399: (in msdos_terminate_program20() : void)
  Class: Eq_399
  DataType: void
  OrigDataType: void
T_400:
  Class: Eq_400
  DataType: uint16
  OrigDataType: (struct 0002 (0 T_127 t0000))
T_401:
  Class: Eq_401
  DataType: uint16
  OrigDataType: (struct 0002 (0 T_152 t0000))
T_402:
  Class: Eq_402
  DataType: Eq_402
  OrigDataType: (struct 0001 (0 T_189 t0000))
T_403:
  Class: Eq_402
  DataType: Eq_402
  OrigDataType: (struct 0001 (0 T_269 t0000))
T_404:
  Class: Eq_404
  DataType: Eq_146
  OrigDataType: (struct 0002 (0 T_294 t0000))
T_405:
  Class: Eq_405
  DataType: Eq_405
  OrigDataType: 
T_406:
  Class: Eq_406
  DataType: Eq_406
  OrigDataType: 
T_407:
  Class: Eq_407
  DataType: Eq_407
  OrigDataType: 
T_408:
  Class: Eq_408
  DataType: Eq_408
  OrigDataType: 
*/
typedef Eq_121 Eq_1struct Globals {
	Eq_121 * ptrFFFA0000;	// FFFA0000
} Eq_1;

typedef void (Eq_2)(byte);

typedef void (Eq_7)(word16, byte);

typedef void (Eq_21)(word16, uint16);

typedef void (Eq_28)(word16, byte);

typedef void (Eq_32)(word16, byte);

typedef void (Eq_51)(word16, byte);

typedef void (Eq_58)(word16, byte);

typedef void (Eq_64)(word16, byte);

typedef void (Eq_80)(word16, byte);

typedef void (Eq_84)(word16, byte);

typedef void (Eq_93)(word16, byte);

typedef byte (Eq_111)(byte *, byte *, byte *);

typedef struct Eq_256;
 Eq_121[]Eq_402[]Eq_146[]Eq_256struct Eq_121 {
	struct Eq_256 tFFFFA000;	// FFFFA000
	uint16 a0000[];	// 0
	byte b01FF;	// 1FF
	Eq_402 a0200[];	// 200
	Eq_146 a7FA0[];	// 7FA0
	word16 w8040;	// 8040
	Eq_256 tA000;	// A000
} Eq_121;

typedef  Eq_124[]struct Eq_124 {
	uint16 a0200[];	// 200
} Eq_124;

typedef Eq_146 Eq_139struct Eq_139 {	// size: 1 1
	Eq_146 t0000;	// 0
} Eq_139;

typedef union Eq_142 {
	uint16 u0;
	Eq_405 Eq_121::* u1;
} Eq_142;

typedef union Eq_146 {
	byte u0;
	word16 u1;
} Eq_146;

typedef struct Eq_161 {
} Eq_161;

typedef union Eq_162 {
	Eq_406 Eq_161::* u0;
	Eq_408 u1;
} Eq_162;

typedef struct Eq_179 {	// size: 1 1
	byte bFFFFFFFE;	// FFFFFFFE
	byte b0000;	// 0
	byte b009F;	// 9F
} Eq_179;

typedef byte (Eq_240)(word16);

typedef byte (Eq_248)(word16);

typedef struct Eq_256 Eq_256;

typedef byte (Eq_282)(byte *);

typedef byte (Eq_312)(byte, byte, bool);

typedef byte (Eq_318)(byte, byte, bool);

typedef byte (Eq_326)(byte, byte, bool);

typedef void (Eq_397)();

typedef Eq_146 Eq_402struct Eq_402 {	// size: 1 1
	Eq_146 t0000;	// 0
} Eq_402;

typedef struct Eq_405 {
	byte b7FA0;	// 7FA0
} Eq_405;

typedef struct Eq_406 {
	word16 wFFFFFFFE;	// FFFFFFFE
} Eq_406;

typedef Eq_139struct Eq_407 {
	Eq_139 Eq_121::*ptrFFFFFFFC;	// FFFFFFFC
} Eq_407;

typedef union Eq_408 {
	ptr16 u0;
	Eq_407 Eq_161::* u1;
} Eq_408;

