// subject.h
// Generated on TIMESTAMP by decompiling from_pouet.net/with_source_363/ia32_com/subject.exe
// using Decompiler version VERSION

/*
// Equivalence classes ////////////
Eq_1: (struct "Globals" (FFFA0000 (ptr Eq_112) ptrFFFA0000))
	globals_t (in globals : (ptr (struct "Globals")))
Eq_2: (fn void (byte))
	T_2 (in bios_video_set_mode : ptr32)
	T_3 (in signature of bios_video_set_mode : void)
Eq_7: (union "Eq_7" (int16 u0) (uint8 u1) (uint16 u2) ((memptr (ptr Eq_112) byte) u3))
	T_7 (in 0x00 : byte)
	T_10 (in Mem3[ds:0x0109:byte] : byte)
	T_11 (in 0x00 : byte)
	T_13 (in Mem5[ds:0x0105:byte] : byte)
	T_16 (in Mem25[ds:0x0109:byte] : byte)
	T_17 (in al_193 : Eq_7)
	T_23 (in al_189 : Eq_7)
	T_25 (in Mem25[ds:0x010B:byte] : byte)
	T_26 (in al_36 + ds->t010B : byte)
	T_28 (in Mem25[ds:0x0105:byte] : byte)
	T_29 (in 0x00 : byte)
	T_32 (in Mem192[ds:0x010B:byte] : byte)
	T_33 (in 0x00 : byte)
	T_37 (in al_44 : Eq_7)
	T_39 (in Mem25[ds:0x010B:byte] : byte)
	T_43 (in cx_15 : Eq_7)
	T_45 (in cx_15 - 0x0001 : word16)
	T_46 (in 0x0000 : word16)
	T_49 (in Mem25[ds:0x0103:byte] : byte)
	T_52 (in Mem18[ds:0x0105:byte] : byte)
	T_57 (in Mem25[ds:0x0103:word16] : word16)
	T_61 (in Mem25[ds:0x0103:byte] : byte)
	T_65 (in Mem25[ds:0x0103:byte] : byte)
	T_67 (in Mem25[ds:0x0105:byte] : byte)
	T_68 (in 0x02 : byte)
	T_70 (in 0x01 : byte)
	T_72 (in Mem50[ds:0x0109:byte] : byte)
	T_74 (in Mem50[ds:0x0105:byte] : byte)
	T_76 (in Mem50[ds:0x0105:byte] + 0x01 : byte)

  Class: Eq_650
  DataType: byte
  OrigDataType: byte
T_651: (in ds->t010F - (byte) dx_102 : byte)
  Class: Eq_188
  DataType: Eq_188
  OrigDataType: byte
T_652: (in Mem110[ds:0x010F:byte] : byte)
  Class: Eq_188
  DataType: Eq_188
  OrigDataType: byte
T_653: (in al_107 : byte)
  Class: Eq_653
  DataType: byte
  OrigDataType: byte
T_654: (in (byte) ax_105 : byte)
  Class: Eq_653
  DataType: byte
  OrigDataType: byte
T_655: (in 0x010F : word16)
  Class: Eq_655
  DataType: (memptr (ptr Eq_8) Eq_188)
  OrigDataType: (memptr T_245 (struct (0 T_656 t0000)))
T_656: (in Mem110[ds:0x010F:byte] : byte)
  Class: Eq_188
  DataType: Eq_188
  OrigDataType: int8
T_657: (in 0x00 : byte)
  Class: Eq_188
  DataType: int8
  OrigDataType: int8
T_658: (in ds->t010F >= 0x00 : bool)
  Class: Eq_658
  DataType: bool
  OrigDataType: bool
T_659: (in 0x0001 : word16)
  Class: Eq_659
  DataType: word16
  OrigDataType: word16
T_660: (in bx_114 + 0x0001 : word16)
  Class: Eq_7
  DataType: Eq_7
  OrigDataType: word16
T_661: (in 0x0109 : word16)
  Class: Eq_661
  DataType: (memptr (ptr Eq_8) Eq_7)
  OrigDataType: (memptr T_245 (struct (0 T_662 t0000)))
T_662: (in Mem110[ds:0x0109:word16] : word16)
  Class: Eq_7
  DataType: Eq_7
  OrigDataType: int16
T_663: (in bx_114 <= ds->t0109 : bool)
  Class: Eq_663
  DataType: bool
  OrigDataType: bool
T_664: (in 0x0105 : word16)
  Class: Eq_664
  DataType: (memptr (ptr Eq_8) Eq_7)
  OrigDataType: (memptr T_245 (struct (0 T_528 t0000)))
T_665: (in Mem110[ds:0x0105:word16] : word16)
  Class: Eq_7
  DataType: Eq_7
  OrigDataType: word16
T_666: (in 0x010B : word16)
  Class: Eq_666
  DataType: (memptr (ptr Eq_8) Eq_7)
  OrigDataType: (memptr T_245 (struct (0 T_667 t0000)))
T_667: (in Mem110[ds:0x010B:word16] : word16)
  Class: Eq_7
  DataType: Eq_7
  OrigDataType: word16
T_668: (in Mem110[ds:0x0105:word16] + Mem110[ds:0x010B:word16] : word16)
  Class: Eq_7
  DataType: Eq_7
  OrigDataType: word16
T_669: (in Mem119[ds:0x0105:word16] : word16)
  Class: Eq_7
  DataType: Eq_7
  OrigDataType: word16
T_670: (in 0x010F : word16)
  Class: Eq_670
  DataType: (memptr (ptr Eq_8) Eq_188)
  OrigDataType: (memptr T_245 (struct (0 T_606 t0000)))
T_671: (in Mem119[ds:0x010F:byte] : byte)
  Class: Eq_188
  DataType: Eq_188
  OrigDataType: byte
T_672: (in Mem119[ds:0x010F:byte] + al_107 : byte)
  Class: Eq_188
  DataType: Eq_188
  OrigDataType: byte
T_673: (in Mem121[ds:0x010F:byte] : byte)
  Class: Eq_188
  DataType: Eq_188
  OrigDataType: byte
T_674: (in 0x0111 : word16)
  Class: Eq_674
  DataType: (memptr (ptr Eq_8) Eq_7)
  OrigDataType: (memptr T_245 (struct (0 T_675 t0000)))
T_675: (in Mem68[ds:0x0111:word16] : word16)
  Class: Eq_7
  DataType: Eq_7
  OrigDataType: word16
T_676: (in 0x0001 : word16)
  Class: Eq_7
  DataType: int16
  OrigDataType: word16
T_677: (in ds->t0111 == 0x0001 : bool)
  Class: Eq_677
  DataType: bool
  OrigDataType: bool
*/
typedef Eq_112 Eq_1struct Globals {
	Eq_112 * ptrFFFA0000;	// FFFA0000
} Eq_1;

typedef void (Eq_2)(byte);

typedef union Eq_7 {
	int16 u0;
	uint8 u1;
	uint16 u2;
	byte Eq_112::* u3;
} Eq_7;

typedef Eq_7 Eq_8Eq_7 Eq_8Eq_7 Eq_8Eq_7 Eq_8Eq_188 Eq_8Eq_7 Eq_8Eq_463 Eq_8struct Eq_8 {
	Eq_7 t0103;	// 103
	Eq_7 t0105;	// 105
	int16 w0107;	// 107
	Eq_7 t0109;	// 109
	Eq_7 t010B;	// 10B
	Eq_188 t010F;	// 10F
	Eq_7 t0111;	// 111
	byte b0113;	// 113
	real32 r0114;	// 114
	Eq_463 t0118;	// 118
} Eq_8;

typedef void (Eq_20)(word16, byte);

typedef void (Eq_34)(word16, Eq_7);

typedef void (Eq_40)(word16, Eq_7);

typedef void (Eq_58)(word16, byte);

typedef void (Eq_88)(word16, byte);

typedef void (Eq_93)(word16, byte);

typedef void (Eq_100)(word16, Eq_7);

typedef void (Eq_103)(word16, Eq_7);

typedef void (Eq_110)(Eq_112 *, Eq_8 *);

typedef struct Eq_112 {
	byte bFFFFF9FF;	// FFFFF9FF
	byte bF9FF;	// F9FF
} Eq_112;

typedef struct Eq_126 {	// size: 320 140
	byte b0000;	// 0
} Eq_126;

typedef union Eq_142 {
	real16 u0;
	real64 u1;
} Eq_142;

typedef Eq_142 (Eq_143)(real16);

typedef union Eq_146 {
	real16 u0;
	real64 u1;
} Eq_146;

typedef union Eq_149 {
	real16 u0;
	real64 u1;
} Eq_149;

typedef union Eq_157 {
	real16 u0;
	real64 u1;
} Eq_157;

typedef Eq_186 (Eq_178)(real16);

typedef union Eq_181 {
	real16 u0;
	real64 u1;
} Eq_181;

typedef union Eq_184 {
	real16 u0;
	real64 u1;
} Eq_184;

typedef union Eq_186 {
	real16 u0;
	real64 u1;
} Eq_186;

typedef union Eq_188 {
	int8 u0;
	uint8 u1;
	word16 u2;
} Eq_188;

typedef union Eq_189 {
	real16 u0;
	real64 u1;
} Eq_189;

typedef void (Eq_242)(Eq_112 *, Eq_8 *);

typedef real64 (Eq_449)(real16);

typedef union Eq_452 {
	real16 u0;
	real64 u1;
} Eq_452;

typedef union Eq_455 {
	real16 u0;
	real64 u1;
} Eq_455;

typedef union Eq_463 {
	32 u0;
	64 u1;
	real32 u2;
	real64 u3;
	word16 u4;
} Eq_463;

