// subject.h
// Generated on TIMESTAMP by decompiling from_pouet.net/with_source_275/ia32_com/subject.exe
// using Decompiler version VERSION

/*
// Equivalence classes ////////////
Eq_1: (struct "Globals")
	globals_t (in globals : (ptr (struct "Globals")))
Eq_2: (fn void (byte))
	T_2 (in bios_video_set_mode : ptr32)
	T_3 (in signature of bios_video_set_mode : void)
Eq_7: (fn void (word16, byte))
	T_7 (in __outb : ptr32)
Eq_13: (fn void (word16, byte))
	T_13 (in __outb : ptr32)
Eq_17: (fn void (word16, byte))
	T_17 (in __outb : ptr32)
Eq_25: (fn word16 (word16, byte))
	T_25 (in __ror : ptr32)
Eq_30: (fn void (word16, byte))
	T_30 (in __outb : ptr32)
Eq_40: (fn word16 (word16, byte))
	T_40 (in __rol : ptr32)
Eq_44: (fn word16 (word16, byte))
	T_44 (in __ror : ptr32)
Eq_54: (union "Eq_54" (ptr32 u0) (segptr32 u1))
	T_54 (in es_bp_61 : ptr32)
	T_59 (in Mem0[ds:bx + 0x0000:segptr32] : segptr32)
Eq_55: (segment "Eq_55" (0 bcu8 b0000) (1F8 Eq_206 t01F8) (1FC (memptr (ptr Eq_55) bcu8) ptr01FC) (1FE word16 w01FE) (200 int32 dw0200) (204 Eq_220 t0204) (206 uint16 w0206) (208 Eq_208 t0208) (20A word32 dw020A))
	T_55 (in ds : (ptr Eq_55))
	T_132 (in bp_63 << 0x0001 : word16)
	T_138 (in bp_63 << 0x0001 : word16)
	T_154 (in bp_63 << 0x0001 : word16)
Eq_62: (segment "Eq_62" (10 (arr bcu8) a0010))
	T_62 (in es_62 : (ptr Eq_62))
	T_63 (in SLICE(es_bp_61, selector, 16) : selector)
Eq_64: (union "Eq_64" (ui16 u0) ((memptr (ptr Eq_115) byte) u1))
	T_64 (in bp_147 : Eq_64)

T_265: (in 0x0001 : word16)
  Class: Eq_265
  DataType: word16
  OrigDataType: word16
T_266: (in cx - 0x0001 : word16)
  Class: Eq_144
  DataType: word16
  OrigDataType: word16
T_267: (in cx - 0x0001 : word16)
  Class: Eq_267
  DataType: word16
  OrigDataType: word16
T_268: (in (byte) (cx - 0x0001) : byte)
  Class: Eq_117
  DataType: byte
  OrigDataType: byte
T_269: (in di_217 : (memptr (ptr Eq_62) bcu8))
  Class: Eq_269
  DataType: (memptr (ptr Eq_62) bcu8)
  OrigDataType: (memptr T_62 (struct 0001 (0 T_281 t0000)))
T_270: (in 0x0010 : word16)
  Class: Eq_269
  DataType: (memptr (ptr Eq_62) bcu8)
  OrigDataType: word16
T_271: (in __inb : ptr32)
  Class: Eq_271
  DataType: (ptr Eq_271)
  OrigDataType: (ptr (fn T_273 (T_272)))
T_272: (in 0x60 : byte)
  Class: Eq_272
  DataType: byte
  OrigDataType: byte
T_273: (in __inb(0x60) : byte)
  Class: Eq_273
  DataType: byte
  OrigDataType: byte
T_274: (in 0x01 : byte)
  Class: Eq_273
  DataType: byte
  OrigDataType: byte
T_275: (in __inb(0x60) != 0x01 : bool)
  Class: Eq_275
  DataType: bool
  OrigDataType: bool
T_276: (in 0x0000 : word16)
  Class: Eq_276
  DataType: word16
  OrigDataType: word16
T_277: (in si_144 + 0x0000 : word16)
  Class: Eq_277
  DataType: word16
  OrigDataType: word16
T_278: (in Mem201[ds:si_144 + 0x0000:byte] : byte)
  Class: Eq_131
  DataType: bcu8
  OrigDataType: byte
T_279: (in 0x0000 : word16)
  Class: Eq_279
  DataType: word16
  OrigDataType: word16
T_280: (in di_217 + 0x0000 : word16)
  Class: Eq_280
  DataType: word16
  OrigDataType: word16
T_281: (in Mem223[es_62:di_217 + 0x0000:byte] : byte)
  Class: Eq_131
  DataType: bcu8
  OrigDataType: byte
T_282: (in 0x0001 : word16)
  Class: Eq_282
  DataType: word16
  OrigDataType: word16
T_283: (in cx - 0x0001 : word16)
  Class: Eq_144
  DataType: word16
  OrigDataType: word16
T_284: (in 0x0001 : word16)
  Class: Eq_284
  DataType: word16
  OrigDataType: word16
T_285: (in si_144 + 0x0001 : word16)
  Class: Eq_67
  DataType: (memptr (ptr Eq_55) bcu8)
  OrigDataType: word16
T_286: (in 0x0001 : word16)
  Class: Eq_286
  DataType: word16
  OrigDataType: word16
T_287: (in di_217 + 0x0001 : word16)
  Class: Eq_269
  DataType: (memptr (ptr Eq_62) bcu8)
  OrigDataType: word16
T_288: (in (byte) cx : byte)
  Class: Eq_117
  DataType: byte
  OrigDataType: byte
T_289: (in 0x0000 : word16)
  Class: Eq_144
  DataType: word16
  OrigDataType: word16
T_290: (in cx == 0x0000 : bool)
  Class: Eq_290
  DataType: bool
  OrigDataType: bool
T_291: (in 0x01FC : word16)
  Class: Eq_291
  DataType: (memptr (ptr Eq_55) (memptr (ptr Eq_55) bcu8))
  OrigDataType: (memptr T_55 (struct (0 T_292 t0000)))
T_292: (in Mem0[ds:0x01FC:word16] : word16)
  Class: Eq_67
  DataType: (memptr (ptr Eq_55) bcu8)
  OrigDataType: word16
T_293:
  Class: Eq_293
  DataType: Eq_293
  OrigDataType: (struct 0001 (0 T_182 t0000))
T_294:
  Class: Eq_294
  DataType: Eq_294
  OrigDataType: (struct 0140 (0 T_239 t0000))
T_295:
  Class: Eq_295
  DataType: bcu8
  OrigDataType: (struct 0001 (0 T_281 t0000))
*/
typedef struct Globals {
} Eq_1;

typedef void (Eq_2)(byte);

typedef void (Eq_7)(word16, byte);

typedef void (Eq_13)(word16, byte);

typedef void (Eq_17)(word16, byte);

typedef word16 (Eq_25)(word16, byte);

typedef void (Eq_30)(word16, byte);

typedef word16 (Eq_40)(word16, byte);

typedef word16 (Eq_44)(word16, byte);

typedef union Eq_54 {
	ptr32 u0;
	segptr32 u1;
} Eq_54;

typedef Eq_206 Eq_55Eq_220 Eq_55Eq_208 Eq_55struct Eq_55 {
	bcu8 b0000;	// 0
	Eq_206 t01F8;	// 1F8
	bcu8 Eq_55::*ptr01FC;	// 1FC
	word16 w01FE;	// 1FE
	int32 dw0200;	// 200
	Eq_220 t0204;	// 204
	uint16 w0206;	// 206
	Eq_208 t0208;	// 208
	word32 dw020A;	// 20A
} Eq_55;

typedef  Eq_62[]struct Eq_62 {
	bcu8 a0010[];	// 10
} Eq_62;

typedef union Eq_64 {
	ui16 u0;
	byte Eq_115::* u1;
} Eq_64;

typedef struct Eq_72 {
	int16 w0000;	// 0
	int16 w0002;	// 2
	word32 dw0004;	// 4
	word16 w0008;	// 8
} Eq_72;

typedef word64 (Eq_79)();

typedef word32 (Eq_105)(word32);

typedef Eq_180 Eq_115Eq_293 Eq_115[2]struct Eq_115 {
	Eq_180 t0000;	// 0
	Eq_293 a0204[2];	// 204
} Eq_115;

typedef real64 (Eq_168)(Eq_169);

typedef union Eq_169 {
	real16 u0;
	real64 u1;
} Eq_169;

typedef union Eq_172 {
	real16 u0;
	real64 u1;
} Eq_172;

typedef union Eq_175 {
	real16 u0;
	real64 u1;
} Eq_175;

typedef union Eq_176 {
	real16 u0;
	real64 u1;
} Eq_176;

typedef struct Eq_180 {	// size: 1 1
	int16 w0000;	// 0
} Eq_180;

typedef Eq_169 (Eq_190)(Eq_169);

typedef Eq_200 Eq_192struct Eq_192 {
	Eq_200 t0004;	// 4
	int16 w0008;	// 8
} Eq_192;

typedef union Eq_195 {
	real16 u0;
	real64 u1;
} Eq_195;

typedef union Eq_198 {
	real16 u0;
	real64 u1;
} Eq_198;

typedef union Eq_199 {
	real16 u0;
	real64 u1;
} Eq_199;

typedef union Eq_200 {
	real32 u0;
	real64 u1;
} Eq_200;

typedef union Eq_204 {
	real16 u0;
	real64 u1;
} Eq_204;

typedef union Eq_206 {
	real16 u0;
	real32 u1;
} Eq_206;

typedef union Eq_208 {
	int16 u0;
	byte u1;
} Eq_208;

typedef union Eq_220 {
	int16 u0;
	cups16 u1;
} Eq_220;

typedef union Eq_233 {
	ui16 u0;
