// subject.h
// Generated on TIMESTAMP by decompiling malware_via_email/malware_1133/ia32_pe/subject.exe
// using Decompiler version VERSION

/*
// Equivalence classes ////////////
Eq_1: (struct "Globals" (405000 up32 dw405000) (405004 word32 dw405004) (4090CC Eq_14 t4090CC) (4090D0 word32 dw4090D0) (4090D4 word32 dw4090D4) (4090D8 Eq_14 t4090D8) (4090DC word32 dw4090DC) (4090E0 word32 dw4090E0) (4090E4 word32 dw4090E4) (4090E8 word32 dw4090E8) (4090EC (ptr Eq_91) ptr4090EC) (4090F0 (ptr code) ptr4090F0))
	globals_t (in globals : (ptr (struct "Globals")))
Eq_14: (union "Eq_14" ((ptr Eq_2251) u0) (DWORD u1) (HANDLE u2) (HMODULE u3) (LPCSTR u4) (LPVOID u5) (SIZE_T u6))
	T_14 (in eax_18 : Eq_14)
	T_17 (in lpModuleName : LPCSTR)
	T_18 (in 0x00000000 : word32)
	T_19 (in GetModuleHandleA(0x00000000) : word32)
	T_33 (in dwArg04 : word32)
	T_57 (in Mem167[0x004090D8:word32] : word32)
	T_122 (in dwArg08 : Eq_14)
	T_144 (in hModule : HMODULE)
	T_146 (in dwArg04 : word32)
	T_152 (in 0x00409080 : word32)
	T_153 (in GetModuleHandleA(0x00409080) : word32)
	T_157 (in dwArg04 : word32)
	T_170 (in eax_44 : Eq_14)
	T_173 (in lpAddress : LPVOID)
	T_174 (in dwSize : SIZE_T)
	T_177 (in 0x00000000 : word32)
	T_180 (in Mem0[edx_27 + 0x00000050:word32] : word32)
	T_183 (in VirtualAlloc(0x00000000, edx_27->t0050, 0x00003000, 0x00000040) : word32)
	T_184 (in 0x00000000 : word32)
	T_186 (in 0x00409090 : word32)
	T_190 (in Mem111[fp - 0x00000054:word32] : word32)
	T_191 (in 0x0040909C : word32)

  DataType: word32
  OrigDataType: word32
T_2229: (in 0x00000007 : word32)
  Class: Eq_2229
  DataType: word32
  OrigDataType: word32
T_2230: (in dwLoc08_12 << 0x00000007 : word32)
  Class: Eq_2230
  DataType: ui32
  OrigDataType: ui32
T_2231: (in ecx_16 & 0x0000007F | dwLoc08_12 << 0x00000007 : word32)
  Class: Eq_2216
  DataType: word32
  OrigDataType: word32
T_2232: (in edx_29 : word32)
  Class: Eq_2218
  DataType: word32
  OrigDataType: word32
T_2233: (in 0x00000001 : word32)
  Class: Eq_2233
  DataType: word32
  OrigDataType: word32
T_2234: (in dwLoc10_13 + 0x00000001 : word32)
  Class: Eq_2218
  DataType: word32
  OrigDataType: word32
T_2235: (in 0x00000001 : word32)
  Class: Eq_2235
  DataType: word32
  OrigDataType: word32
T_2236: (in dwArg08 + 0x00000001 : word32)
  Class: Eq_2221
  DataType: (ptr Eq_2221)
  OrigDataType: word32
T_2237: (in 0x00000080 : word32)
  Class: Eq_2237
  DataType: word32
  OrigDataType: word32
T_2238: (in ecx_16 & 0x00000080 : word32)
  Class: Eq_2238
  DataType: word32
  OrigDataType: word32
T_2239: (in 0x00000000 : word32)
  Class: Eq_2238
  DataType: word32
  OrigDataType: word32
T_2240: (in (ecx_16 & 0x00000080) != 0x00000000 : bool)
  Class: Eq_2240
  DataType: bool
  OrigDataType: bool
T_2241: (in dwArg04 : word32)
  Class: Eq_2241
  DataType: (ptr word32)
  OrigDataType: (ptr (struct (0 T_2244 t0000)))
T_2242: (in 0x00000000 : word32)
  Class: Eq_2242
  DataType: word32
  OrigDataType: word32
T_2243: (in dwArg04 + 0x00000000 : word32)
  Class: Eq_2243
  DataType: word32
  OrigDataType: word32
T_2244: (in Mem39[dwArg04 + 0x00000000:word32] : word32)
  Class: Eq_2216
  DataType: word32
  OrigDataType: word32
T_2245:
  Class: Eq_2245
  DataType: word16
  OrigDataType: (struct 0002 (0 T_1574 t0000))
T_2246:
  Class: Eq_2245
  DataType: word16
  OrigDataType: (struct 0002 (0 T_1586 t0000))
T_2247:
  Class: Eq_2245
  DataType: word16
  OrigDataType: (struct 0002 (0 T_1599 t0000))
T_2248:
  Class: Eq_2248
  DataType: word16
  OrigDataType: (struct 0002 (0 T_2096 t0000))
T_2249:
  Class: Eq_2248
  DataType: word16
  OrigDataType: (struct 0002 (0 T_2110 t0000))
T_2250:
  Class: Eq_2248
  DataType: word16
  OrigDataType: (struct 0002 (0 T_2125 t0000))
T_2251:
  Class: Eq_2251
  DataType: Eq_2251
  OrigDataType: 
T_2252:
  Class: Eq_2252
  DataType: int32
  OrigDataType: 
T_2253:
  Class: Eq_2253
  DataType: int32
  OrigDataType: 
T_2254:
  Class: Eq_2254
  DataType: int32
  OrigDataType: 
T_2255:
  Class: Eq_2255
  DataType: Eq_2255
  OrigDataType: 
T_2256:
  Class: Eq_2256
  DataType: int32
  OrigDataType: 
*/
typedef Eq_14 Eq_1Eq_14 Eq_1Eq_91 Eq_1code Eq_1struct Globals {
	up32 dw405000;	// 405000
	word32 dw405004;	// 405004
	Eq_14 t4090CC;	// 4090CC
	word32 dw4090D0;	// 4090D0
	word32 dw4090D4;	// 4090D4
	Eq_14 t4090D8;	// 4090D8
	word32 dw4090DC;	// 4090DC
	word32 dw4090E0;	// 4090E0
	word32 dw4090E4;	// 4090E4
	word32 dw4090E8;	// 4090E8
	Eq_91 * ptr4090EC;	// 4090EC
	code * ptr4090F0;	// 4090F0
} Eq_1;

typedef union Eq_14 {
	Eq_2251* u0;
	 DWORD u1;
	 HANDLE u2;
	 HMODULE u3;
	 LPCSTR u4;
	 LPVOID u5;
	 SIZE_T u6;
} Eq_14;

typedef Eq_14 (Eq_15)(Eq_14);

typedef word32 (Eq_20)(Eq_22, Eq_23, Eq_24);

typedef union Eq_22 {
	word32 u0;
	 HKEY u1;
} Eq_22;

typedef union Eq_23 {
	word32 u0;
	 LPCSTR u1;
} Eq_23;

typedef union Eq_24 {
	word32 u0;
	 PHKEY u1;
} Eq_24;

typedef struct Eq_27 {
	ptr32 ptrFFFFFF5C;	// FFFFFF5C
	word32 dwFFFFFF60;	// FFFFFF60
} Eq_27;

typedef word32 (Eq_59)(word32);

typedef void (Eq_74)(word32, word32, up32);

typedef Eq_1980 Eq_91struct Eq_91 {
	Eq_1980 * ptr0030;	// 30
} Eq_91;

typedef Eq_91 Eq_92struct Eq_92 {
	Eq_91 * ptr0018;	// 18
} Eq_92;

typedef union Eq_93 {
	ptr32 u0;
	Eq_91* Eq_92::* u1;
} Eq_93;

typedef struct Eq_106 {
	word32 dw0008;	// 8
} Eq_106;

typedef struct Eq_113 {
	word32 dw0008;	// 8
} Eq_113;

typedef void (Eq_119)(word32, Eq_14);

typedef void (Eq_133)(word32, word32);

typedef code * (Eq_142)(Eq_14, Eq_145);

typedef union Eq_145 {
	word32 u0;
	 LPCSTR u1;
} Eq_145;

typedef Eq_288 Eq_156Eq_14 Eq_156struct Eq_156 {
	word16 w0006;	// 6
	word16 w0014;	// 14
	Eq_288 t003C;	// 3C
	Eq_14 t0050;	// 50
} Eq_156;

typedef Eq_162 Eq_162struct Eq_162 {	// size: 40 28
	word32 dw000C;	// C
	word32 dw0010;	// 10
	word32 dw0014;	// 14
	Eq_162 t0028;	// 28
} Eq_162;

typedef Eq_14 (Eq_171)(Eq_14, Eq_14, Eq_175, Eq_176);

typedef union Eq_175 {
	word32 u0;
	 DWORD u1;
} Eq_175;

typedef union Eq_176 {
	word32 u0;
	 DWORD u1;
} Eq_176;

typedef Eq_14 Eq_187Eq_14 Eq_187Eq_14 Eq_187struct Eq_187 {
	Eq_14 tFFFFFF98;	// FFFFFF98
	word32 dwFFFFFF9C;	// FFFFFF9C
	word32 dwFFFFFFA0;	// FFFFFFA0
	word32 dwFFFFFFA4;	// FFFFFFA4
	Eq_14 tFFFFFFA8;	// FFFFFFA8
	Eq_14 tFFFFFFAC;	// FFFFFFAC
	word32 dwFFFFFFE8;	// FFFFFFE8
} Eq_187;

typedef void (Eq_223)(Eq_14, Eq_14, int32);

typedef Eq_14 (Eq_252)(Eq_254, Eq_255, Eq_256, Eq_257, Eq_14, Eq_259);

typedef union Eq_254 {
	word32 u0;
	 HANDLE u1;
} Eq_254;

typedef union Eq_255 {
	word32 u0;
	 LPSECURITY_ATTRIBUTES u1;
} Eq_255;

typedef union Eq_256 {
	word32 u0;
	 DWORD u1;
} Eq_256;

typedef union Eq_257 {
	word32 u0;
	 DWORD u1;
} Eq_257;

typedef union Eq_259 {
	word32 u0;
	 LPCSTR u1;
} Eq_259;

typedef union Eq_288 {
	int32 u0;
	uint32 u1;
} Eq_288;

typedef union Eq_309 {
	int32 u0;
	uint32 u1;
} Eq_309;

typedef Eq_315 Eq_315struct Eq_315 {	// size: 20 14
	word32 dw0000;	// 0
	word32 dw000C;	// C
	word32 dw0010;	// 10
	Eq_315 t0014;	// 14
} Eq_315;

typedef Eq_324 Eq_324struct Eq_324 {	// size: 4 4
	word32 dw0000;	// 0
	Eq_324 t0004;	// 4
} Eq_324;

typedef Eq_325 Eq_325struct Eq_325 {	// size: 4 4
	word32 dw0000;	// 0
	Eq_325 t0004;	// 4
} Eq_325;

typedef word32 (Eq_327)(Eq_329);

typedef union Eq_329 {
	word32 u0;
	 LPCSTR u1;
} Eq_329;

typedef word32 (Eq_365)(Eq_367, Eq_368);

typedef union Eq_367 {
	word32 u0;
	 HINSTANCE u1;
} Eq_367;

typedef union Eq_368 {
	word32 u0;
	 LPCSTR u1;
} Eq_368;

typedef  Eq_1535[]struct Eq_1535 {
	word32 dw0000;	// 0
	word32 dw0004;	// 4
	word16 a0008[];	// 8
} Eq_1535;

typedef word32 (Eq_1614)(word32, word32);

typedef Eq_14 Eq_1721Eq_14 Eq_1721Eq_14 Eq_1721struct Eq_1721 {
	Eq_14 tFFFFFFF8;	// FFFFFFF8
	Eq_14 tFFFFFFFC;	// FFFFFFFC
	Eq_14 t0000;	// 0
} Eq_1721;

typedef word32 (Eq_1727)(Eq_14);

typedef void (Eq_1778)(Eq_14);

typedef void (Eq_1796)(Eq_14, Eq_14);

typedef Eq_14 Eq_1829Eq_14 Eq_1829struct Eq_1829 {
	Eq_14 tFFFFFFEC;	// FFFFFFEC
	word32 dwFFFFFFF0;	// FFFFFFF0
	word32 dwFFFFFFF4;	// FFFFFFF4
	word32 dwFFFFFFF8;	// FFFFFFF8
	word32 dwFFFFFFFC;	// FFFFFFFC
	Eq_14 t0000;	// 0
} Eq_1829;

typedef Eq_14 Eq_1860Eq_14 Eq_1860struct Eq_1860 {
	Eq_14 tFFFFFFEC;	// FFFFFFEC
	word32 dwFFFFFFF0;	// FFFFFFF0
	word32 dwFFFFFFF4;	// FFFFFFF4
	word32 dwFFFFFFF8;	// FFFFFFF8
	word32 dwFFFFFFFC;	// FFFFFFFC
	Eq_14 t0000;	// 0
} Eq_1860;

typedef Eq_14 Eq_1896Eq_14 Eq_1896Eq_175 Eq_1896Eq_176 Eq_1896struct Eq_1896 {
	Eq_14 tFFFFFFF4;	// FFFFFFF4
	Eq_14 tFFFFFFF8;	// FFFFFFF8
	Eq_175 tFFFFFFFC;	// FFFFFFFC
	Eq_176 t0000;	// 0
} Eq_1896;

typedef Eq_14 Eq_1935Eq_14 Eq_1935Eq_175 Eq_1935Eq_176 Eq_1935struct Eq_1935 {
	Eq_14 tFFFFFFF4;	// FFFFFFF4
	Eq_14 tFFFFFFF8;	// FFFFFFF8
	Eq_175 tFFFFFFFC;	// FFFFFFFC
	Eq_176 t0000;	// 0
} Eq_1935;

typedef Eq_1975 Eq_1975struct Eq_1975 {
	Eq_1975 * ptr0000;	// 0
	word32 dw0018;	// 18
	word32 dw001C;	// 1C
} Eq_1975;

typedef Eq_1983 Eq_1980struct Eq_1980 {
	word32 dw0008;	// 8
	Eq_1983 * ptr000C;	// C
} Eq_1980;

typedef Eq_1975 Eq_1983struct Eq_1983 {
	Eq_1975 * ptr000C;	// C
} Eq_1983;

typedef word32 (Eq_2008)(Eq_2010, Eq_2011, Eq_2012);

typedef union Eq_2010 {
	word32 u0;
	 HANDLE u1;
} Eq_2010;

typedef union Eq_2011 {
	word32 u0;
	 DWORD u1;
} Eq_2011;

typedef union Eq_2012 {
	word32 u0;
	 SIZE_T u1;
} Eq_2012;

typedef Eq_2010 (Eq_2013)();

typedef Eq_14 Eq_2027struct Eq_2027 {
	Eq_14 t0050;	// 50
	word32 dw00A0;	// A0
	word32 dw00A4;	// A4
} Eq_2027;

typedef Eq_14 Eq_2049Eq_14 Eq_2049struct Eq_2049 {
	Eq_14 tFFFFFFD4;	// FFFFFFD4
	Eq_14 tFFFFFFD8;	// FFFFFFD8
} Eq_2049;

typedef  Eq_2071[]struct Eq_2071 {
	word32 dw0000;	// 0
	word32 dw0004;	// 4
	word16 a0008[];	// 8
} Eq_2071;

typedef word32 (Eq_2170)(word32, word32);

typedef Eq_2221 Eq_2221struct Eq_2221 {	// size: 1 1
	byte b0000;	// 0
	Eq_2221 t0001;	// 1
} Eq_2221;

typedef code Eq_2251Eq_14 Eq_2251Eq_14 Eq_2251struct Eq_2251 {
	code * ptr0028;	// 28
	Eq_14 t0034;	// 34
	word32 dw003C;	// 3C
	Eq_14 t0050;	// 50
	word32 dw0080;	// 80
	word32 dw00A0;	// A0
	word32 dw00A4;	// A4
} Eq_2251;

typedef DWORDLPVOIDBOOLstruct _SECURITY_ATTRIBUTES {
	DWORD;	// 0
	LPVOID;	// 4
	BOOL;	// 8
} Eq_2255;

