// subject.h
// Generated on TIMESTAMP by decompiling from_pouet.net/with_source_342/ia32_com/subject.exe
// using Decompiler version VERSION

/*
// Equivalence classes ////////////
Eq_1: (struct "Globals" (FFFA0000 (ptr Eq_130) ptrFFFA0000) (0 (ptr Eq_68) ptr0000))
	globals_t (in globals : (ptr (struct "Globals")))
Eq_2: (segment "Eq_2" (10C Eq_530 t010C))
	T_2 (in fs_3 : (ptr Eq_2))
	T_7 (in fn0C00_012B(es) : selector)
	T_39 (in fs : (ptr Eq_2))
Eq_3: (fn (ptr Eq_2) ((ptr Eq_5)))
	T_3 (in fn0C00_012B : ptr32)
	T_4 (in signature of fn0C00_012B : void)
Eq_5: (segment "Eq_5" (4E8 (arr byte) a04E8) (670 byte b0670))
	T_5 (in es : (ptr Eq_5))
	T_6 (in es : (ptr Eq_5))
	T_10 (in es : (ptr Eq_5))
Eq_8: (fn void ((ptr Eq_5), (ptr Eq_11)))
	T_8 (in fn0C00_0344 : ptr32)
	T_9 (in signature of fn0C00_0344 : void)
Eq_11: (segment "Eq_11" (387 (arr word32) a0387) (45F word16 w045F) (4E8 Eq_123 t04E8) (4EA Eq_123 t04EA) (4EC (memptr (ptr Eq_11) Eq_278) ptr04EC) (4EE Eq_537 t04EE) (4F0 (arr ui16) a04F0) (5F0 (arr byte) a05F0) (670 byte b0670) (2A70 byte b2A70) (2A72 (arr byte) a2A72))
	T_11 (in ds : (ptr Eq_11))
	T_12 (in ds : (ptr Eq_11))
	T_17 (in ds : (ptr Eq_11))
	T_25 (in ds : (ptr Eq_11))
	T_29 (in ds : (ptr Eq_11))
	T_34 (in ds : (ptr Eq_11))
	T_38 (in ds : (ptr Eq_11))
	T_44 (in ds : (ptr Eq_11))
	T_48 (in ds : (ptr Eq_11))
	T_124 (in ds : (ptr Eq_11))
Eq_14: (segment "Eq_14")
	T_14 (in es_5 : (ptr Eq_14))
	T_18 (in fn0C00_0138(ds) : selector)
	T_24 (in es : (ptr Eq_14))

T_619: (in ((&ds->a0387[0])[-((cx_21 - 0x0001 >>u 0x0003) - 0x0008)] & 0x80000000 >>u (byte) (-((bp_18 - 0x0001 >>u 0x0002) - 0x001F))) == 0x00000000 ^ 0x01 : byte)
  Class: Eq_619
  DataType: byte
  OrigDataType: byte
T_620: (in 0x06 : byte)
  Class: Eq_620
  DataType: byte
  OrigDataType: byte
T_621: (in (((&ds->a0387[0])[-((cx_21 - 0x0001 >>u 0x0003) - 0x0008)] & 0x80000000 >>u (byte) (-((bp_18 - 0x0001 >>u 0x0002) - 0x001F))) == 0x00000000 ^ 0x01) << 0x06 : word16)
  Class: Eq_621
  DataType: ui16
  OrigDataType: ui16
T_622: (in 0x29 : byte)
  Class: Eq_622
  DataType: byte
  OrigDataType: byte
T_623: (in ((((&ds->a0387[0])[-((cx_21 - 0x0001 >>u 0x0003) - 0x0008)] & 0x80000000 >>u (byte) (-((bp_18 - 0x0001 >>u 0x0002) - 0x001F))) == 0x00000000 ^ 0x01) << 0x06) + 0x29 : byte)
  Class: Eq_623
  DataType: byte
  OrigDataType: byte
T_624: (in 0x0000 : word16)
  Class: Eq_624
  DataType: word16
  OrigDataType: word16
T_625: (in di_16 + 0x0000 : word16)
  Class: Eq_625
  DataType: word16
  OrigDataType: word16
T_626: (in Mem50[es:di_16 + 0x0000:byte] : byte)
  Class: Eq_623
  DataType: byte
  OrigDataType: byte
T_627: (in 0x0001 : word16)
  Class: Eq_627
  DataType: word16
  OrigDataType: word16
T_628: (in di_16 + 0x0001 : word16)
  Class: Eq_588
  DataType: (memptr (ptr Eq_5) byte)
  OrigDataType: word16
T_629: (in 0x0001 : word16)
  Class: Eq_629
  DataType: word16
  OrigDataType: word16
T_630: (in cx_21 - 0x0001 : word16)
  Class: Eq_594
  DataType: word16
  OrigDataType: word16
T_631: (in 0x0000 : word16)
  Class: Eq_594
  DataType: word16
  OrigDataType: word16
T_632: (in cx_21 != 0x0000 : bool)
  Class: Eq_632
  DataType: bool
  OrigDataType: bool
T_633: (in 0x0001 : word16)
  Class: Eq_633
  DataType: word16
  OrigDataType: word16
T_634: (in bp_18 - 0x0001 : word16)
  Class: Eq_590
  DataType: word16
  OrigDataType: word16
T_635: (in 0x0000 : word16)
  Class: Eq_590
  DataType: word16
  OrigDataType: word16
T_636: (in bp_18 != 0x0000 : bool)
  Class: Eq_636
  DataType: bool
  OrigDataType: bool
T_637: (in 0x0048 : word16)
  Class: Eq_594
  DataType: word16
  OrigDataType: word16
T_638:
  Class: Eq_638
  DataType: byte
  OrigDataType: (struct 0001 (0 T_72 t0000))
T_639:
  Class: Eq_639
  DataType: word32
  OrigDataType: (struct 0004 (0 T_134 t0000))
T_640:
  Class: Eq_640
  DataType: ui16
  OrigDataType: (struct 0002 (0 T_308 t0000))
T_641:
  Class: Eq_641
  DataType: byte
  OrigDataType: (struct 0001 (0 T_344 t0000))
T_642:
  Class: Eq_642
  DataType: byte
  OrigDataType: (struct 0001 (0 T_514 t0000))
T_643:
  Class: Eq_643
  DataType: byte
  OrigDataType: (struct 0001 (0 T_518 t0000))
T_644:
  Class: Eq_644
  DataType: word32
  OrigDataType: (struct 0004 (0 T_604 t0000))
T_645:
  Class: Eq_645
  DataType: Eq_645
  OrigDataType: 
T_646:
  Class: Eq_646
  DataType: Eq_646
  OrigDataType: 
T_647:
  Class: Eq_647
  DataType: Eq_647
  OrigDataType: 
T_648:
  Class: Eq_648
  DataType: Eq_648
  OrigDataType: 
*/
typedef Eq_130 Eq_1Eq_68 Eq_1struct Globals {
	Eq_130 * ptrFFFA0000;	// FFFA0000
	Eq_68 * ptr0000;	// 0
} Eq_1;

typedef Eq_530 Eq_2struct Eq_2 {
	Eq_530 t010C;	// 10C
} Eq_2;

typedef Eq_2 * (Eq_3)(Eq_5 *);

typedef  Eq_5[]struct Eq_5 {
	byte a04E8[];	// 4E8
	byte b0670;	// 670
} Eq_5;

typedef void (Eq_8)(Eq_5 *, Eq_11 *);

typedef  Eq_11[]Eq_123Eq_123Eq_278Eq_537[][][]struct Eq_11 {
	word32 a0387[];	// 387
	word16 w045F;	// 45F
	Eq_123 t04E8;	// 4E8
	Eq_123 t04EA;	// 4EA
	Eq_278 Eq_11::*ptr04EC;	// 4EC
	Eq_537 t04EE;	// 4EE
	ui16 a04F0[];	// 4F0
	byte a05F0[];	// 5F0
	byte b0670;	// 670
	byte b2A70;	// 2A70
	byte a2A72[];	// 2A72
} Eq_11;

typedef struct Eq_14 {
} Eq_14;

typedef Eq_14 * (Eq_15)(Eq_11 *);

typedef void (Eq_19)();

typedef void (Eq_22)(Eq_14 *, Eq_11 *);

typedef void (Eq_27)(Eq_11 *);

typedef void (Eq_31)(Eq_14 *, Eq_11 *);

typedef Eq_14 * (Eq_36)(Eq_11 *, Eq_2 *);

typedef void (Eq_41)(Eq_14 *, Eq_11 *);

typedef void (Eq_46)(Eq_11 *);

typedef byte (Eq_50)(byte);

typedef void (Eq_55)(byte);

typedef void (Eq_60)();

typedef struct Eq_63 {
} Eq_63;

typedef struct Eq_68 {
} Eq_68;

typedef struct Eq_79 {
} Eq_79;

typedef void (Eq_83)(word16, byte);

typedef void (Eq_89)(word16, byte);

typedef void (Eq_97)(word16, word16);

typedef void (Eq_101)(word16, word16);

typedef void (Eq_105)(word16, word16);

typedef void (Eq_109)(word16, word16);

typedef void (Eq_113)(word16, word16);

typedef void (Eq_121)(Eq_123, Eq_11 *);

typedef union Eq_123 {
	byte u0;
	word32 Eq_14::* u1;
} Eq_123;

typedef  Eq_130[]struct Eq_130 {
	word32 a0000[];	// 0
} Eq_130;

typedef byte (Eq_144)(word16);

typedef byte (Eq_153)(word16);

typedef void (Eq_162)();

typedef void (Eq_167)(word16, word16);

typedef void (Eq_170)(word16, word16);

typedef byte (Eq_178)(word16);

typedef void (Eq_193)(word16, word16);

typedef void (Eq_224)(word16, byte);

typedef void (Eq_238)(word16, byte, byte, byte);

typedef void (Eq_271)(word16, byte);

typedef void (Eq_273)(word16, byte);

typedef void (Eq_275)(word16, byte);

typedef struct Eq_278 {
	byte b0461;	// 461
} Eq_278;

typedef union Eq_299 {
	int16 u0;
	uint16 u1;
} Eq_299;

typedef struct Eq_319 {
	byte b0461;	// 461
} Eq_319;

typedef union Eq_336 {
	int16 u0;
	uint16 u1;
} Eq_336;

typedef union Eq_360 {
	ui16 u0;
	byte u1;
} Eq_360;

typedef union Eq_370 {
	uint16 u0;
	Eq_645 Eq_11::* u1;
} Eq_370;

typedef union Eq_414 {
	uint16 u0;
	Eq_646 Eq_11::* u1;
} Eq_414;

typedef struct Eq_429 {
} Eq_429;

typedef union Eq_430 {
	ptr16 u0;
	Eq_647 Eq_429::* u1;
} Eq_430;

typedef void (Eq_436)(word16, word16);

typedef void (Eq_440)(word16, word16);

typedef union Eq_448 {
	ui16 u0;
	byte u1;
} Eq_448;

typedef void (Eq_487)(word16, word16);

typedef struct Eq_497 {
} Eq_497;

typedef  Eq_515[]Eq_546struct Eq_515 {
	byte a2A70[];	// 2A70
	Eq_546 t2BB0;	// 2BB0
} Eq_515;

typedef union Eq_530 {
	ptr32 u0;
	segptr32 u1;
} Eq_530;

typedef struct Eq_533 {
} Eq_533;

typedef struct Eq_535 {	// size: 1 1
	word16 w0000;	// 0
} Eq_535;

typedef union Eq_537 {
	cups16 u0;
	Eq_648 Eq_11::* u1;
} Eq_537;

typedef Eq_557 Eq_546struct Eq_546 {	// size: 1 1
	Eq_557 t0000;	// 0
} Eq_546;

typedef bool (Eq_550)(word16, int16);

typedef union Eq_557 {
	ui16 u0;
	byte u1;
} Eq_557;

typedef struct Eq_645 {	// size: 8 8
	word16 w04F0;	// 4F0
} Eq_645;

typedef struct Eq_646 {
	byte b05F0;	// 5F0
} Eq_646;

typedef struct Eq_647 {
	word16 wFFFFFFFC;	// FFFFFFFC
} Eq_647;

typedef struct Eq_648 {
	byte b03BB;	// 3BB
} Eq_648;

