// subject.h
// Generated on TIMESTAMP by decompiling from_pouet.net/with_source_382/ia32_elf/subject.exe
// using Decompiler version VERSION

/*
// Equivalence classes ////////////
Eq_1: (struct "Globals" (1C0380 Eq_1488 t1C0380) (8049A00 real32 r8049A00) (8049A08 Eq_139 t8049A08) (8049A0C Eq_832 t8049A0C) (8049A10 Eq_961 t8049A10) (8049A2C Eq_1490 t8049A2C) (8049A30 Eq_1456 t8049A30) (8049A34 real32 r8049A34) (8049A38 Eq_1531 t8049A38) (804A0BC (ptr code) ptr804A0BC) (804A0C0 (ptr code) ptr804A0C0) (804A0C4 (ptr code) ptr804A0C4) (804A0C8 (ptr code) ptr804A0C8) (804A0CC (ptr code) ptr804A0CC) (804A0D0 (ptr code) ptr804A0D0) (804A0D4 (ptr code) ptr804A0D4) (804A0D8 (ptr code) ptr804A0D8) (804A0DC (ptr code) ptr804A0DC) (804A0E0 (ptr code) ptr804A0E0) (804A100 Eq_23 t804A100) (824A500 Eq_1451 t824A500) (824A504 Eq_1460 t824A504) (824A508 Eq_1413 t824A508) (824A50C Eq_23 t824A50C) (824A514 word32 dw824A514) (824A520 Eq_23 t824A520) (824A59D byte b824A59D) (940C8A0 Eq_23 t940C8A0) (940C8A4 (arr Eq_1601 8) a940C8A4) (964CD20 Eq_23 t964CD20))
	globals_t (in globals : (ptr (struct "Globals")))
Eq_2: (ptr code)
	T_2 (in 0x0804A0BC : ptr32)
Eq_4: (ptr code)
	T_4 (in 0x0804A0C0 : ptr32)
Eq_6: (ptr code)
	T_6 (in 0x0804A0C4 : ptr32)
Eq_8: (ptr code)
	T_8 (in 0x0804A0C8 : ptr32)
Eq_10: (ptr code)
	T_10 (in 0x0804A0CC : ptr32)
Eq_12: (ptr code)
	T_12 (in 0x0804A0D0 : ptr32)
Eq_14: (ptr code)
	T_14 (in 0x0804A0D4 : ptr32)
Eq_16: (ptr code)
	T_16 (in 0x0804A0D8 : ptr32)
Eq_18: (ptr code)

  OrigDataType: real64
T_1576: (in rLoc3_522 : real64)
  Class: Eq_1576
  DataType: real64
  OrigDataType: real64
T_1577: (in 0x08049A30 : ptr32)
  Class: Eq_1577
  DataType: (ptr Eq_1577)
  OrigDataType: (ptr (struct (0 T_1578 t0000)))
T_1578: (in Mem474[0x08049A30:real32] : real32)
  Class: Eq_1456
  DataType: Eq_1456
  OrigDataType: (union (real32 u0) (real64 u1))
T_1579: (in Mem474[0x08049A30:real32] * rLoc2_520 : real64)
  Class: Eq_1576
  DataType: real64
  OrigDataType: real64
T_1580: (in 0x0824A500 : ptr32)
  Class: Eq_1580
  DataType: (ptr Eq_1580)
  OrigDataType: (ptr (struct (0 T_1581 t0000)))
T_1581: (in Mem526[0x0824A500:real32] : real32)
  Class: Eq_1451
  DataType: Eq_1451
  OrigDataType: real32
T_1582: (in rLoc1_519 * rLoc3_522 : real64)
  Class: Eq_1460
  DataType: Eq_1460
  OrigDataType: real64
T_1583: (in 0x0824A504 : ptr32)
  Class: Eq_1583
  DataType: (ptr Eq_1583)
  OrigDataType: (ptr (struct (0 T_1584 t0000)))
T_1584: (in Mem528[0x0824A504:real32] : real32)
  Class: Eq_1460
  DataType: Eq_1460
  OrigDataType: real32
T_1585: (in fn0804938F : ptr32)
  Class: Eq_1471
  DataType: (ptr Eq_1471)
  OrigDataType: (ptr (fn T_1588 (T_1586, T_1188, T_1587)))
T_1586: (in 0x0824A520 : word32)
  Class: Eq_23
  DataType: (ptr Eq_23)
  OrigDataType: word32
T_1587: (in 0x00000047 : word32)
  Class: Eq_614
  DataType: int32
  OrigDataType: word32
T_1588: (in fn0804938F(0x0824A520, eax_28, 0x00000047) : void)
  Class: Eq_1475
  DataType: void
  OrigDataType: void
T_1589: (in fn080483F8 : ptr32)
  Class: Eq_1476
  DataType: (ptr Eq_1476)
  OrigDataType: (ptr (fn T_1590 ()))
T_1590: (in fn080483F8() : void)
  Class: Eq_1478
  DataType: void
  OrigDataType: void
T_1591: (in fn080483C8 : ptr32)
  Class: Eq_1479
  DataType: (ptr Eq_1479)
  OrigDataType: (ptr (fn T_1592 ()))
T_1592: (in fn080483C8() : void)
  Class: Eq_1481
  DataType: void
  OrigDataType: void
T_1593: (in 0x00000004 : word32)
  Class: Eq_1593
  DataType: word32
  OrigDataType: word32
T_1594: (in ebx_472 + 0x00000004 : word32)
  Class: Eq_1509
  DataType: ui32
  OrigDataType: word32
T_1595: (in 0x00000030 : word32)
  Class: Eq_1595
  DataType: word32
  OrigDataType: word32
T_1596: (in fp - 0x00000030 : word32)
  Class: Eq_1467
  DataType: up32
  OrigDataType: word32
T_1597:
  Class: Eq_1597
  DataType: Eq_1597
  OrigDataType: (struct 0004 (0 T_266 t0000))
T_1598:
  Class: Eq_1598
  DataType: Eq_1598
  OrigDataType: (struct 0004 (0 T_277 t0000))
T_1599:
  Class: Eq_1599
  DataType: Eq_1599
  OrigDataType: (struct 0004 (0 T_1144 t0000))
T_1600:
  Class: Eq_1600
  DataType: Eq_1600
  OrigDataType: (struct 0004 (0 T_1147 t0000))
T_1601:
  Class: Eq_1601
  DataType: Eq_1601
  OrigDataType: (struct 40080 (0 T_1495 t0000))
T_1602:
  Class: Eq_1601
  DataType: Eq_1601
  OrigDataType: (struct 40080 (0 T_1499 t0000))
*/
typedef  Eq_1 Eq_1 Eq_1 Eq_1 Eq_1 Eq_1 Eq_1code Eq_1code Eq_1code Eq_1code Eq_1code Eq_1code Eq_1code Eq_1code Eq_1code Eq_1code Eq_1 Eq_1 Eq_1 Eq_1 Eq_1 Eq_1 Eq_1 Eq_1 Eq_1[8]struct Globals {
	 t1C0380;	// 1C0380
	real32 r8049A00;	// 8049A00
	 t8049A08;	// 8049A08
	 t8049A0C;	// 8049A0C
	 t8049A10;	// 8049A10
	 t8049A2C;	// 8049A2C
	 t8049A30;	// 8049A30
	real32 r8049A34;	// 8049A34
	 t8049A38;	// 8049A38
	code * ptr804A0BC;	// 804A0BC
	code * ptr804A0C0;	// 804A0C0
	code * ptr804A0C4;	// 804A0C4
	code * ptr804A0C8;	// 804A0C8
	code * ptr804A0CC;	// 804A0CC
	code * ptr804A0D0;	// 804A0D0
	code * ptr804A0D4;	// 804A0D4
	code * ptr804A0D8;	// 804A0D8
	code * ptr804A0DC;	// 804A0DC
	code * ptr804A0E0;	// 804A0E0
	 t804A100;	// 804A100
	 t824A500;	// 824A500
	 t824A504;	// 824A504
	 t824A508;	// 824A508
	 t824A50C;	// 824A50C
	word32 dw824A514;	// 824A514
	 t824A520;	// 824A520
	byte b824A59D;	// 824A59D
	 t940C8A0;	// 940C8A0
	 a940C8A4[8];	// 940C8A4
	 t964CD20;	// 964CD20
} Eq_1;

typedef code * Eq_2;

typedef code * Eq_4;

typedef code * Eq_6;

typedef code * Eq_8;

typedef code * Eq_10;

typedef code * Eq_12;

typedef code * Eq_14;

typedef code * Eq_16;

typedef code * Eq_18;

typedef code * Eq_20;

typedef  Eq_23 Eq_23 Eq_23 Eq_23 Eq_23 Eq_23 Eq_23 Eq_23 Eq_23 Eq_23 Eq_23 Eq_23 Eq_23 Eq_23 Eq_23 Eq_23 Eq_23 Eq_23 Eq_23 Eq_23 Eq_23struct  {	// size: 262272 40080
	 t0000;	// 0
	 t0004;	// 4
	 t0008;	// 8
	 t000C;	// C
	 t000C;	// C
	 t0010;	// 10
	 t0014;	// 14
	 t0018;	// 18
	real32 r0018;	// 18
	real32 r001C;	// 1C
	real32 r0020;	// 20
	 t0030;	// 30
	 t003C;	// 3C
	 t0054;	// 54
	 t0054;	// 54
	 t0054;	// 54
	 t0054;	// 54
	 t0058;	// 58
	real32 r005C;	// 5C
	 t0060;	// 60
	 t0064;	// 64
	 t0068;	// 68
	 t006C;	// 6C
	byte b007C;	// 7C
	 t1800;	// 1800
	 t40080;	// 40080
} Eq_23;

typedef union  {
	real32 u0;
	real64 u1;
} Eq_26;

typedef union  {
	real32 u0;
	real64 u1;
} Eq_31;

typedef union  {
	real32 u0;
	real64 u1;
} Eq_34;

typedef union  {
	real32 u0;
	real64 u1;
} Eq_38;

typedef union  {
	real32 u0;
	real64 u1;
} Eq_42;

typedef union  {
	real32 u0;
	real64 u1;
} Eq_46;

typedef  Eq_56 Eq_56struct  {
	real32 r0000;	// 0
	 t0004;	// 4
	 t0008;	// 8
} Eq_56;

typedef union  {
	real32 u0;
	real64 u1;
} Eq_59;

typedef union  {
	real32 u0;
	real64 u1;
} Eq_63;

typedef union  {
	real32 u0;
	real64 u1;
} Eq_65;

typedef  Eq_66 Eq_66 Eq_66struct  {
	 t0000;	// 0
	 t0004;	// 4
	 t0008;	// 8
} Eq_66;

typedef union  {
	real32 u0;
	real64 u1;
} Eq_82;

typedef union  {
	real32 u0;
	real64 u1;
} Eq_97;

typedef real64 (Eq_135)();

typedef  (Eq_136)( *,  *);

typedef union  {
	32 u0;
	64 u1;
	real32 u2;
	real64 u3;
} Eq_139;

typedef union  {
	real32 u0;
	real64 u1;
} Eq_141;

typedef  (Eq_142)();

typedef struct  {
	real32 r0000;	// 0
} Eq_147;

typedef void (Eq_172)();

typedef struct  {
	int32 dw0000;	// 0
} Eq_183;

typedef  Eq_184[][]struct  {
	 a0000[];	// 0
	 a0040[];	// 40
} Eq_184;

typedef void (Eq_246)();

typedef void (Eq_301)( *,  *,  *);

typedef void (Eq_311)( *, int32);

typedef void (Eq_318)();

typedef void (Eq_347)(byte, , , , );

typedef union  {
	real64 u0;
	real32 u1;
} Eq_349;

typedef union  {
	ui32 u0;
	real32 u1;
	real64 u2;
} Eq_350;

typedef union  {
	real32 u0;
	real64 u1;
} Eq_351;

typedef union  {
	real64 u0;
	word32 u1;
} Eq_352;

typedef void (Eq_367)(byte, word32, word32, word32, real32, word32, word32);

typedef  Eq_393struct  {
	 tFFFBFF0C;	// FFFBFF0C
} Eq_393;

typedef union  {
	real32 u0;
	real64 u1;
} Eq_397;

typedef void (Eq_413)(int32, word32, int32, word32, , , , int32);

typedef union  {
	real32 u0;
	real64 u1;
} Eq_445;

typedef union  {
	real32 u0;
	real64 u1;
} Eq_606;

typedef void (Eq_632)( *,  *,  *);

typedef union  {
	real32 u0;
	real64 u1;
} Eq_658;

typedef union  {
	real32 u0;
	real64 u1;
} Eq_659;

typedef  Eq_690struct  {
	 t0000;	// 0
} Eq_690;

typedef  (Eq_707)(real64);

