// subject.h
// Generated on TIMESTAMP by decompiling from_pouet.net/with_source_295/ia32_com/subject.exe
// using Decompiler version VERSION

/*
// Equivalence classes ////////////
Eq_1: (struct "Globals" (FFF80000 (ptr Eq_55) ptrFFF80000) (FFFA0000 (ptr Eq_9) ptrFFFA0000))
	globals_t (in globals : (ptr (struct "Globals")))
Eq_2: (fn void (byte))
	T_2 (in bios_video_set_mode : ptr32)
	T_3 (in signature of bios_video_set_mode : void)
Eq_7: (fn void ((ptr Eq_9), word16))
	T_7 (in msdos_display_string : ptr32)
	T_8 (in signature of msdos_display_string : void)
Eq_9: (segment "Eq_9" (0 Eq_37 t0000) (1FA word16 w01FA) (1FC word16 w01FC) (1FE word16 w01FE) (400 Eq_82 t0400) (41D Eq_124 t041D))
	T_9 (in ds : selector)
	T_11 (in ds : (ptr Eq_9))
	T_245 (in 0xA000 : selector)
Eq_18: (fn void (word16, byte))
	T_18 (in __outb : ptr32)
Eq_28: (fn void (word16, byte))
	T_28 (in __outb : ptr32)
Eq_31: (fn void (word16, byte))
	T_31 (in __outb : ptr32)
Eq_34: (fn void (word16, byte))
	T_34 (in __outb : ptr32)
Eq_37: (struct "Eq_37" 0002 (FFFFFFFE Eq_46 tFFFFFFFE) (0 word16 w0000))
	T_37 (in cx : (memptr (ptr Eq_9) Eq_37))
	T_39 (in cx - 0x0001 : word16)
	T_42 (in 0x0000 : word16)
	T_45 (in DPB(cx, 0x02, 0, 8) : word16)
	T_87 (in cx + 0x0001 : word16)
	T_235 (in cx_322 : (memptr (ptr Eq_9) Eq_37))
	T_236 (in DPB(cx_322, ch_111, 8, 8) : word16)
	T_238 (in di_272 : (memptr (ptr Eq_9) Eq_37))
	T_239 (in si_273 : (memptr (ptr Eq_9) Eq_37))
	T_241 (in DPB(cx_322, 0x78, 8, 8) : word16)

  OrigDataType: (memptr T_9 (struct 0002 (FFFFFFFE T_253 tFFFFFFFE) (0 T_248 t0000)))
T_239: (in si_273 : (memptr (ptr Eq_9) Eq_37))
  Class: Eq_37
  DataType: (memptr (ptr Eq_9) Eq_37)
  OrigDataType: (memptr T_11 (struct 0002 (0 T_244 t0000)))
T_240: (in 0x78 : byte)
  Class: Eq_240
  DataType: byte
  OrigDataType: byte
T_241: (in DPB(cx_322, 0x78, 8, 8) : word16)
  Class: Eq_37
  DataType: (memptr (ptr Eq_9) Eq_37)
  OrigDataType: word16
T_242: (in 0x0000 : word16)
  Class: Eq_242
  DataType: word16
  OrigDataType: word16
T_243: (in si_273 + 0x0000 : word16)
  Class: Eq_243
  DataType: word16
  OrigDataType: word16
T_244: (in Mem243[ds:si_273 + 0x0000:word16] : word16)
  Class: Eq_244
  DataType: word16
  OrigDataType: word16
T_245: (in 0xA000 : selector)
  Class: Eq_9
  DataType: (ptr Eq_9)
  OrigDataType: (ptr (segment))
T_246: (in 0x0000 : word16)
  Class: Eq_246
  DataType: word16
  OrigDataType: word16
T_247: (in di_272 + 0x0000 : word16)
  Class: Eq_247
  DataType: word16
  OrigDataType: word16
T_248: (in Mem280[0xA000:di_272 + 0x0000:word16] : word16)
  Class: Eq_244
  DataType: word16
  OrigDataType: word16
T_249: (in 0x0002 : word16)
  Class: Eq_249
  DataType: word16
  OrigDataType: word16
T_250: (in di_272 + 0x0002 : word16)
  Class: Eq_37
  DataType: (memptr (ptr Eq_9) Eq_37)
  OrigDataType: word16
T_251: (in 0x0002 : word16)
  Class: Eq_251
  DataType: word16
  OrigDataType: word16
T_252: (in di_272 - 0x0002 : word16)
  Class: Eq_252
  DataType: word16
  OrigDataType: word16
T_253: (in Mem283[ds:di_272 - 0x0002:word16] : word16)
  Class: Eq_46
  DataType: Eq_46
  OrigDataType: word16
T_254: (in 0x0002 : word16)
  Class: Eq_254
  DataType: word16
  OrigDataType: word16
T_255: (in si_273 + 0x0002 : word16)
  Class: Eq_37
  DataType: (memptr (ptr Eq_9) Eq_37)
  OrigDataType: word16
T_256: (in 0x0001 : word16)
  Class: Eq_256
  DataType: word16
  OrigDataType: word16
T_257: (in cx - 0x0001 : word16)
  Class: Eq_37
  DataType: (memptr (ptr Eq_9) Eq_37)
  OrigDataType: word16
T_258: (in 0x0000 : word16)
  Class: Eq_37
  DataType: (memptr (ptr Eq_9) Eq_37)
  OrigDataType: word16
T_259: (in cx != &Eq_9::t0000 : bool)
  Class: Eq_259
  DataType: bool
  OrigDataType: bool
T_260: (in __inb : ptr32)
  Class: Eq_260
  DataType: (ptr Eq_260)
  OrigDataType: (ptr (fn T_262 (T_261)))
T_261: (in 0x60 : byte)
  Class: Eq_261
  DataType: byte
  OrigDataType: byte
T_262: (in __inb(0x60) : byte)
  Class: Eq_262
  DataType: byte
  OrigDataType: byte
T_263: (in DPB(ax_182, __inb(0x60), 0, 8) : word16)
  Class: Eq_263
  DataType: word16
  OrigDataType: word16
T_264: (in 0x0001 : word16)
  Class: Eq_263
  DataType: word16
  OrigDataType: word16
T_265: (in DPB(ax_182, __inb(0x60), 0, 8) != 0x0001 : bool)
  Class: Eq_265
  DataType: bool
  OrigDataType: bool
*/
typedef Eq_55 Eq_1Eq_9 Eq_1struct Globals {
	Eq_55 * ptrFFF80000;	// FFF80000
	Eq_9 * ptrFFFA0000;	// FFFA0000
} Eq_1;

typedef void (Eq_2)(byte);

typedef void (Eq_7)(Eq_9 *, word16);

typedef Eq_37 Eq_9Eq_82 Eq_9Eq_124 Eq_9struct Eq_9 {
	Eq_37 t0000;	// 0
	word16 w01FA;	// 1FA
	word16 w01FC;	// 1FC
	word16 w01FE;	// 1FE
	Eq_82 t0400;	// 400
	Eq_124 t041D;	// 41D
} Eq_9;

typedef void (Eq_18)(word16, byte);

typedef void (Eq_28)(word16, byte);

typedef void (Eq_31)(word16, byte);

typedef void (Eq_34)(word16, byte);

typedef Eq_46 Eq_37struct Eq_37 {	// size: 2 2
	Eq_46 tFFFFFFFE;	// FFFFFFFE
	word16 w0000;	// 0
} Eq_37;

typedef union Eq_46 {
	ui16 u0;
	uint8 Eq_9::* u1;
} Eq_46;

typedef struct Eq_55 {
	byte b0000;	// 0
} Eq_55;

typedef Eq_108 Eq_82Eq_104 Eq_82struct Eq_82 {
	int16 w0000;	// 0
	Eq_108 t001F;	// 1F
	Eq_104 t0023;	// 23
} Eq_82;

typedef union Eq_95 {
	real16 u0;
	real64 u1;
} Eq_95;

typedef union Eq_99 {
	real16 u0;
	real64 u1;
} Eq_99;

typedef union Eq_102 {
	real16 u0;
	real64 u1;
} Eq_102;

typedef union Eq_104 {
	real32 u0;
	real64 u1;
} Eq_104;

typedef Eq_104 (Eq_105)(Eq_95);

typedef Eq_108 (Eq_107)(Eq_95);

typedef union Eq_108 {
	real32 u0;
	real64 u1;
} Eq_108;

typedef struct Eq_121 {	// size: 1 1
	int16 w0000;	// 0
} Eq_121;

typedef Eq_164 Eq_124Eq_169 Eq_124struct Eq_124 {	// size: 1 1
	Eq_164 t0000;	// 0
	Eq_169 t0004;	// 4
} Eq_124;

typedef struct Eq_131 {	// size: 1 1
	int16 w0000;	// 0
} Eq_131;

typedef struct Eq_150 {
	int16 w0001;	// 1
} Eq_150;

typedef union Eq_153 {
	real16 u0;
	real64 u1;
} Eq_153;

typedef union Eq_164 {
	real16 u0;
	real32 u1;
} Eq_164;

typedef union Eq_165 {
	real16 u0;
	real64 u1;
} Eq_165;

typedef union Eq_169 {
	real16 u0;
	real32 u1;
} Eq_169;

typedef union Eq_170 {
	real16 u0;
	real64 u1;
} Eq_170;

typedef union Eq_176 {
	real16 u0;
	real64 u1;
} Eq_176;

typedef union Eq_186 {
	real16 u0;
	real64 u1;
} Eq_186;

typedef union Eq_190 {
	real16 u0;
	real64 u1;
} Eq_190;

typedef union Eq_191 {
	real16 u0;
	real64 u1;
} Eq_191;

typedef struct Eq_205 {
	byte b7DA0;	// 7DA0
} Eq_205;

typedef byte (Eq_260)(byte);

