// subject.h
// Generated on TIMESTAMP by decompiling from_pouet.net/with_source_287/ia32_com/subject.exe
// using Decompiler version VERSION

/*
// Equivalence classes ////////////
Eq_1: (struct "Globals" (FFFA0000 (ptr Eq_256) ptrFFFA0000))
	globals_t (in globals : (ptr (struct "Globals")))
Eq_2: (fn void (byte))
	T_2 (in bios_video_set_mode : ptr32)
	T_3 (in signature of bios_video_set_mode : void)
Eq_7: (fn void (word16, byte))
	T_7 (in __outb : ptr32)
Eq_24: (fn void (uint16, bcu8))
	T_24 (in __outb : ptr32)
Eq_48: (segment "Eq_48" (1FE (arr byte) a01FE) (200 (arr byte) a0200) (2FE word16 w02FE) (300 (arr byte) a0300) (3FE (arr byte) a03FE))
	T_48 (in ds : (ptr Eq_48))
Eq_51: (union "Eq_51" (int16 u0) ((memptr (ptr Eq_48) Eq_292) u1))
	T_51 (in bx_58 : Eq_51)
	T_52 (in 0x4000 : word16)
	T_53 (in ax_138 : Eq_51)
	T_54 (in 0x3FFB : word16)
	T_55 (in si_133 : Eq_51)
	T_56 (in 0x3FFB : word16)
	T_70 (in __shrd((word16) dx_ax_76, SLICE(dx_ax_76, word16, 16), 0x0D) - bx_58 : word16)
	T_87 (in si_144 : Eq_51)
	T_89 (in si_133 + 0x0001 : word16)
	T_93 (in ax_223 : Eq_51)
	T_101 (in si_460 : Eq_51)
	T_105 (in bx_239 : Eq_51)
	T_110 (in DPB((bp_194 << cl_216) + si_460, 0x00, 8, 8) : word16)
	T_280 (in ax_444 - 0x0001 : word16)
Eq_57: (struct "Eq_57" 0001 (FFFFFF00 byte bFFFFFF00) (0 byte b0000))
	T_57 (in di_68 : (memptr (ptr Eq_48) Eq_57))
	T_58 (in 0x0300 : word16)
	T_80 (in di_68 + 0x0001 : word16)
Eq_65: (fn word16 (word16, word16, byte))
	T_65 (in __shrd : ptr32)

  OrigDataType: uint16
T_263: (in 0x0000 : word16)
  Class: Eq_263
  DataType: word16
  OrigDataType: word16
T_264: (in di_412 + 0x0000 : word16)
  Class: Eq_264
  DataType: word16
  OrigDataType: word16
T_265: (in Mem423[0xA000:di_412 + 0x0000:byte] : byte)
  Class: Eq_259
  DataType: Eq_259
  OrigDataType: byte
T_266: (in 0x0001 : word16)
  Class: Eq_266
  DataType: word16
  OrigDataType: word16
T_267: (in si_413 + 0x0001 : word16)
  Class: Eq_251
  DataType: (memptr (ptr Eq_48) byte)
  OrigDataType: word16
T_268: (in 0x0001 : word16)
  Class: Eq_268
  DataType: word16
  OrigDataType: word16
T_269: (in di_412 + 0x0001 : word16)
  Class: Eq_249
  DataType: (memptr (ptr Eq_256) Eq_249)
  OrigDataType: word16
T_270: (in 0x0001 : word16)
  Class: Eq_270
  DataType: word16
  OrigDataType: word16
T_271: (in cx_411 - 0x0001 : word16)
  Class: Eq_246
  DataType: word16
  OrigDataType: word16
T_272: (in 0x0000 : word16)
  Class: Eq_246
  DataType: word16
  OrigDataType: word16
T_273: (in cx_411 != 0x0000 : bool)
  Class: Eq_273
  DataType: bool
  OrigDataType: bool
T_274: (in ax_444 : int16)
  Class: Eq_274
  DataType: int16
  OrigDataType: word16
T_275: (in __inb : ptr32)
  Class: Eq_275
  DataType: (ptr Eq_275)
  OrigDataType: (ptr (fn T_277 (T_276)))
T_276: (in 0x60 : byte)
  Class: Eq_276
  DataType: byte
  OrigDataType: byte
T_277: (in __inb(0x60) : byte)
  Class: Eq_277
  DataType: byte
  OrigDataType: byte
T_278: (in (int16) __inb(0x60) : int16)
  Class: Eq_274
  DataType: int16
  OrigDataType: int16
T_279: (in 0x0001 : word16)
  Class: Eq_279
  DataType: word16
  OrigDataType: word16
T_280: (in ax_444 - 0x0001 : word16)
  Class: Eq_51
  DataType: Eq_51
  OrigDataType: word16
T_281: (in 0x0001 : word16)
  Class: Eq_274
  DataType: int16
  OrigDataType: word16
T_282: (in ax_444 != 0x0001 : bool)
  Class: Eq_282
  DataType: bool
  OrigDataType: bool
T_283: (in __syscall : ptr32)
  Class: Eq_283
  DataType: (ptr Eq_283)
  OrigDataType: (ptr (fn T_285 (T_284)))
T_284: (in 0x10 : byte)
  Class: Eq_284
  DataType: byte
  OrigDataType: byte
T_285: (in __syscall(0x10) : void)
  Class: Eq_285
  DataType: void
  OrigDataType: void
T_286:
  Class: Eq_286
  DataType: byte
  OrigDataType: (struct 0001 (0 T_75 t0000))
T_287:
  Class: Eq_287
  DataType: byte
  OrigDataType: (struct 0001 (0 T_78 t0000))
T_288:
  Class: Eq_288
  DataType: byte
  OrigDataType: (struct 0001 (0 T_228 t0000))
T_289:
  Class: Eq_289
  DataType: byte
  OrigDataType: (struct 0001 (0 T_255 t0000))
T_290:
  Class: Eq_290
  DataType: Eq_290
  OrigDataType: (struct 0001 (0 T_259 t0000))
T_291:
  Class: Eq_290
  DataType: Eq_290
  OrigDataType: (struct 0001 (0 T_265 t0000))
T_292:
  Class: Eq_292
  DataType: Eq_292
  OrigDataType: 
T_293:
  Class: Eq_293
  DataType: Eq_293
  OrigDataType: 
*/
typedef Eq_256 Eq_1struct Globals {
	Eq_256 * ptrFFFA0000;	// FFFA0000
} Eq_1;

typedef void (Eq_2)(byte);

typedef void (Eq_7)(word16, byte);

typedef void (Eq_24)(uint16, bcu8);

typedef  Eq_48[][][][]struct Eq_48 {
	byte a01FE[];	// 1FE
	byte a0200[];	// 200
	word16 w02FE;	// 2FE
	byte a0300[];	// 300
	byte a03FE[];	// 3FE
} Eq_48;

typedef union Eq_51 {
	int16 u0;
	Eq_292 Eq_48::* u1;
} Eq_51;

typedef struct Eq_57 {	// size: 1 1
	byte bFFFFFF00;	// FFFFFF00
	byte b0000;	// 0
} Eq_57;

typedef word16 (Eq_65)(word16, word16, byte);

typedef Eq_143 Eq_85struct Eq_85 {	// size: 1 1
	Eq_143 t0000;	// 0
} Eq_85;

typedef struct Eq_98 {
	byte b02BE;	// 2BE
	byte b02FE;	// 2FE
} Eq_98;

typedef struct Eq_126 {
	int8 b02BE;	// 2BE
} Eq_126;

typedef union Eq_143 {
	int16 u0;
	byte u1;
} Eq_143;

typedef union Eq_146 {
	int8 u0;
	int16 u1;
} Eq_146;

typedef union Eq_172 {
	uint16 u0;
	byte Eq_48::* u1;
} Eq_172;

typedef struct Eq_177 {	// size: 1 1
	byte b5C1E;	// 5C1E
} Eq_177;

typedef struct Eq_210 {
} Eq_210;

typedef union Eq_211 {
	ptr16 u0;
	Eq_293 Eq_210::* u1;
} Eq_211;

typedef struct Eq_221 {
	byte b02BE;	// 2BE
} Eq_221;

typedef struct Eq_233 {
	byte b02FE;	// 2FE
} Eq_233;

typedef Eq_259 Eq_249struct Eq_249 {	// size: 1 1
	Eq_259 t0000;	// 0
} Eq_249;

typedef Eq_290 Eq_256[]struct Eq_256 {
	Eq_290 a2580[];	// 2580
} Eq_256;

typedef union Eq_259 {
	uint16 u0;
	byte u1;
} Eq_259;

typedef byte (Eq_275)(byte);

typedef void (Eq_283)(byte);

typedef Eq_259 Eq_290struct Eq_290 {	// size: 1 1
	Eq_259 t0000;	// 0
} Eq_290;

typedef struct Eq_292 {
	byte b02BE;	// 2BE
} Eq_292;

typedef struct Eq_293 {
	word16 wFFFFFFE8;	// FFFFFFE8
} Eq_293;

