// subject.h
// Generated on 5/4/2015 1:15:46 AM by decompiling malware_via_email/malware_0541/ia32_pe/subject.exe
// using Decompiler version 0.4.2.0.

/*
// Equivalence classes ////////////
Eq_1: (struct "Globals" (FC110199 Eq_63 tFC110199) (12C00 Eq_68 t12C00))
	globals_t (in globals : (ptr (struct "Globals")))
Eq_15: (struct "Eq_15" 0001 (0 byte b0000) (1 Eq_15 t0001))
	T_15 (in dwArg08_28 : (ptr Eq_15))
	T_17 (in dwArg08 + dwArg14 : word32)
	T_42 (in dwArg08_28 + 0x00000001 : word32)
Eq_29: (struct "Eq_29" 0001 (0 byte b0000) (1 Eq_29 t0001))
	T_29 (in dwArg04 : word32)
	T_40 (in dwArg04 + 0x00000001 : word32)
Eq_49: (fn word32 (Eq_51))
	T_49 (in SetErrorMode : ptr32)
	T_50 (in signature of SetErrorMode : void)
Eq_51: (union "Eq_51" (word32 u0) (UINT u1))
	T_51 (in uMode : UINT)
	T_52 (in 0x5C000000 : word32)
Eq_55: (fn void (Eq_57))
	T_55 (in GetStartupInfoA : ptr32)
	T_56 (in signature of GetStartupInfoA : void)
	T_417 (in GetStartupInfoA : ptr32)
Eq_57: (union "Eq_57" (word32 u0) (LPSTARTUPINFOA u1))
	T_57 (in lpStartupInfo : LPSTARTUPINFOA)
	T_60 (in fp + 0xFFFFFD6C : word32)
	T_333 (in fp - 0x00000070 : word32)
	T_336 (in Mem68[esp_59 + 0xFFFFFFF4:word32] : word32)
	T_411 (in eax_113 : Eq_57)
	T_413 (in fp - 0x00000060 : word32)
	T_416 (in Mem108[esp_59 + 0xFFFFFFF4:word32] : word32)
	T_419 (in Mem108[esp_59 + 0xFFFFFFF4:LPSTARTUPINFOA] : LPSTARTUPINFOA)
	T_429 (in 0x0000000A : word32)
	T_432 (in Mem152[esp_59 + 0xFFFFFFF4:word32] : word32)

  Class: Eq_466
  DataType: word32
  OrigDataType: word32
T_467: (in esp_115 + 0x00000016 : word32)
  Class: Eq_467
  DataType: word32
  OrigDataType: word32
T_468: (in Mem133[esp_115 + 0x00000016:word32] : word32)
  Class: Eq_465
  DataType: int32
  OrigDataType: word32
T_469: (in exit : ptr32)
  Class: Eq_469
  DataType: (ptr Eq_469)
  OrigDataType: (ptr (fn T_474 (T_473)))
T_470: (in signature of exit : void)
  Class: Eq_469
  DataType: (ptr Eq_469)
  OrigDataType: 
T_471: (in _Code : int32)
  Class: Eq_465
  DataType: int32
  OrigDataType: int32
T_472: (in esp_115 + 0x00000016 : word32)
  Class: Eq_472
  DataType: word32
  OrigDataType: word32
T_473: (in Mem133[esp_115 + 0x00000016:int32] : int32)
  Class: Eq_465
  DataType: int32
  OrigDataType: int32
T_474: (in exit(esp_115->dw0016) : void)
  Class: Eq_474
  DataType: void
  OrigDataType: void
T_475: (in ecx_137 : word32)
  Class: Eq_475
  DataType: word32
  OrigDataType: word32
T_476: (in dwLoc18 : word32)
  Class: Eq_476
  DataType: (ptr (ptr word32))
  OrigDataType: (ptr (struct (0 T_479 t0000)))
T_477: (in 0x00000000 : word32)
  Class: Eq_477
  DataType: word32
  OrigDataType: word32
T_478: (in dwLoc18 + 0x00000000 : word32)
  Class: Eq_478
  DataType: word32
  OrigDataType: word32
T_479: (in Mem133[dwLoc18 + 0x00000000:word32] : word32)
  Class: Eq_479
  DataType: (ptr word32)
  OrigDataType: (ptr (struct (0 T_480 t0000)))
T_480: (in Mem133[Mem133[dwLoc18 + 0x00000000:word32]:word32] : word32)
  Class: Eq_475
  DataType: word32
  OrigDataType: word32
T_481: (in 0x00000012 : word32)
  Class: Eq_481
  DataType: word32
  OrigDataType: word32
T_482: (in esp_115 + 0x00000012 : word32)
  Class: Eq_482
  DataType: word32
  OrigDataType: word32
T_483: (in Mem140[esp_115 + 0x00000012:word32] : word32)
  Class: Eq_476
  DataType: (ptr (ptr word32))
  OrigDataType: word32
T_484: (in 0x0000000E : word32)
  Class: Eq_484
  DataType: word32
  OrigDataType: word32
T_485: (in esp_115 + 0x0000000E : word32)
  Class: Eq_485
  DataType: word32
  OrigDataType: word32
T_486: (in Mem142[esp_115 + 0x0000000E:word32] : word32)
  Class: Eq_475
  DataType: word32
  OrigDataType: word32
T_487: (in _XcptFilter : ptr32)
  Class: Eq_487
  DataType: (ptr code)
  OrigDataType: (ptr code)
T_488: (in signature of _XcptFilter : void)
  Class: Eq_487
  DataType: (ptr code)
  OrigDataType: 
T_489: (in _controlfp : ptr32)
  Class: Eq_489
  DataType: (ptr code)
  OrigDataType: (ptr code)
T_490: (in signature of _controlfp : void)
  Class: Eq_489
  DataType: (ptr code)
  OrigDataType: 
T_491:
  Class: Eq_491
  DataType: Eq_491
  OrigDataType: 
T_492:
  Class: Eq_492
  DataType: Eq_492
  OrigDataType: 
*/
typedef Eq_63 Eq_1LONG Eq_1struct Globals {
	Eq_63 tFC110199;	// FC110199
	LONG t12C00;	// 12C00
} Eq_1;

typedef Eq_15 Eq_15struct Eq_15 {	// size: 1 1
	byte b0000;	// 0
	Eq_15 t0001;	// 1
} Eq_15;

typedef Eq_29 Eq_29struct Eq_29 {	// size: 1 1
	byte b0000;	// 0
	Eq_29 t0001;	// 1
} Eq_29;

typedef word32 (Eq_49)(Eq_51);

typedef union Eq_51 {
	word32 u0;
	 UINT u1;
} Eq_51;

typedef void (Eq_55)(Eq_57);

typedef union Eq_57 {
	word32 u0;
	 LPSTARTUPINFOA u1;
} Eq_57;

typedef Eq_187 Eq_63struct Eq_63 {
	word32 dw9309E6A9;	// 9309E6A9
	word32 dw9309E6AD;	// 9309E6AD
	ui32 dw9309E6B1;	// 9309E6B1
	word32 dw9309E6B5;	// 9309E6B5
	word32 dw9309E6B9;	// 9309E6B9
	Eq_187 t9309E6BD;	// 9309E6BD
} Eq_63;

typedef Eq_63 * (Eq_64)(SAFEARRAY *, Eq_67, LONG *);

typedef SAFEARRAY;

typedef union Eq_67 {
	word32 u0;
	 UINT u1;
} Eq_67;

typedef LONG;

typedef word32 (Eq_87)(Eq_89 *, word32, word32, word32, word32, word32);

typedef code Eq_89struct Eq_89 {
	byte b0000;	// 0
	code t0F50;	// F50
} Eq_89;

typedef union Eq_138 {
	word32 u0;
	 LPCSTR u1;
} Eq_138;

typedef Eq_138 (Eq_139)(Eq_138);

typedef Eq_253 Eq_187struct Eq_187 {	// size: 4 4
	word32 dw0000;	// 0
	Eq_253 t0004;	// 4
} Eq_187;

typedef Eq_89 * (Eq_190)(Eq_192, Eq_193, Eq_194, Eq_195);

typedef union Eq_192 {
	word32 u0;
	 LPVOID u1;
} Eq_192;

typedef union Eq_193 {
	word32 u0;
	 SIZE_T u1;
} Eq_193;

typedef union Eq_194 {
	word32 u0;
	 DWORD u1;
} Eq_194;

typedef union Eq_195 {
	word32 u0;
	 DWORD u1;
} Eq_195;

typedef Eq_204 Eq_204struct Eq_204 {	// size: 1 1
	byte b0000;	// 0
	Eq_204 t0001;	// 1
} Eq_204;

typedef Eq_187 Eq_253struct Eq_253 {
	word32 dw0000;	// 0
	Eq_187 t0004;	// 4
} Eq_253;

typedef struct Eq_281 {
	word32 * ptr0000;	// 0
} Eq_281;

typedef union Eq_287 {
	ptr32 u0;
	word32* Eq_281::* u1;
} Eq_287;

typedef void (Eq_307)();

typedef void (Eq_315)();

typedef Eq_57 Eq_318struct Eq_318 {
	word32 dwFFFFFFD8;	// FFFFFFD8
	word32 dwFFFFFFDC;	// FFFFFFDC
	word32 dwFFFFFFE4;	// FFFFFFE4
	word32 dwFFFFFFE8;	// FFFFFFE8
	word32 dwFFFFFFEC;	// FFFFFFEC
	word32 dwFFFFFFF0;	// FFFFFFF0
	Eq_57 tFFFFFFF4;	// FFFFFFF4
	word32 dwFFFFFFFC;	// FFFFFFFC
	word32 dw0000;	// 0
} Eq_318;

typedef Eq_368 Eq_368struct Eq_368 {	// size: 1 1
	bcu8 b0000;	// 0
	Eq_368 t0001;	// 1
} Eq_368;

typedef Eq_138 Eq_439Eq_368 Eq_439Eq_57 Eq_439struct Eq_439 {
	Eq_138 tFFFFFFF4;	// FFFFFFF4
	word32 dwFFFFFFF8;	// FFFFFFF8
	Eq_368 * ptrFFFFFFFC;	// FFFFFFFC
	Eq_57 t0000;	// 0
	word32 dw000E;	// E
	word32 * * ptr0012;	// 12
	int32 dw0016;	// 16
} Eq_439;

typedef int32 (Eq_463)();

typedef void (Eq_469)(int32);

typedef DWORDLPSTRLPSTRLPSTRDWORDDWORDDWORDDWORDDWORDDWORDDWORDDWORDWORDWORDLPBYTEHANDLEHANDLEHANDLEstruct _STARTUPINFOA {
	DWORD;	// 0
	LPSTR;	// 4
	LPSTR;	// 8
	LPSTR;	// C
	DWORD;	// 10
	DWORD;	// 14
	DWORD;	// 18
	DWORD;	// 1C
	DWORD;	// 20
	DWORD;	// 24
	DWORD;	// 28
	DWORD;	// 2C
	WORD;	// 30
	WORD;	// 32
	LPBYTE;	// 34
	HANDLE;	// 38
	HANDLE;	// 3C
	HANDLE;	// 40
} Eq_491;

typedef ULONGLONGstruct tagSAFEARRAYBOUND {
	ULONG;	// 0
	LONG;	// 4
} Eq_492;

