// subject.h
// Generated on TIMESTAMP by decompiling malware_via_email/malware_1168/ia32_pe/subject.exe
// using Decompiler version VERSION

/*
// Equivalence classes ////////////
Eq_1: (struct "Globals" (FFFFFE6D Eq_204 tFFFFFE6D) (402001 Eq_156 t402001) (40797C Eq_155 t40797C) (4079C0 (ptr Eq_154) ptr4079C0) (4079C4 word32 dw4079C4) (4079C8 int32 dw4079C8) (4079CC word32 dw4079CC) (4079D0 (ptr Eq_154) ptr4079D0) (4079D4 (ptr Eq_372) ptr4079D4) (4079D8 word32 dw4079D8) (4079DC (ptr Eq_154) ptr4079DC) (4079E0 word32 dw4079E0) (4079E4 (ptr Eq_154) ptr4079E4) (4079E8 (ptr Eq_366) ptr4079E8) (407A00 (ptr code) ptr407A00) (407A04 (ptr code) ptr407A04) (407A08 (ptr code) ptr407A08) (407A0C (ptr code) ptr407A0C) (407A10 (ptr code) ptr407A10) (407A14 (ptr code) ptr407A14) (407A18 (ptr code) ptr407A18) (407A1C (ptr code) ptr407A1C) (407A20 (ptr code) ptr407A20) (407A24 (ptr code) ptr407A24) (407A28 (ptr code) ptr407A28) (407A2C (ptr code) ptr407A2C) (407A30 (ptr code) ptr407A30) (407A34 (ptr code) ptr407A34) (407A38 (ptr code) ptr407A38) (407A3C (ptr code) ptr407A3C) (AAE55A Eq_154 tAAE55A))
	globals_t (in globals : (ptr (struct "Globals")))
Eq_39: (fn word32 ())
	T_39 (in GetCommandLineA : ptr32)
	T_40 (in signature of GetCommandLineA : void)
	T_58 (in GetCommandLineA : ptr32)
	T_198 (in dwArg04 : (ptr Eq_39))
	T_199 (in GetCommandLineA : ptr32)
	T_207 (in GetCommandLineA : ptr32)
	T_222 (in GetCommandLineA : ptr32)
Eq_80: (struct "Eq_80" 1000 (0 Eq_88 t0000) (3C word32 dw003C))

  OrigDataType: (ptr (struct (8 T_1346 t0008)))
T_1344: (in 0x00000008 : word32)
  Class: Eq_1344
  DataType: word32
  OrigDataType: word32
T_1345: (in Mem0[edx_7 + 0x00000030:word32] + 0x00000008 : word32)
  Class: Eq_1345
  DataType: word32
  OrigDataType: word32
T_1346: (in Mem12[Mem0[edx_7 + 0x00000030:word32] + 0x00000008:word32] : word32)
  Class: Eq_1340
  DataType: word32
  OrigDataType: word32
T_1347:
  Class: Eq_1347
  DataType: word16
  OrigDataType: (struct 0002 (0 T_188 t0000))
T_1348:
  Class: Eq_1348
  DataType: word32
  OrigDataType: (struct 0004 (0 T_192 t0000))
T_1349:
  Class: Eq_1349
  DataType: Eq_1349
  OrigDataType: (struct 0008 (0 T_465 t0000))
T_1350:
  Class: Eq_1350
  DataType: word16
  OrigDataType: (struct 0002 (0 T_935 t0000))
T_1351:
  Class: Eq_1350
  DataType: word16
  OrigDataType: (struct 0002 (0 T_947 t0000))
T_1352:
  Class: Eq_1350
  DataType: word16
  OrigDataType: (struct 0002 (0 T_960 t0000))
T_1353:
  Class: Eq_1353
  DataType: word16
  OrigDataType: (struct 0002 (0 T_1158 t0000))
T_1354:
  Class: Eq_1353
  DataType: word16
  OrigDataType: (struct 0002 (0 T_1170 t0000))
T_1355:
  Class: Eq_1353
  DataType: word16
  OrigDataType: (struct 0002 (0 T_1183 t0000))
T_1356:
  Class: Eq_1356
  DataType: word16
  OrigDataType: (struct 0002 (0 T_1295 t0000))
T_1357:
  Class: Eq_1356
  DataType: word16
  OrigDataType: (struct 0002 (0 T_1309 t0000))
T_1358:
  Class: Eq_1356
  DataType: word16
  OrigDataType: (struct 0002 (0 T_1324 t0000))
T_1359:
  Class: Eq_1359
  DataType: Eq_1359
  OrigDataType: 
T_1360:
  Class: Eq_1360
  DataType: Eq_1360
  OrigDataType: 
T_1361:
  Class: Eq_1361
  DataType: int32
  OrigDataType: 
T_1362:
  Class: Eq_1362
  DataType: int32
  OrigDataType: 
*/
typedef Eq_204 Eq_1Eq_156 Eq_1Eq_155 Eq_1Eq_154 Eq_1Eq_154 Eq_1Eq_372 Eq_1Eq_154 Eq_1Eq_154 Eq_1Eq_366 Eq_1code Eq_1code Eq_1code Eq_1code Eq_1code Eq_1code Eq_1code Eq_1code Eq_1code Eq_1code Eq_1code Eq_1code Eq_1code Eq_1code Eq_1code Eq_1code Eq_1Eq_154 Eq_1struct Globals {
	Eq_204 tFFFFFE6D;	// FFFFFE6D
	Eq_156 t402001;	// 402001
	Eq_155 t40797C;	// 40797C
	Eq_154 * ptr4079C0;	// 4079C0
	word32 dw4079C4;	// 4079C4
	int32 dw4079C8;	// 4079C8
	word32 dw4079CC;	// 4079CC
	Eq_154 * ptr4079D0;	// 4079D0
	Eq_372 * ptr4079D4;	// 4079D4
	word32 dw4079D8;	// 4079D8
	Eq_154 * ptr4079DC;	// 4079DC
	word32 dw4079E0;	// 4079E0
	Eq_154 * ptr4079E4;	// 4079E4
	Eq_366 * ptr4079E8;	// 4079E8
	code * ptr407A00;	// 407A00
	code * ptr407A04;	// 407A04
	code * ptr407A08;	// 407A08
	code * ptr407A0C;	// 407A0C
	code * ptr407A10;	// 407A10
	code * ptr407A14;	// 407A14
	code * ptr407A18;	// 407A18
	code * ptr407A1C;	// 407A1C
	code * ptr407A20;	// 407A20
	code * ptr407A24;	// 407A24
	code * ptr407A28;	// 407A28
	code * ptr407A2C;	// 407A2C
	code * ptr407A30;	// 407A30
	code * ptr407A34;	// 407A34
	code * ptr407A38;	// 407A38
	code * ptr407A3C;	// 407A3C
	Eq_154 tAAE55A;	// AAE55A
} Eq_1;

typedef word32 (Eq_39)();

typedef Eq_88 Eq_80struct Eq_80 {	// size: 4096 1000
	Eq_88 t0000;	// 0
	word32 dw003C;	// 3C
} Eq_80;

typedef union Eq_88 {
	word16 u0;
	word32 u1;
} Eq_88;

typedef struct Eq_105 {
	uint32 dw0018;	// 18
	word32 dw001C;	// 1C
	word32 dw0020;	// 20
	word32 dw0024;	// 24
} Eq_105;

typedef struct Eq_106 {
	word32 dw003C;	// 3C
} Eq_106;

typedef struct Eq_110 {
	word32 dw0078;	// 78
} Eq_110;

typedef Eq_120 Eq_120struct Eq_120 {	// size: 4 4
	word32 dw0000;	// 0
	Eq_120 t0004;	// 4
} Eq_120;

typedef struct Eq_144 {
	word32 dwFFFFFFAC;	// FFFFFFAC
	byte bFFFFFFC4;	// FFFFFFC4
	byte bFFFFFFD1;	// FFFFFFD1
	byte bFFFFFFD2;	// FFFFFFD2
} Eq_144;

typedef void (Eq_152)(Eq_154 *, Eq_155 *, Eq_156);

typedef union Eq_154 {
	Eq_1359 u0;
	Eq_1360 u1;
} Eq_154;

typedef struct Eq_155 {
	word32 dw003C;	// 3C
} Eq_155;

typedef union Eq_156 {
	int32 u0;
	up32 u1;
} Eq_156;

typedef word32 (Eq_174)(word32, word32, Eq_156);

typedef Eq_154 * (Eq_196)( *);

typedef struct Eq_204 {
	word32 dwFFFFFDFC;	// FFFFFDFC
} Eq_204;

typedef code * (Eq_212)(Eq_154 *);

typedef union Eq_220 {
	int32 u0;
	up32 u1;
} Eq_220;

typedef code * (Eq_241)(Eq_154 *, Eq_155 *);

typedef word32 (Eq_279)(Eq_281);

typedef union Eq_281 {
	word32 u0;
	 HKEY u1;
} Eq_281;

typedef Eq_154 * (Eq_298)(Eq_156);

typedef void (Eq_304)(Eq_154 *, byte, Eq_156);

typedef word32 (Eq_342)(Eq_344, Eq_345);

typedef union Eq_344 {
	word32 u0;
	 HINSTANCE u1;
} Eq_344;

typedef union Eq_345 {
	word32 u0;
	 LPCSTR u1;
} Eq_345;

typedef Eq_1203 Eq_366struct Eq_366 {
	Eq_1203 * ptr0030;	// 30
} Eq_366;

typedef Eq_366 Eq_367struct Eq_367 {
	Eq_366 * ptr0018;	// 18
} Eq_367;

typedef Eq_154 Eq_372struct Eq_372 {
	Eq_154 * ptr0008;	// 8
} Eq_372;

typedef Eq_154 Eq_401struct Eq_401 {
	word32 dwFFFFFFFC;	// FFFFFFFC
	Eq_154 * ptr0000;	// 0
} Eq_401;

typedef void (Eq_413)(word32, Eq_154 *);

typedef void (Eq_425)(word32, word32);

typedef Eq_1349 Eq_458[]struct Eq_458 {
	Eq_1349 a0078[];	// 78
} Eq_458;

typedef struct Eq_466 {
	word32 dwFFFFFFEC;	// FFFFFFEC
} Eq_466;

typedef Eq_480 Eq_480struct Eq_480 {	// size: 40 28
	word32 dw000C;	// C
	word32 dw0010;	// 10
	word32 dw0014;	// 14
	Eq_480 t0028;	// 28
} Eq_480;

typedef union Eq_514 {
	int32 u0;
	uint32 u1;
} Eq_514;

typedef word32 (Eq_530)(Eq_154 *);

typedef union Eq_584 {
	int32 u0;
	uint32 u1;
} Eq_584;

typedef code Eq_605Eq_605 Eq_605struct Eq_605 {	// size: 4 4
	code * ptr0000;	// 0
	Eq_605 t0004;	// 4
} Eq_605;

typedef Eq_154 Eq_650Eq_154 Eq_650struct Eq_650 {
	Eq_154 * ptrFFFFFFEC;	// FFFFFFEC
	word32 dwFFFFFFF0;	// FFFFFFF0
	word32 dwFFFFFFF4;	// FFFFFFF4
	word32 dwFFFFFFF8;	// FFFFFFF8
	word32 dwFFFFFFFC;	// FFFFFFFC
	Eq_154 * ptr0000;	// 0
} Eq_650;

typedef Eq_154 Eq_717Eq_154 Eq_717struct Eq_717 {
	Eq_154 * ptrFFFFFFF4;	// FFFFFFF4
	word32 dwFFFFFFF8;	// FFFFFFF8
	word32 dwFFFFFFFC;	// FFFFFFFC
	Eq_154 * ptr0000;	// 0
} Eq_717;

typedef Eq_154 Eq_736struct Eq_736 {
	Eq_154 * ptrFFFFFFFC;	// FFFFFFFC
	word32 dw0000;	// 0
	word32 dw0004;	// 4
} Eq_736;

typedef Eq_154 Eq_759struct Eq_759 {
	Eq_154 * ptrFFFFFFFC;	// FFFFFFFC
	word32 dw0000;	// 0
	word32 dw0004;	// 4
} Eq_759;

typedef Eq_154 Eq_807Eq_154 Eq_807Eq_154 Eq_807Eq_154 Eq_807struct Eq_807 {
	Eq_154 * ptrFFFFFFF4;	// FFFFFFF4
	Eq_154 * ptrFFFFFFF8;	// FFFFFFF8
	Eq_154 * ptrFFFFFFFC;	// FFFFFFFC
	Eq_154 * ptr0000;	// 0
} Eq_807;

typedef void (Eq_838)(Eq_154 *);

typedef void (Eq_859)(Eq_154 *, Eq_155 *, Eq_156);

typedef  Eq_880[]struct Eq_880 {
	word32 dw0000;	// 0
	word32 dw0004;	// 4
	word16 a0008[];	// 8
} Eq_880;

typedef Eq_154 Eq_973struct Eq_973 {
	Eq_154 * ptrFFFFFFF4;	// FFFFFFF4
	word32 dwFFFFFFF8;	// FFFFFFF8
	word32 dwFFFFFFFC;	// FFFFFFFC
	word32 dw0000;	// 0
} Eq_973;

typedef Eq_154 Eq_993Eq_154 Eq_993Eq_154 Eq_993Eq_154 Eq_993struct Eq_993 {
	Eq_154 * ptrFFFFFFDC;	// FFFFFFDC
	Eq_154 * ptrFFFFFFE0;	// FFFFFFE0
	word32 dwFFFFFFE4;	// FFFFFFE4
	word32 dwFFFFFFE8;	// FFFFFFE8
	Eq_154 * ptrFFFFFFEC;	// FFFFFFEC
	word32 dwFFFFFFF0;	// FFFFFFF0
	word32 dwFFFFFFF4;	// FFFFFFF4
	word32 dwFFFFFFF8;	// FFFFFFF8
	word32 dwFFFFFFFC;	// FFFFFFFC
	Eq_154 * ptr0000;	// 0
} Eq_993;

typedef code Eq_1058struct Eq_1058 {
	byte b0000;	// 0
	code * ptr0001;	// 1
	byte b0005;	// 5
} Eq_1058;

typedef Eq_154 Eq_1074Eq_154 Eq_1074Eq_1058 Eq_1074struct Eq_1074 {
	Eq_154 * ptrFFFFFFE8;	// FFFFFFE8
	word32 dwFFFFFFEC;	// FFFFFFEC
	Eq_154 * ptrFFFFFFF0;	// FFFFFFF0
	Eq_1058 * ptrFFFFFFF4;	// FFFFFFF4
	word32 dwFFFFFFF8;	// FFFFFFF8
	word32 dwFFFFFFFC;	// FFFFFFFC
	word32 dw0000;	// 0
} Eq_1074;

typedef  Eq_1133[]struct Eq_1133 {
	word32 dw0000;	// 0
	word32 dw0004;	// 4
	word16 a0008[];	// 8
} Eq_1133;

typedef Eq_1198 Eq_1198struct Eq_1198 {
	Eq_1198 * ptr0000;	// 0
	word32 dw0018;	// 18
	word32 dw001C;	// 1C
} Eq_1198;

typedef Eq_1206 Eq_1203struct Eq_1203 {
	word32 dw0008;	// 8
	Eq_1206 * ptr000C;	// C
} Eq_1203;

typedef Eq_1198 Eq_1206struct Eq_1206 {
	Eq_1198 * ptr000C;	// C
} Eq_1206;

typedef  Eq_1270[]struct Eq_1270 {
	word32 dw0000;	// 0
	word32 dw0004;	// 4
	word16 a0008[];	// 8
} Eq_1270;

typedef struct Eq_1349 {	// size: 8 8
	word32 dw0000;	// 0
} Eq_1349;

typedef code Eq_1359Eq_156 Eq_1359struct Eq_1359 {	// size: 4 4
	code * ptr0000;	// 0
	Eq_156 t0050;	// 50
	word32 dw00A0;	// A0
	word32 dw00A4;	// A4
} Eq_1359;

typedef code Eq_1360Eq_154 Eq_1360Eq_514 Eq_1360Eq_154 Eq_1360struct Eq_1360 {	// size: 20 14
	word32 dw0000;	// 0
	word16 w0006;	// 6
	word32 dw000C;	// C
	word32 dw0010;	// 10
	word16 w0014;	// 14
	word16 w0016;	// 16
	code * ptr0028;	// 28
	Eq_154 * ptr0034;	// 34
	Eq_514 t003C;	// 3C
	Eq_154 * ptr0050;	// 50
	word32 dw00A0;	// A0
	word32 dw00A4;	// A4
} Eq_1360;

