// subject.h
// Generated on TIMESTAMP by decompiling malware_via_email/malware_1263/ia32_pe/subject.exe
// using Decompiler version VERSION

/*
// Equivalence classes ////////////
Eq_1: (struct "Globals" (406830 word32 dw406830) (40744C (ptr Eq_135) ptr40744C) (407454 word32 dw407454) (407458 word32 dw407458) (40745C word32 dw40745C) (407460 word32 dw407460) (407464 word32 dw407464))
	globals_t (in globals : (ptr (struct "Globals")))
Eq_2: (fn void ())
	T_2 (in fn0040390E : ptr32)
	T_3 (in signature of fn0040390E : void)
Eq_5: (fn word32 (Eq_7, Eq_8, Eq_9, Eq_10))
	T_5 (in MessageBoxW : ptr32)
	T_6 (in signature of MessageBoxW : void)
	T_16 (in MessageBoxW : ptr32)
	T_28 (in MessageBoxW : ptr32)
	T_34 (in MessageBoxW : ptr32)
	T_40 (in MessageBoxW : ptr32)
Eq_7: (union "Eq_7" (word32 u0) (HWND u1))
	T_7 (in hWnd : HWND)
	T_11 (in 0xFFFFFFFF : word32)
	T_17 (in 0xFFFFFFFF : word32)
	T_29 (in 0xFFFFFFFF : word32)
	T_35 (in 0xFFFFFFFF : word32)
	T_41 (in 0xFFFFFFFF : word32)
Eq_8: (union "Eq_8" (word32 u0) (LPCWSTR u1))
	T_8 (in lpText : LPCWSTR)
	T_12 (in 0x00000000 : word32)
	T_18 (in 0x00000000 : word32)
	T_30 (in 0x00000000 : word32)
	T_36 (in 0x00000000 : word32)
	T_42 (in 0x00000000 : word32)
Eq_9: (union "Eq_9" (word32 u0) (LPCWSTR u1))
	T_9 (in lpCaption : LPCWSTR)
	T_13 (in 0x00000000 : word32)
	T_19 (in 0x00000000 : word32)
	T_31 (in 0x00000000 : word32)
	T_37 (in 0x00000000 : word32)
	T_43 (in 0x00000000 : word32)
Eq_10: (union "Eq_10" (word32 u0) (UINT u1))

  OrigDataType: word32
T_228: (in 0xFFFFFFF4 : word32)
  Class: Eq_228
  DataType: word32
  OrigDataType: word32
T_229: (in esp_61 + 0xFFFFFFF4 : word32)
  Class: Eq_229
  DataType: word32
  OrigDataType: word32
T_230: (in Mem118[esp_61 + 0xFFFFFFF4:word32] : word32)
  Class: Eq_130
  DataType: Eq_130
  OrigDataType: word32
T_231: (in 0xFFFFFFF0 : word32)
  Class: Eq_231
  DataType: word32
  OrigDataType: word32
T_232: (in esp_61 + 0xFFFFFFF0 : word32)
  Class: Eq_232
  DataType: word32
  OrigDataType: word32
T_233: (in Mem120[esp_61 + 0xFFFFFFF0:word32] : word32)
  Class: Eq_135
  DataType: (ptr Eq_135)
  OrigDataType: word32
T_234: (in 0x00000000 : word32)
  Class: Eq_140
  DataType: word32
  OrigDataType: word32
T_235: (in 0xFFFFFFEC : word32)
  Class: Eq_235
  DataType: word32
  OrigDataType: word32
T_236: (in esp_61 + 0xFFFFFFEC : word32)
  Class: Eq_236
  DataType: word32
  OrigDataType: word32
T_237: (in Mem122[esp_61 + 0xFFFFFFEC:word32] : word32)
  Class: Eq_140
  DataType: word32
  OrigDataType: word32
T_238: (in 0x00000000 : word32)
  Class: Eq_145
  DataType: word32
  OrigDataType: word32
T_239: (in 0xFFFFFFE8 : word32)
  Class: Eq_239
  DataType: word32
  OrigDataType: word32
T_240: (in esp_61 + 0xFFFFFFE8 : word32)
  Class: Eq_240
  DataType: word32
  OrigDataType: word32
T_241: (in Mem124[esp_61 + 0xFFFFFFE8:word32] : word32)
  Class: Eq_145
  DataType: Eq_145
  OrigDataType: word32
T_242: (in GetModuleHandleA : ptr32)
  Class: Eq_242
  DataType: (ptr Eq_242)
  OrigDataType: (ptr (fn T_247 (T_246)))
T_243: (in signature of GetModuleHandleA : void)
  Class: Eq_242
  DataType: (ptr Eq_242)
  OrigDataType: 
T_244: (in lpModuleName : LPCSTR)
  Class: Eq_145
  DataType: Eq_145
  OrigDataType: LPCSTR
T_245: (in esp_61 + 0xFFFFFFE8 : word32)
  Class: Eq_245
  DataType: word32
  OrigDataType: word32
T_246: (in Mem124[esp_61 + 0xFFFFFFE8:LPCSTR] : LPCSTR)
  Class: Eq_145
  DataType: Eq_145
  OrigDataType: LPCSTR
T_247: (in GetModuleHandleA(esp_61->tFFFFFFE8) : word32)
  Class: Eq_145
  DataType: Eq_145
  OrigDataType: word32
T_248: (in 0xFFFFFFE8 : word32)
  Class: Eq_248
  DataType: word32
  OrigDataType: word32
T_249: (in esp_61 + 0xFFFFFFE8 : word32)
  Class: Eq_249
  DataType: word32
  OrigDataType: word32
T_250: (in Mem128[esp_61 + 0xFFFFFFE8:word32] : word32)
  Class: Eq_145
  DataType: Eq_145
  OrigDataType: word32
T_251: (in _controlfp : ptr32)
  Class: Eq_251
  DataType: (ptr code)
  OrigDataType: (ptr code)
T_252: (in signature of _controlfp : void)
  Class: Eq_251
  DataType: (ptr code)
  OrigDataType: 
T_253:
  Class: Eq_253
  DataType: int32
  OrigDataType: 
T_254:
  Class: Eq_254
  DataType: Eq_254
  OrigDataType: 
*/
typedef Eq_135 Eq_1struct Globals {
	word32 dw406830;	// 406830
	Eq_135 * ptr40744C;	// 40744C
	word32 dw407454;	// 407454
	word32 dw407458;	// 407458
	word32 dw40745C;	// 40745C
	word32 dw407460;	// 407460
	word32 dw407464;	// 407464
} Eq_1;

typedef void (Eq_2)();

typedef word32 (Eq_5)(Eq_7, Eq_8, Eq_9, Eq_10);

typedef union Eq_7 {
	word32 u0;
	 HWND u1;
} Eq_7;

typedef union Eq_8 {
	word32 u0;
	 LPCWSTR u1;
} Eq_8;

typedef union Eq_9 {
	word32 u0;
	 LPCWSTR u1;
} Eq_9;

typedef union Eq_10 {
	word32 u0;
	 UINT u1;
} Eq_10;

typedef struct Eq_24 {
	word32 dwFFFFFEEC;	// FFFFFEEC
} Eq_24;

typedef struct Eq_51 {
	word32 dwFFFFFFE8;	// FFFFFFE8
} Eq_51;

typedef void (Eq_55)(void);

typedef struct Eq_64 {
	word32 * ptr0000;	// 0
} Eq_64;

typedef union Eq_70 {
	ptr32 u0;
	word32* Eq_64::* u1;
} Eq_70;

typedef void (Eq_103)();

typedef void (Eq_113)();

typedef Eq_145 Eq_116Eq_135 Eq_116Eq_130 Eq_116struct Eq_116 {
	word32 dwFFFFFFD8;	// FFFFFFD8
	word32 dwFFFFFFDC;	// FFFFFFDC
	word32 dwFFFFFFE4;	// FFFFFFE4
	Eq_145 tFFFFFFE8;	// FFFFFFE8
	word32 dwFFFFFFEC;	// FFFFFFEC
	Eq_135 * ptrFFFFFFF0;	// FFFFFFF0
	Eq_130 tFFFFFFF4;	// FFFFFFF4
	word32 dwFFFFFFFC;	// FFFFFFFC
	word32 dw0000;	// 0
} Eq_116;

typedef union Eq_130 {
	word32 u0;
	 LPSTARTUPINFOA u1;
} Eq_130;

typedef Eq_135 Eq_135struct Eq_135 {	// size: 1 1
	bcu8 b0000;	// 0
	Eq_135 t0001;	// 1
} Eq_135;

typedef union Eq_145 {
	word32 u0;
	 LPCSTR u1;
} Eq_145;

typedef void (Eq_214)(Eq_130);

typedef Eq_145 (Eq_242)(Eq_145);

typedef DWORDLPSTRLPSTRLPSTRDWORDDWORDDWORDDWORDDWORDDWORDDWORDDWORDWORDWORDLPBYTEHANDLEHANDLEHANDLEstruct _STARTUPINFOA {
	DWORD;	// 0
	LPSTR;	// 4
	LPSTR;	// 8
	LPSTR;	// C
	DWORD;	// 10
	DWORD;	// 14
	DWORD;	// 18
	DWORD;	// 1C
	DWORD;	// 20
	DWORD;	// 24
	DWORD;	// 28
	DWORD;	// 2C
	WORD;	// 30
	WORD;	// 32
	LPBYTE;	// 34
	HANDLE;	// 38
	HANDLE;	// 3C
	HANDLE;	// 40
} Eq_254;

