// subject.h
// Generated on TIMESTAMP by decompiling malware_via_email/malware_1374/ia32_pe/subject.exe
// using Decompiler version VERSION

/*
// Equivalence classes ////////////
Eq_1: (struct "Globals" (408000 up32 dw408000) (408004 word32 dw408004) (40C01C Eq_18 t40C01C) (40C020 word32 dw40C020) (40C024 word32 dw40C024) (40C028 Eq_18 t40C028) (40C02C word32 dw40C02C) (40C030 word32 dw40C030) (40C034 word32 dw40C034) (40C038 word32 dw40C038) (40C03C (ptr Eq_612) ptr40C03C) (40C040 (ptr code) ptr40C040))
	globals_t (in globals : (ptr (struct "Globals")))
Eq_14: (fn word32 ())
	T_14 (in GetCommandLineA : ptr32)
	T_15 (in signature of GetCommandLineA : void)
	T_72 (in GetCommandLineA : ptr32)
	T_74 (in GetCommandLineA : ptr32)
	T_76 (in GetCommandLineA : ptr32)
	T_78 (in GetCommandLineA : ptr32)
	T_80 (in GetCommandLineA : ptr32)
	T_82 (in GetCommandLineA : ptr32)
	T_84 (in GetCommandLineA : ptr32)
	T_86 (in GetCommandLineA : ptr32)
	T_88 (in GetCommandLineA : ptr32)
	T_90 (in GetCommandLineA : ptr32)
	T_92 (in GetCommandLineA : ptr32)
	T_94 (in GetCommandLineA : ptr32)
	T_96 (in GetCommandLineA : ptr32)
	T_98 (in GetCommandLineA : ptr32)
	T_100 (in GetCommandLineA : ptr32)
	T_102 (in GetCommandLineA : ptr32)
	T_104 (in GetCommandLineA : ptr32)
	T_106 (in GetCommandLineA : ptr32)
	T_108 (in GetCommandLineA : ptr32)
	T_110 (in GetCommandLineA : ptr32)
	T_112 (in GetCommandLineA : ptr32)
	T_114 (in GetCommandLineA : ptr32)
	T_116 (in GetCommandLineA : ptr32)

  OrigDataType: ui32
T_1665: (in 0x0000007F : word32)
  Class: Eq_1665
  DataType: word32
  OrigDataType: word32
T_1666: (in ecx_16 & 0x0000007F : word32)
  Class: Eq_1666
  DataType: word32
  OrigDataType: word32
T_1667: (in dwLoc08_12 << 0x00000007 | ecx_16 & 0x0000007F : word32)
  Class: Eq_1652
  DataType: word32
  OrigDataType: word32
T_1668: (in edx_28 : word32)
  Class: Eq_1654
  DataType: word32
  OrigDataType: word32
T_1669: (in 0x00000001 : word32)
  Class: Eq_1669
  DataType: word32
  OrigDataType: word32
T_1670: (in dwLoc10_13 + 0x00000001 : word32)
  Class: Eq_1654
  DataType: word32
  OrigDataType: word32
T_1671: (in 0x00000001 : word32)
  Class: Eq_1671
  DataType: word32
  OrigDataType: word32
T_1672: (in dwArg08 + 0x00000001 : word32)
  Class: Eq_1657
  DataType: (ptr Eq_1657)
  OrigDataType: word32
T_1673: (in 0x00000080 : word32)
  Class: Eq_1673
  DataType: word32
  OrigDataType: word32
T_1674: (in ecx_16 & 0x00000080 : word32)
  Class: Eq_1674
  DataType: word32
  OrigDataType: word32
T_1675: (in 0x00000000 : word32)
  Class: Eq_1674
  DataType: word32
  OrigDataType: word32
T_1676: (in (ecx_16 & 0x00000080) != 0x00000000 : bool)
  Class: Eq_1676
  DataType: bool
  OrigDataType: bool
T_1677: (in dwArg04 : word32)
  Class: Eq_1677
  DataType: (ptr word32)
  OrigDataType: (ptr (struct (0 T_1680 t0000)))
T_1678: (in 0x00000000 : word32)
  Class: Eq_1678
  DataType: word32
  OrigDataType: word32
T_1679: (in dwArg04 + 0x00000000 : word32)
  Class: Eq_1679
  DataType: word32
  OrigDataType: word32
T_1680: (in Mem38[dwArg04 + 0x00000000:word32] : word32)
  Class: Eq_1652
  DataType: word32
  OrigDataType: word32
T_1681:
  Class: Eq_1681
  DataType: word16
  OrigDataType: (struct 0002 (0 T_921 t0000))
T_1682:
  Class: Eq_1681
  DataType: word16
  OrigDataType: (struct 0002 (0 T_933 t0000))
T_1683:
  Class: Eq_1681
  DataType: word16
  OrigDataType: (struct 0002 (0 T_946 t0000))
T_1684:
  Class: Eq_1684
  DataType: word16
  OrigDataType: (struct 0002 (0 T_1532 t0000))
T_1685:
  Class: Eq_1684
  DataType: word16
  OrigDataType: (struct 0002 (0 T_1546 t0000))
T_1686:
  Class: Eq_1684
  DataType: word16
  OrigDataType: (struct 0002 (0 T_1561 t0000))
T_1687:
  Class: Eq_1687
  DataType: Eq_1687
  OrigDataType: 
T_1688:
  Class: Eq_1688
  DataType: int32
  OrigDataType: 
T_1689:
  Class: Eq_1689
  DataType: int32
  OrigDataType: 
T_1690:
  Class: Eq_1690
  DataType: int32
  OrigDataType: 
T_1691:
  Class: Eq_1691
  DataType: int32
  OrigDataType: 
T_1692:
  Class: Eq_1692
  DataType: Eq_1692
  OrigDataType: 
*/
typedef Eq_18 Eq_1Eq_18 Eq_1Eq_612 Eq_1code Eq_1struct Globals {
	up32 dw408000;	// 408000
	word32 dw408004;	// 408004
	Eq_18 t40C01C;	// 40C01C
	word32 dw40C020;	// 40C020
	word32 dw40C024;	// 40C024
	Eq_18 t40C028;	// 40C028
	word32 dw40C02C;	// 40C02C
	word32 dw40C030;	// 40C030
	word32 dw40C034;	// 40C034
	word32 dw40C038;	// 40C038
	Eq_612 * ptr40C03C;	// 40C03C
	code * ptr40C040;	// 40C040
} Eq_1;

typedef word32 (Eq_14)();

typedef union Eq_18 {
	Eq_1687* u0;
	 DWORD u1;
	 HINSTANCE u2;
	 LPVOID u3;
	 SIZE_T u4;
} Eq_18;

typedef Eq_18 (Eq_19)(Eq_21);

typedef union Eq_21 {
	word32 u0;
	 HMODULE u1;
	 LPCSTR u2;
} Eq_21;

typedef word32 (Eq_24)(Eq_26, Eq_27, Eq_28);

typedef union Eq_26 {
	word32 u0;
	 HKEY u1;
} Eq_26;

typedef union Eq_27 {
	word32 u0;
	 LPCSTR u1;
} Eq_27;

typedef union Eq_28 {
	word32 u0;
	 PHKEY u1;
} Eq_28;

typedef struct Eq_31 {
	ptr32 ptrFFFFFFC8;	// FFFFFFC8
	word32 dwFFFFFFCC;	// FFFFFFCC
} Eq_31;

typedef word32 (Eq_50)(Eq_18, Eq_53, Eq_54, Eq_55, Eq_56);

typedef union Eq_53 {
	word32 u0;
	 LPCSTR u1;
} Eq_53;

typedef union Eq_54 {
	word32 u0;
	 HWND u1;
} Eq_54;

typedef union Eq_55 {
	word32 u0;
	 DLGPROC u1;
} Eq_55;

typedef union Eq_56 {
	word32 u0;
	 LPARAM u1;
} Eq_56;

typedef word32 (Eq_587)(word32);

typedef void (Eq_602)(word32, word32, up32);

typedef Eq_612 Eq_610struct Eq_610 {
	Eq_612 * ptr0018;	// 18
} Eq_610;

typedef Eq_1421 Eq_612struct Eq_612 {
	Eq_1421 * ptr0030;	// 30
} Eq_612;

typedef struct Eq_633 {
	word32 dw0008;	// 8
} Eq_633;

typedef struct Eq_640 {
	word32 dw0008;	// 8
} Eq_640;

typedef void (Eq_646)(word32, Eq_18);

typedef void (Eq_660)(word32, word32);

typedef code * (Eq_669)(Eq_21, Eq_672);

typedef union Eq_672 {
	word32 u0;
	 LPCSTR u1;
} Eq_672;

typedef Eq_790 Eq_676Eq_18 Eq_676struct Eq_676 {
	word16 w0006;	// 6
	word16 w0014;	// 14
	Eq_790 t003C;	// 3C
	Eq_18 t0050;	// 50
} Eq_676;

typedef Eq_682 Eq_682struct Eq_682 {	// size: 40 28
	word32 dw000C;	// C
	word32 dw0010;	// 10
	word32 dw0014;	// 14
	Eq_682 t0028;	// 28
} Eq_682;

typedef Eq_18 (Eq_691)(Eq_18, Eq_18, Eq_695, Eq_696);

typedef union Eq_695 {
	word32 u0;
	 DWORD u1;
} Eq_695;

typedef union Eq_696 {
	word32 u0;
	 DWORD u1;
} Eq_696;

typedef Eq_753 Eq_718Eq_18 Eq_718Eq_18 Eq_718Eq_18 Eq_718struct Eq_718 {
	Eq_753 tFFFFFF9C;	// FFFFFF9C
	word32 dwFFFFFFA0;	// FFFFFFA0
	Eq_18 tFFFFFFA4;	// FFFFFFA4
	word32 dwFFFFFFA8;	// FFFFFFA8
	Eq_18 tFFFFFFAC;	// FFFFFFAC
	Eq_18 tFFFFFFB0;	// FFFFFFB0
	word32 dwFFFFFFF0;	// FFFFFFF0
} Eq_718;

typedef void (Eq_725)(Eq_18, Eq_18, int32);

typedef code Eq_740Eq_18 Eq_740Eq_18 Eq_740struct Eq_740 {
	code * ptr0028;	// 28
	Eq_18 t0034;	// 34
	Eq_18 t0050;	// 50
	word32 dw0080;	// 80
	word32 dw00A0;	// A0
	word32 dw00A4;	// A4
} Eq_740;

typedef union Eq_753 {
	word32 u0;
	 HANDLE u1;
} Eq_753;

typedef Eq_753 (Eq_754)(Eq_756, Eq_757, Eq_758, Eq_759, Eq_18, Eq_761);

typedef union Eq_756 {
	word32 u0;
	 HANDLE u1;
} Eq_756;

typedef union Eq_757 {
	word32 u0;
	 LPSECURITY_ATTRIBUTES u1;
} Eq_757;

typedef union Eq_758 {
	word32 u0;
	 DWORD u1;
} Eq_758;

typedef union Eq_759 {
	word32 u0;
	 DWORD u1;
} Eq_759;

typedef union Eq_761 {
	word32 u0;
	 LPCSTR u1;
} Eq_761;

typedef union Eq_790 {
	int32 u0;
	uint32 u1;
} Eq_790;

typedef union Eq_811 {
	int32 u0;
	uint32 u1;
} Eq_811;

typedef Eq_817 Eq_817struct Eq_817 {	// size: 20 14
	word32 dw0000;	// 0
	word32 dw000C;	// C
	word32 dw0010;	// 10
	Eq_817 t0014;	// 14
} Eq_817;

typedef Eq_826 Eq_826struct Eq_826 {	// size: 4 4
	word32 dw0000;	// 0
	Eq_826 t0004;	// 4
} Eq_826;

typedef Eq_827 Eq_827struct Eq_827 {	// size: 4 4
	word32 dw0000;	// 0
	Eq_827 t0004;	// 4
} Eq_827;

typedef word32 (Eq_829)(Eq_831);

typedef union Eq_831 {
	word32 u0;
	 LPCSTR u1;
} Eq_831;

typedef  Eq_882[]struct Eq_882 {
	word32 dw0000;	// 0
	word32 dw0004;	// 4
	word16 a0008[];	// 8
} Eq_882;

typedef word32 (Eq_961)(word32, word32);

typedef Eq_18 (Eq_1034)(Eq_753, Eq_1037, Eq_18, Eq_1039, Eq_1040, Eq_18);

typedef union Eq_1037 {
	word32 u0;
	 DWORD u1;
} Eq_1037;

typedef union Eq_1039 {
	word32 u0;
	 DWORD u1;
} Eq_1039;

typedef union Eq_1040 {
	word32 u0;
	 SIZE_T u1;
} Eq_1040;

typedef Eq_18 Eq_1080Eq_18 Eq_1080Eq_18 Eq_1080struct Eq_1080 {
	Eq_18 tFFFFFFF8;	// FFFFFFF8
	Eq_18 tFFFFFFFC;	// FFFFFFFC
	Eq_18 t0000;	// 0
} Eq_1080;

typedef void (Eq_1174)(Eq_18);

typedef void (Eq_1192)(Eq_18, Eq_18);

typedef Eq_753 Eq_1228Eq_1037 Eq_1228Eq_18 Eq_1228Eq_1039 Eq_1228Eq_1040 Eq_1228Eq_18 Eq_1228struct Eq_1228 {
	Eq_753 tFFFFFFEC;	// FFFFFFEC
	Eq_1037 tFFFFFFF0;	// FFFFFFF0
	Eq_18 tFFFFFFF4;	// FFFFFFF4
	Eq_1039 tFFFFFFF8;	// FFFFFFF8
	Eq_1040 tFFFFFFFC;	// FFFFFFFC
	Eq_18 t0000;	// 0
} Eq_1228;

typedef Eq_753 Eq_1279Eq_1037 Eq_1279Eq_18 Eq_1279Eq_1039 Eq_1279Eq_1040 Eq_1279Eq_18 Eq_1279struct Eq_1279 {
	Eq_753 tFFFFFFEC;	// FFFFFFEC
	Eq_1037 tFFFFFFF0;	// FFFFFFF0
	Eq_18 tFFFFFFF4;	// FFFFFFF4
	Eq_1039 tFFFFFFF8;	// FFFFFFF8
	Eq_1040 tFFFFFFFC;	// FFFFFFFC
	Eq_18 t0000;	// 0
} Eq_1279;

typedef Eq_18 Eq_1337Eq_18 Eq_1337Eq_695 Eq_1337Eq_696 Eq_1337struct Eq_1337 {
	Eq_18 tFFFFFFF4;	// FFFFFFF4
	Eq_18 tFFFFFFF8;	// FFFFFFF8
	Eq_695 tFFFFFFFC;	// FFFFFFFC
	Eq_696 t0000;	// 0
} Eq_1337;

typedef Eq_18 Eq_1376Eq_18 Eq_1376Eq_695 Eq_1376Eq_696 Eq_1376struct Eq_1376 {
	Eq_18 tFFFFFFF4;	// FFFFFFF4
	Eq_18 tFFFFFFF8;	// FFFFFFF8
	Eq_695 tFFFFFFFC;	// FFFFFFFC
	Eq_696 t0000;	// 0
} Eq_1376;

typedef Eq_1416 Eq_1416struct Eq_1416 {
	Eq_1416 * ptr0000;	// 0
	word32 dw0018;	// 18
	word32 dw001C;	// 1C
} Eq_1416;

typedef Eq_1424 Eq_1421struct Eq_1421 {
	word32 dw0008;	// 8
	Eq_1424 * ptr000C;	// C
} Eq_1421;

typedef Eq_1416 Eq_1424struct Eq_1424 {
	Eq_1416 * ptr000C;	// C
} Eq_1424;

typedef Eq_18 Eq_1463struct Eq_1463 {
	Eq_18 t0050;	// 50
	word32 dw00A0;	// A0
	word32 dw00A4;	// A4
} Eq_1463;

typedef Eq_18 Eq_1485Eq_18 Eq_1485struct Eq_1485 {
	Eq_18 tFFFFFFD4;	// FFFFFFD4
	Eq_18 tFFFFFFD8;	// FFFFFFD8
} Eq_1485;

typedef  Eq_1507[]struct Eq_1507 {
	word32 dw0000;	// 0
	word32 dw0004;	// 4
	word16 a0008[];	// 8
} Eq_1507;

typedef word32 (Eq_1606)(word32, word32);

typedef Eq_1657 Eq_1657struct Eq_1657 {	// size: 1 1
	byte b0000;	// 0
	Eq_1657 t0001;	// 1
} Eq_1657;

typedef struct Eq_1687 {
	word32 dw003C;	// 3C
} Eq_1687;

typedef DWORDLPVOIDBOOLstruct _SECURITY_ATTRIBUTES {
	DWORD;	// 0
	LPVOID;	// 4
	BOOL;	// 8
} Eq_1692;

