// subject.h
// Generated on TIMESTAMP by decompiling malware_via_email/malware_0510/ia32_pe/subject.exe
// using Decompiler version VERSION

/*
// Equivalence classes ////////////
Eq_1: (struct "Globals" (403048 word32 dw403048) (40304C word32 dw40304C) (403050 int32 dw403050) (403054 word32 dw403054) (403058 Eq_144 t403058) (40305C (ptr Eq_521) ptr40305C) (403060 word32 dw403060) (403064 Eq_142 t403064) (403068 word32 dw403068) (40306C int32 dw40306C) (403070 ui32 dw403070) (403074 Eq_142 t403074) (403078 (ptr Eq_556) ptr403078) (40307C (ptr code) ptr40307C) (403080 word32 dw403080))
	globals_t (in globals : (ptr (struct "Globals")))
Eq_43: (fn word32 (word32, word32))
	T_43 (in fn00401150 : ptr32)
	T_44 (in signature of fn00401150 : void)
	T_53 (in fn00401150 : ptr32)
Eq_93: (struct "Eq_93" 0001 (0 byte b0000) (1 Eq_93 t0001))
	T_93 (in dwArg08 : word32)
	T_108 (in dwArg08 + 0x00000001 : word32)
Eq_120: (fn word32 (Eq_122, Eq_123, Eq_124, Eq_125, Eq_126, Eq_127, Eq_128))
	T_120 (in CreateFileA : ptr32)
	T_121 (in signature of CreateFileA : void)
Eq_122: (union "Eq_122" (word32 u0) (LPCSTR u1))
	T_122 (in lpFileName : LPCSTR)
	T_129 (in dwArg04 : word32)
Eq_123: (union "Eq_123" (word32 u0) (DWORD u1))
	T_123 (in dwDesiredAccess : DWORD)
	T_130 (in 0x80000000 : word32)
Eq_124: (union "Eq_124" (word32 u0) (DWORD u1))
	T_124 (in dwShareMode : DWORD)
	T_131 (in 0x00000001 : word32)
Eq_125: (union "Eq_125" (word32 u0) (LPSECURITY_ATTRIBUTES u1))

  DataType: Eq_1443
  OrigDataType: SIZE_T
T_1444: (in GetProcessHeap : ptr32)
  Class: Eq_1432
  DataType: (ptr Eq_1432)
  OrigDataType: (ptr (fn T_1445 ()))
T_1445: (in GetProcessHeap() : word32)
  Class: Eq_1429
  DataType: Eq_1429
  OrigDataType: word32
T_1446: (in 0x00000000 : word32)
  Class: Eq_1442
  DataType: word32
  OrigDataType: word32
T_1447: (in dwArg04 : word32)
  Class: Eq_1443
  DataType: Eq_1443
  OrigDataType: word32
T_1448: (in HeapAlloc(GetProcessHeap(), 0x00000000, dwArg04) : word32)
  Class: Eq_1448
  DataType: word32
  OrigDataType: word32
T_1449:
  Class: Eq_1449
  DataType: word16
  OrigDataType: (struct 0002 (0 T_726 t0000))
T_1450:
  Class: Eq_1449
  DataType: word16
  OrigDataType: (struct 0002 (0 T_740 t0000))
T_1451:
  Class: Eq_1449
  DataType: word16
  OrigDataType: (struct 0002 (0 T_755 t0000))
T_1452:
  Class: Eq_1452
  DataType: word16
  OrigDataType: (struct 0002 (0 T_1018 t0000))
T_1453:
  Class: Eq_1452
  DataType: word16
  OrigDataType: (struct 0002 (0 T_1030 t0000))
T_1454:
  Class: Eq_1452
  DataType: word16
  OrigDataType: (struct 0002 (0 T_1043 t0000))
T_1455:
  Class: Eq_1455
  DataType: Eq_1455
  OrigDataType: 
T_1456:
  Class: Eq_1456
  DataType: Eq_1456
  OrigDataType: 
T_1457:
  Class: Eq_1457
  DataType: int32
  OrigDataType: 
T_1458:
  Class: Eq_1458
  DataType: Eq_1458
  OrigDataType: 
T_1459:
  Class: Eq_1459
  DataType: int32
  OrigDataType: 
T_1460:
  Class: Eq_1460
  DataType: int32
  OrigDataType: 
T_1461:
  Class: Eq_1461
  DataType: int32
  OrigDataType: 
T_1462:
  Class: Eq_1462
  DataType: int32
  OrigDataType: 
T_1463:
  Class: Eq_1463
  DataType: int32
  OrigDataType: 
T_1464:
  Class: Eq_1464
  DataType: int32
  OrigDataType: 
T_1465:
  Class: Eq_1465
  DataType: int32
  OrigDataType: 
T_1466:
  Class: Eq_1466
  DataType: int32
  OrigDataType: 
T_1467:
  Class: Eq_1467
  DataType: int32
  OrigDataType: 
T_1468:
  Class: Eq_1468
  DataType: Eq_1468
  OrigDataType: 
T_1469:
  Class: Eq_1469
  DataType: Eq_1469
  OrigDataType: 
T_1470:
  Class: Eq_1470
  DataType: Eq_1470
  OrigDataType: 
T_1471:
  Class: Eq_1471
  DataType: int32
  OrigDataType: 
T_1472:
  Class: Eq_1472
  DataType: Eq_1472
  OrigDataType: 
T_1473:
  Class: Eq_1473
  DataType: Eq_1473
  OrigDataType: 
*/
typedef Eq_144 Eq_1Eq_521 Eq_1Eq_142 Eq_1Eq_142 Eq_1Eq_556 Eq_1code Eq_1struct Globals {
	word32 dw403048;	// 403048
	word32 dw40304C;	// 40304C
	int32 dw403050;	// 403050
	word32 dw403054;	// 403054
	Eq_144 t403058;	// 403058
	Eq_521 * ptr40305C;	// 40305C
	word32 dw403060;	// 403060
	Eq_142 t403064;	// 403064
	word32 dw403068;	// 403068
	int32 dw40306C;	// 40306C
	ui32 dw403070;	// 403070
	Eq_142 t403074;	// 403074
	Eq_556 * ptr403078;	// 403078
	code * ptr40307C;	// 40307C
	word32 dw403080;	// 403080
} Eq_1;

typedef word32 (Eq_43)(word32, word32);

typedef Eq_93 Eq_93struct Eq_93 {	// size: 1 1
	byte b0000;	// 0
	Eq_93 t0001;	// 1
} Eq_93;

typedef word32 (Eq_120)(Eq_122, Eq_123, Eq_124, Eq_125, Eq_126, Eq_127, Eq_128);

typedef union Eq_122 {
	word32 u0;
	 LPCSTR u1;
} Eq_122;

typedef union Eq_123 {
	word32 u0;
	 DWORD u1;
} Eq_123;

typedef union Eq_124 {
	word32 u0;
	 DWORD u1;
} Eq_124;

typedef union Eq_125 {
	word32 u0;
	 LPSECURITY_ATTRIBUTES u1;
} Eq_125;

typedef union Eq_126 {
	word32 u0;
	 DWORD u1;
} Eq_126;

typedef union Eq_127 {
	word32 u0;
	 DWORD u1;
} Eq_127;

typedef union Eq_128 {
	word32 u0;
	 HANDLE u1;
} Eq_128;

typedef Eq_144 (Eq_140)(Eq_142);

typedef union Eq_142 {
	Eq_1456* u0;
	 DWORD u1;
	 HANDLE u2;
	 HINSTANCE u3;
	 LPCSTR u4;
	 LPSTR u5;
	 UINT u6;
} Eq_142;

typedef union Eq_144 {
	Eq_1458* u0;
	 DWORD u1;
	 HINSTANCE u2;
	 HMODULE u3;
	 LPCVOID u4;
	 LPVOID u5;
} Eq_144;

typedef word32 (Eq_145)(Eq_144, Eq_148);

typedef union Eq_148 {
	word32 u0;
	 LPCSTR u1;
} Eq_148;

typedef word32 (Eq_154)(Eq_156, Eq_157);

typedef union Eq_156 {
	word32 u0;
	 HINSTANCE u1;
} Eq_156;

typedef union Eq_157 {
	word32 u0;
	 LPCSTR u1;
} Eq_157;

typedef word32 (Eq_162)(WNDCLASSA *);

typedef WNDCLASSA;

typedef Eq_142 Eq_165Eq_142 Eq_165Eq_144 Eq_165Eq_144 Eq_165Eq_142 Eq_165struct Eq_165 {
	Eq_142 tFFFFFF70;	// FFFFFF70
	Eq_142 tFFFFFF74;	// FFFFFF74
	Eq_144 tFFFFFF78;	// FFFFFF78
	Eq_144 tFFFFFF7C;	// FFFFFF7C
	Eq_142 tFFFFFF80;	// FFFFFF80
} Eq_165;

typedef word32 (Eq_196)(Eq_198, Eq_199, Eq_200, Eq_201, int32, int32, int32, int32, Eq_206, Eq_207, Eq_142, Eq_209);

typedef union Eq_198 {
	word32 u0;
	 DWORD u1;
} Eq_198;

typedef union Eq_199 {
	word32 u0;
	 LPCSTR u1;
} Eq_199;

typedef union Eq_200 {
	word32 u0;
	 LPCSTR u1;
} Eq_200;

typedef union Eq_201 {
	word32 u0;
	 DWORD u1;
} Eq_201;

typedef union Eq_206 {
	word32 u0;
	 HWND u1;
} Eq_206;

typedef union Eq_207 {
	word32 u0;
	 HMENU u1;
} Eq_207;

typedef union Eq_209 {
	word32 u0;
	 LPVOID u1;
} Eq_209;

typedef Eq_276 Eq_246struct Eq_246 {
	word16 w0006;	// 6
	word16 w0014;	// 14
	Eq_276 t003C;	// 3C
} Eq_246;

typedef struct Eq_251 {
	word32 dw0010;	// 10
	word32 dw0014;	// 14
} Eq_251;

typedef union Eq_276 {
	int32 u0;
	uint32 u1;
} Eq_276;

typedef union Eq_278 {
	word32 u0;
	 LONG u1;
} Eq_278;

typedef union Eq_289 {
	int32 u0;
	uint32 u1;
} Eq_289;

typedef Eq_142 (Eq_303)(word32);

typedef word32 (Eq_317)(Eq_319, Eq_142, Eq_142);

typedef union Eq_319 {
	word32 u0;
	 HMODULE u1;
} Eq_319;

typedef Eq_142 (Eq_328)(word32);

typedef union Eq_335 {
	word32 u0;
	 DWORD u1;
} Eq_335;

typedef word32 (Eq_336)(Eq_142, Eq_339);

typedef union Eq_339 {
	word32 u0;
	 LPDWORD u1;
} Eq_339;

typedef word32 (Eq_359)(Eq_361, Eq_278, Eq_363, Eq_364);

typedef union Eq_361 {
	word32 u0;
	 HANDLE u1;
	 LPVOID u2;
} Eq_361;

typedef union Eq_363 {
	word32 u0;
	 PLONG u1;
} Eq_363;

typedef union Eq_364 {
	word32 u0;
	 DWORD u1;
} Eq_364;

typedef word32 (Eq_375)(Eq_377, Eq_361, Eq_335, Eq_380, Eq_381);

typedef union Eq_377 {
	word32 u0;
	 HANDLE u1;
} Eq_377;

typedef union Eq_380 {
	word32 u0;
	 LPDWORD u1;
} Eq_380;

typedef union Eq_381 {
	word32 u0;
	 LPOVERLAPPED u1;
} Eq_381;

typedef word32 (Eq_392)(Eq_394);

typedef union Eq_394 {
	word32 u0;
	 HANDLE u1;
} Eq_394;

typedef union Eq_399 {
	word32 u0;
	 HWND u1;
} Eq_399;

typedef Eq_399 (Eq_400)();

typedef union Eq_407 {
	byte u0;
	up32 u1;
} Eq_407;

typedef word32 (Eq_411)(Eq_399, Eq_142, int32);

typedef void (Eq_427)(word32);

typedef void (Eq_438)(Eq_142, Eq_142, Eq_144);

typedef struct Eq_487 {
	word32 dw0008;	// 8
} Eq_487;

typedef struct Eq_493 {
	word32 dw0008;	// 8
} Eq_493;

typedef Eq_142 Eq_521struct Eq_521 {
	Eq_142 tFFFFFFF8;	// FFFFFFF8
} Eq_521;

typedef Eq_521 * (Eq_522)(word32 *, word32, Eq_142, Eq_407);

typedef Eq_556 Eq_554struct Eq_554 {
	Eq_556 * ptr0018;	// 18
} Eq_554;

typedef Eq_1390 Eq_556struct Eq_556 {
	Eq_1390 * ptr0030;	// 30
} Eq_556;

typedef void (Eq_563)(Eq_142);

typedef void (Eq_583)(word32);

typedef word32 (Eq_612)(word32);

typedef Eq_655 Eq_650struct Eq_650 {
	Eq_655 t0050;	// 50
	word32 dw00A0;	// A0
	word32 dw00A4;	// A4
} Eq_650;

typedef union Eq_655 {
	word32 u0;
	 SIZE_T u1;
} Eq_655;

typedef Eq_144 Eq_656Eq_655 Eq_656struct Eq_656 {
	Eq_144 tFFFFFFD0;	// FFFFFFD0
	Eq_655 tFFFFFFD4;	// FFFFFFD4
} Eq_656;

typedef Eq_142 (Eq_660)(Eq_144, Eq_655, Eq_664, Eq_144);

typedef union Eq_664 {
	Eq_1472* u0;
	 DWORD u1;
} Eq_664;

typedef  Eq_701[]struct Eq_701 {
	word32 dw0000;	// 0
	word32 dw0004;	// 4
	word16 a0008[];	// 8
} Eq_701;

typedef Eq_856 Eq_770Eq_655 Eq_770struct Eq_770 {
	word16 w0006;	// 6
	word16 w0014;	// 14
	Eq_856 t003C;	// 3C
	Eq_655 t0050;	// 50
} Eq_770;

typedef Eq_776 Eq_776struct Eq_776 {	// size: 40 28
	word32 dw000C;	// C
	word32 dw0010;	// 10
	word32 dw0014;	// 14
	Eq_776 t0028;	// 28
} Eq_776;

typedef Eq_950 Eq_807Eq_1134 Eq_807Eq_144 Eq_807Eq_144 Eq_807Eq_664 Eq_807Eq_144 Eq_807struct Eq_807 {
	Eq_950 tFFFFFFA0;	// FFFFFFA0
	Eq_1134 tFFFFFFA4;	// FFFFFFA4
	Eq_144 tFFFFFFA8;	// FFFFFFA8
	Eq_144 tFFFFFFAC;	// FFFFFFAC
	Eq_664 tFFFFFFB0;	// FFFFFFB0
	Eq_144 tFFFFFFB4;	// FFFFFFB4
	word32 dwFFFFFFF0;	// FFFFFFF0
} Eq_807;

typedef code Eq_826Eq_144 Eq_826Eq_144 Eq_826struct Eq_826 {
	code * ptr0028;	// 28
	Eq_144 t0034;	// 34
	Eq_144 t0050;	// 50
	word32 dw0080;	// 80
	word32 dw00A0;	// A0
	word32 dw00A4;	// A4
} Eq_826;

typedef Eq_831 Eq_831struct Eq_831 {	// size: 20 14
	word32 dw0000;	// 0
	word32 dw000C;	// C
	word32 dw0010;	// 10
	Eq_831 t0014;	// 14
} Eq_831;

typedef union Eq_856 {
	int32 u0;
	uint32 u1;
} Eq_856;

typedef union Eq_877 {
	int32 u0;
	uint32 u1;
} Eq_877;

typedef Eq_897 Eq_897struct Eq_897 {	// size: 4 4
	word32 dw0000;	// 0
	Eq_897 t0004;	// 4
} Eq_897;

typedef Eq_898 Eq_898struct Eq_898 {	// size: 4 4
	word32 dw0000;	// 0
	Eq_898 t0004;	// 4
} Eq_898;

typedef Eq_144 (Eq_910)(Eq_912);

typedef union Eq_912 {
	word32 u0;
	 LPCSTR u1;
} Eq_912;

typedef union Eq_950 {
	word32 u0;
	 HANDLE u1;
} Eq_950;

typedef Eq_950 (Eq_951)(Eq_953, Eq_954, Eq_955, Eq_956, Eq_144, Eq_958);

typedef union Eq_953 {
	word32 u0;
	 HANDLE u1;
} Eq_953;

typedef union Eq_954 {
	word32 u0;
	 LPSECURITY_ATTRIBUTES u1;
} Eq_954;

typedef union Eq_955 {
	word32 u0;
	 DWORD u1;
} Eq_955;

typedef union Eq_956 {
	word32 u0;
	 DWORD u1;
} Eq_956;

typedef union Eq_958 {
	word32 u0;
	 LPCSTR u1;
} Eq_958;

typedef  Eq_979[]struct Eq_979 {
	word32 dw0000;	// 0
	word32 dw0004;	// 4
	word16 a0008[];	// 8
} Eq_979;

typedef word32 (Eq_1058)(Eq_144, Eq_1061);

typedef union Eq_1061 {
	word32 u0;
	 LPCSTR u1;
} Eq_1061;

typedef union Eq_1134 {
	word32 u0;
	 DWORD u1;
} Eq_1134;

typedef Eq_142 (Eq_1141)(Eq_950, Eq_1134, Eq_144, Eq_1146, Eq_1147, Eq_144);

typedef union Eq_1146 {
	word32 u0;
	 DWORD u1;
} Eq_1146;

typedef union Eq_1147 {
	word32 u0;
	 SIZE_T u1;
} Eq_1147;

typedef word32 (Eq_1201)(Eq_144);

typedef word32 (Eq_1225)(Eq_144, Eq_1147, Eq_1229);

typedef union Eq_1229 {
	word32 u0;
	 DWORD u1;
} Eq_1229;

typedef void (Eq_1236)(Eq_142);

typedef void (Eq_1242)(Eq_144, word32);

typedef Eq_1385 Eq_1385struct Eq_1385 {
	Eq_1385 * ptr0000;	// 0
	word32 dw0018;	// 18
	word32 dw001C;	// 1C
} Eq_1385;

typedef Eq_1393 Eq_1390struct Eq_1390 {
	word32 dw0008;	// 8
	Eq_1393 * ptr000C;	// C
} Eq_1390;

typedef Eq_1385 Eq_1393struct Eq_1393 {
	Eq_1385 * ptr000C;	// C
} Eq_1393;

typedef word32 (Eq_1427)(Eq_1429, Eq_1430, Eq_1431);

typedef union Eq_1429 {
	word32 u0;
	 HANDLE u1;
} Eq_1429;

typedef union Eq_1430 {
	word32 u0;
	 DWORD u1;
} Eq_1430;

typedef union Eq_1431 {
	word32 u0;
	 LPVOID u1;
} Eq_1431;

typedef Eq_1429 (Eq_1432)();

typedef word32 (Eq_1439)(Eq_1429, Eq_1442, Eq_1443);

typedef union Eq_1442 {
	word32 u0;
	 DWORD u1;
} Eq_1442;

typedef union Eq_1443 {
	word32 u0;
	 SIZE_T u1;
} Eq_1443;

typedef DWORDLPVOIDBOOLstruct _SECURITY_ATTRIBUTES {
	DWORD;	// 0
	LPVOID;	// 4
	BOOL;	// 8
} Eq_1455;

typedef Eq_407 Eq_1456Eq_142 Eq_1456struct Eq_1456 {
	Eq_407 t0000;	// 0
	Eq_142 t0004;	// 4
	word32 dw003C;	// 3C
} Eq_1456;

typedef struct Eq_1458 {
	word32 dw003C;	// 3C
} Eq_1458;

typedef DWORDDWORDstruct struct_61 {
	DWORD;	// 0
	DWORD;	// 4
} Eq_1468;

typedef union Eq_1469 {
	 <anonymous> u0;
	 PVOID u1;
} Eq_1469;

typedef ULONG_PTRULONG_PTREq_1469 Eq_1470HANDLEstruct _OVERLAPPED {
	ULONG_PTR;	// 0
	ULONG_PTR;	// 4
	Eq_1469 t0008;	// 8
	HANDLE;	// 10
} Eq_1470;

typedef struct Eq_1472 {
	word32 dw003C;	// 3C
} Eq_1472;

typedef DWORDLPVOIDBOOLstruct _SECURITY_ATTRIBUTES {
	DWORD;	// 0
	LPVOID;	// 4
	BOOL;	// 8
} Eq_1473;

