// subject.h
// Generated on TIMESTAMP by decompiling malware_via_email/malware_0731/ia32_pe/subject.exe
// using Decompiler version VERSION

/*
// Equivalence classes ////////////
Eq_1: (struct "Globals" (402001 Eq_28 t402001) (402005 Eq_28 t402005) (4062E8 Eq_28 t4062E8) (4062EC word32 dw4062EC) (4062F0 up32 dw4062F0) (4062F4 word32 dw4062F4) (4062F8 Eq_28 t4062F8) (4062FC word32 dw4062FC) (406300 word32 dw406300) (406304 word32 dw406304) (406308 word32 dw406308) (40630C (ptr Eq_202) ptr40630C) (406310 (ptr code) ptr406310))
	globals_t (in globals : (ptr (struct "Globals")))
Eq_26: (fn (ptr code) (Eq_28, Eq_29))
	T_26 (in GetProcAddress : ptr32)
	T_27 (in signature of GetProcAddress : void)
	T_250 (in GetProcAddress : ptr32)
	T_334 (in GetProcAddress : ptr32)
	T_351 (in GetProcAddress : ptr32)
	T_481 (in GetProcAddress : ptr32)
	T_965 (in GetProcAddress : ptr32)
Eq_28: (union "Eq_28" ((ptr Eq_1177) u0) (HANDLE u1) (HMODULE u2) (LPCSTR u3) (LPVOID u4) (SIZE_T u5))
	T_28 (in hModule : HMODULE)
	T_34 (in LoadLibraryA(0x00406204) : word32)
	T_75 (in 0x00406224 : word32)
	T_78 (in Mem131[fp - 0x000000B8:word32] : word32)
	T_88 (in 0x00000000 : word32)
	T_91 (in Mem138[fp - 0x000000B8:word32] : word32)
	T_114 (in 0x00000000 : word32)
	T_117 (in Mem160[fp - 0x000000B8:word32] : word32)
	T_118 (in eax_161 : Eq_28)
	T_121 (in lpModuleName : LPCSTR)
	T_122 (in GetModuleHandleA(null) : word32)
	T_123 (in dwArg04 : word32)
	T_134 (in 0x00000000 : word32)
	T_149 (in eax_182 : Eq_28)

  DataType: word32
  OrigDataType: word32
T_1154: (in ecx_16 & 0x0000007F : word32)
  Class: Eq_1154
  DataType: word32
  OrigDataType: word32
T_1155: (in 0x00000007 : word32)
  Class: Eq_1155
  DataType: word32
  OrigDataType: word32
T_1156: (in dwLoc08_12 << 0x00000007 : word32)
  Class: Eq_1156
  DataType: ui32
  OrigDataType: ui32
T_1157: (in ecx_16 & 0x0000007F | dwLoc08_12 << 0x00000007 : word32)
  Class: Eq_1142
  DataType: word32
  OrigDataType: word32
T_1158: (in edx_29 : word32)
  Class: Eq_1144
  DataType: word32
  OrigDataType: word32
T_1159: (in 0x00000001 : word32)
  Class: Eq_1159
  DataType: word32
  OrigDataType: word32
T_1160: (in dwLoc10_13 + 0x00000001 : word32)
  Class: Eq_1144
  DataType: word32
  OrigDataType: word32
T_1161: (in 0x00000001 : word32)
  Class: Eq_1161
  DataType: word32
  OrigDataType: word32
T_1162: (in dwArg08 + 0x00000001 : word32)
  Class: Eq_1147
  DataType: (ptr Eq_1147)
  OrigDataType: word32
T_1163: (in 0x00000080 : word32)
  Class: Eq_1163
  DataType: word32
  OrigDataType: word32
T_1164: (in ecx_16 & 0x00000080 : word32)
  Class: Eq_1164
  DataType: word32
  OrigDataType: word32
T_1165: (in 0x00000000 : word32)
  Class: Eq_1164
  DataType: word32
  OrigDataType: word32
T_1166: (in (ecx_16 & 0x00000080) != 0x00000000 : bool)
  Class: Eq_1166
  DataType: bool
  OrigDataType: bool
T_1167: (in dwArg04 : word32)
  Class: Eq_1167
  DataType: (ptr word32)
  OrigDataType: (ptr (struct (0 T_1170 t0000)))
T_1168: (in 0x00000000 : word32)
  Class: Eq_1168
  DataType: word32
  OrigDataType: word32
T_1169: (in dwArg04 + 0x00000000 : word32)
  Class: Eq_1169
  DataType: word32
  OrigDataType: word32
T_1170: (in Mem39[dwArg04 + 0x00000000:word32] : word32)
  Class: Eq_1142
  DataType: word32
  OrigDataType: word32
T_1171:
  Class: Eq_1171
  DataType: word16
  OrigDataType: (struct 0002 (0 T_542 t0000))
T_1172:
  Class: Eq_1171
  DataType: word16
  OrigDataType: (struct 0002 (0 T_554 t0000))
T_1173:
  Class: Eq_1171
  DataType: word16
  OrigDataType: (struct 0002 (0 T_567 t0000))
T_1174:
  Class: Eq_1174
  DataType: word16
  OrigDataType: (struct 0002 (0 T_1022 t0000))
T_1175:
  Class: Eq_1174
  DataType: word16
  OrigDataType: (struct 0002 (0 T_1036 t0000))
T_1176:
  Class: Eq_1174
  DataType: word16
  OrigDataType: (struct 0002 (0 T_1051 t0000))
T_1177:
  Class: Eq_1177
  DataType: Eq_1177
  OrigDataType: 
T_1178:
  Class: Eq_1178
  DataType: int32
  OrigDataType: 
T_1179:
  Class: Eq_1179
  DataType: Eq_1179
  OrigDataType: 
*/
typedef Eq_28 Eq_1Eq_28 Eq_1Eq_28 Eq_1Eq_28 Eq_1Eq_202 Eq_1code Eq_1struct Globals {
	Eq_28 t402001;	// 402001
	Eq_28 t402005;	// 402005
	Eq_28 t4062E8;	// 4062E8
	word32 dw4062EC;	// 4062EC
	up32 dw4062F0;	// 4062F0
	word32 dw4062F4;	// 4062F4
	Eq_28 t4062F8;	// 4062F8
	word32 dw4062FC;	// 4062FC
	word32 dw406300;	// 406300
	word32 dw406304;	// 406304
	word32 dw406308;	// 406308
	Eq_202 * ptr40630C;	// 40630C
	code * ptr406310;	// 406310
} Eq_1;

typedef code * (Eq_26)(Eq_28, Eq_29);

typedef union Eq_28 {
	Eq_1177* u0;
	 HANDLE u1;
	 HMODULE u2;
	 LPCSTR u3;
	 LPVOID u4;
	 SIZE_T u5;
} Eq_28;

typedef union Eq_29 {
	word32 u0;
	 LPCSTR u1;
} Eq_29;

typedef Eq_28 (Eq_30)(Eq_32);

typedef union Eq_32 {
	word32 u0;
	 LPCSTR u1;
} Eq_32;

typedef word32 (Eq_37)(Eq_39, Eq_40);

typedef union Eq_39 {
	word32 u0;
	 DWORD u1;
	 LPSTR u2;
} Eq_39;

typedef union Eq_40 {
	word32 u0;
	 HANDLE u1;
	 LPCSTR u2;
} Eq_40;

typedef Eq_28 Eq_41struct Eq_41 {
	word32 dwFFFFFF3C;	// FFFFFF3C
	ptr32 ptrFFFFFF40;	// FFFFFF40
	word32 dwFFFFFF44;	// FFFFFF44
	Eq_28 tFFFFFF48;	// FFFFFF48
	word32 dwFFFFFF4C;	// FFFFFF4C
	word32 dwFFFFFF50;	// FFFFFF50
} Eq_41;

typedef word32 (Eq_46)(Eq_48, Eq_49, Eq_50, Eq_51, Eq_52, Eq_39, Eq_40);

typedef union Eq_48 {
	word32 u0;
	 LPCSTR u1;
} Eq_48;

typedef union Eq_49 {
	word32 u0;
	 DWORD u1;
} Eq_49;

typedef union Eq_50 {
	word32 u0;
	 DWORD u1;
} Eq_50;

typedef union Eq_51 {
	word32 u0;
	 LPSECURITY_ATTRIBUTES u1;
} Eq_51;

typedef union Eq_52 {
	word32 u0;
	 DWORD u1;
} Eq_52;

typedef Eq_28 (Eq_119)(Eq_28);

typedef word32 (Eq_163)(word32);

typedef void (Eq_182)(word32, word32, word32);

typedef Eq_202 Eq_200struct Eq_200 {
	Eq_202 * ptr0018;	// 18
} Eq_200;

typedef union Eq_201 {
	ptr32 u0;
	Eq_202* Eq_200::* u1;
} Eq_201;

typedef Eq_917 Eq_202struct Eq_202 {
	Eq_917 * ptr0030;	// 30
} Eq_202;

typedef struct Eq_214 {
	word32 dw0008;	// 8
} Eq_214;

typedef struct Eq_221 {
	word32 dw0008;	// 8
} Eq_221;

typedef void (Eq_227)(word32, Eq_28);

typedef void (Eq_241)(word32, word32);

typedef word32 (Eq_254)(Eq_256, Eq_257);

typedef union Eq_256 {
	word32 u0;
	 LPSTR u1;
} Eq_256;

typedef union Eq_257 {
	word32 u0;
	 LPCSTR u1;
} Eq_257;

typedef Eq_28 Eq_258Eq_28 Eq_258struct Eq_258 {
	Eq_28 tFFFFFF20;	// FFFFFF20
	word32 dwFFFFFF2C;	// FFFFFF2C
	Eq_28 tFFFFFF34;	// FFFFFF34
	word32 dwFFFFFF38;	// FFFFFF38
	word32 dwFFFFFFE4;	// FFFFFFE4
} Eq_258;

typedef Eq_395 Eq_263Eq_28 Eq_263struct Eq_263 {
	word16 w0006;	// 6
	word16 w0014;	// 14
	Eq_395 t003C;	// 3C
	Eq_28 t0050;	// 50
} Eq_263;

typedef Eq_269 Eq_269struct Eq_269 {	// size: 40 28
	word32 dw000C;	// C
	word32 dw0010;	// 10
	word32 dw0014;	// 14
	Eq_269 t0028;	// 28
} Eq_269;

typedef Eq_28 (Eq_278)(Eq_28, Eq_28, Eq_282, Eq_283);

typedef union Eq_282 {
	word32 u0;
	 DWORD u1;
} Eq_282;

typedef union Eq_283 {
	word32 u0;
	 DWORD u1;
} Eq_283;

typedef void (Eq_311)(Eq_28, Eq_28, Eq_28);

typedef union Eq_395 {
	int32 u0;
	uint32 u1;
} Eq_395;

typedef union Eq_416 {
	int32 u0;
	uint32 u1;
} Eq_416;

typedef code * (Eq_423)(Eq_28, word32);

typedef Eq_432 Eq_432struct Eq_432 {	// size: 20 14
	word32 dw0000;	// 0
	word32 dw000C;	// C
	word32 dw0010;	// 10
	Eq_432 t0014;	// 14
} Eq_432;

typedef code Eq_441Eq_441 Eq_441struct Eq_441 {	// size: 4 4
	code * ptr0000;	// 0
	Eq_441 t0004;	// 4
} Eq_441;

typedef code Eq_442Eq_442 Eq_442struct Eq_442 {	// size: 4 4
	code * ptr0000;	// 0
	Eq_442 t0004;	// 4
} Eq_442;

typedef  Eq_503[]struct Eq_503 {
	word32 dw0000;	// 0
	word32 dw0004;	// 4
	word16 a0008[];	// 8
} Eq_503;

typedef Eq_28 Eq_658Eq_28 Eq_658Eq_28 Eq_658struct Eq_658 {
	Eq_28 tFFFFFFF8;	// FFFFFFF8
	Eq_28 tFFFFFFFC;	// FFFFFFFC
	Eq_28 t0000;	// 0
} Eq_658;

typedef word32 (Eq_664)(Eq_28);

typedef void (Eq_715)(Eq_28);

typedef void (Eq_733)(Eq_28, Eq_28);

typedef Eq_28 Eq_766Eq_28 Eq_766struct Eq_766 {
	Eq_28 tFFFFFFEC;	// FFFFFFEC
	word32 dwFFFFFFF0;	// FFFFFFF0
	word32 dwFFFFFFF4;	// FFFFFFF4
	word32 dwFFFFFFF8;	// FFFFFFF8
	word32 dwFFFFFFFC;	// FFFFFFFC
	Eq_28 t0000;	// 0
} Eq_766;

typedef Eq_28 Eq_797Eq_28 Eq_797struct Eq_797 {
	Eq_28 tFFFFFFEC;	// FFFFFFEC
	word32 dwFFFFFFF0;	// FFFFFFF0
	word32 dwFFFFFFF4;	// FFFFFFF4
	word32 dwFFFFFFF8;	// FFFFFFF8
	word32 dwFFFFFFFC;	// FFFFFFFC
	Eq_28 t0000;	// 0
} Eq_797;

typedef Eq_28 Eq_833Eq_28 Eq_833Eq_282 Eq_833Eq_283 Eq_833struct Eq_833 {
	Eq_28 tFFFFFFF4;	// FFFFFFF4
	Eq_28 tFFFFFFF8;	// FFFFFFF8
	Eq_282 tFFFFFFFC;	// FFFFFFFC
	Eq_283 t0000;	// 0
} Eq_833;

typedef Eq_28 Eq_872Eq_28 Eq_872Eq_282 Eq_872Eq_283 Eq_872struct Eq_872 {
	Eq_28 tFFFFFFF4;	// FFFFFFF4
	Eq_28 tFFFFFFF8;	// FFFFFFF8
	Eq_282 tFFFFFFFC;	// FFFFFFFC
	Eq_283 t0000;	// 0
} Eq_872;

typedef Eq_912 Eq_912struct Eq_912 {
	Eq_912 * ptr0000;	// 0
	word32 dw0018;	// 18
	word32 dw001C;	// 1C
} Eq_912;

typedef Eq_920 Eq_917struct Eq_917 {
	word32 dw0008;	// 8
	Eq_920 * ptr000C;	// C
} Eq_917;

typedef Eq_912 Eq_920struct Eq_920 {
	Eq_912 * ptr000C;	// C
} Eq_920;

typedef Eq_28 Eq_959struct Eq_959 {
	Eq_28 t0050;	// 50
	word32 dw00A0;	// A0
	word32 dw00A4;	// A4
} Eq_959;

typedef  Eq_997[]struct Eq_997 {
	word32 dw0000;	// 0
	word32 dw0004;	// 4
	word16 a0008[];	// 8
} Eq_997;

typedef word32 (Eq_1096)(word32, word32);

typedef Eq_1147 Eq_1147struct Eq_1147 {	// size: 1 1
	byte b0000;	// 0
	Eq_1147 t0001;	// 1
} Eq_1147;

typedef code Eq_1177Eq_28 Eq_1177Eq_28 Eq_1177struct Eq_1177 {
	code * ptr0028;	// 28
	Eq_28 t0034;	// 34
	word32 dw003C;	// 3C
	Eq_28 t0050;	// 50
	word32 dw0080;	// 80
	word32 dw00A0;	// A0
	word32 dw00A4;	// A4
} Eq_1177;

typedef DWORDLPVOIDBOOLstruct _SECURITY_ATTRIBUTES {
	DWORD;	// 0
	LPVOID;	// 4
	BOOL;	// 8
} Eq_1179;

