// subject.h
// Generated on 5/4/2015 12:12:19 AM by decompiling from_pouet.net/with_source_394/ia32_mz/subject.exe
// using Decompiler version 0.4.2.0.

/*
// Equivalence classes ////////////
Eq_1: (struct "Globals" (FFFA0000 (ptr Eq_31) ptrFFFA0000) (8000 (ptr Eq_14) ptr8000))
	globals_t (in globals : (ptr (struct "Globals")))
Eq_2: (fn void (byte))
	T_2 (in bios_video_set_mode : ptr32)
	T_3 (in signature of bios_video_set_mode : void)
	T_7 (in bios_video_set_mode : ptr32)
Eq_10: (fn void (word16, word16, (ptr Eq_14), word16))
	T_10 (in bios_video_set_block_of_DAC_registers : ptr32)
	T_11 (in signature of bios_video_set_block_of_DAC_registers : void)
Eq_14: (segment "Eq_14" (FFFF99C0 (union "Eq_213" (uint16 u0) (byte u1)) uFFFF99C0) (FFFFE055 (union "Eq_213") uFFFFE055) (0 byte b0000) (5E Eq_471 t005E) (FE Eq_480 t00FE) (8C0 (arr byte) a08C0) (99C0 Eq_213 t99C0) (DB5E uint16 wDB5E) (DB60 word16 wDB60) (DB62 word16 wDB62) (DB64 uint16 wDB64) (DB66 (memptr (ptr Eq_14) Eq_480) ptrDB66) (DB68 (memptr (ptr Eq_14) Eq_471) ptrDB68) (DB6A word16 wDB6A) (DB6C (memptr (ptr Eq_14) byte) ptrDB6C) (DB6E (memptr (ptr Eq_31) byte) ptrDB6E) (DB72 word16 wDB72) (DB77 byte bDB77) (DB78 Eq_632 tDB78) (DB7B byte bDB7B) (E055 Eq_213 tE055))
	T_14 (in es : selector)
	T_18 (in 0x0800 : selector)
	T_780 (in ds : selector)
Eq_21: (segment "Eq_21")
	T_21 (in ds : (ptr Eq_21))

T_761: (in signature of fn1676_037C : void)
  Class: Eq_760
  DataType: (ptr Eq_760)
  OrigDataType: 
T_762: (in fn1676_037C(ds_21) : selector)
  Class: Eq_409
  DataType: (ptr Eq_409)
  OrigDataType: (ptr (segment))
T_763: (in fn1676_029E(fn1676_037C(ds_21)) : void)
  Class: Eq_763
  DataType: void
  OrigDataType: void
T_764: (in fn1676_009B : ptr32)
  Class: Eq_764
  DataType: (ptr Eq_764)
  OrigDataType: (ptr (fn T_766 ()))
T_765: (in signature of fn1676_009B : void)
  Class: Eq_764
  DataType: (ptr Eq_764)
  OrigDataType: 
T_766: (in fn1676_009B() : void)
  Class: Eq_766
  DataType: void
  OrigDataType: void
T_767: (in __inb : ptr32)
  Class: Eq_767
  DataType: (ptr Eq_767)
  OrigDataType: (ptr (fn T_769 (T_768)))
T_768: (in 0x60 : byte)
  Class: Eq_768
  DataType: byte
  OrigDataType: byte
T_769: (in __inb(0x60) : byte)
  Class: Eq_769
  DataType: byte
  OrigDataType: byte
T_770: (in 0x01 : byte)
  Class: Eq_769
  DataType: byte
  OrigDataType: byte
T_771: (in __inb(0x60) != 0x01 : bool)
  Class: Eq_771
  DataType: bool
  OrigDataType: bool
T_772: (in __outb : ptr32)
  Class: Eq_772
  DataType: (ptr Eq_772)
  OrigDataType: (ptr (fn T_775 (T_773, T_774)))
T_773: (in 0x21 : byte)
  Class: Eq_773
  DataType: byte
  OrigDataType: byte
T_774: (in 0x00 : byte)
  Class: Eq_774
  DataType: byte
  OrigDataType: byte
T_775: (in __outb(0x21, 0x00) : void)
  Class: Eq_775
  DataType: void
  OrigDataType: void
T_776: (in fn1676_0068 : ptr32)
  Class: Eq_725
  DataType: (ptr Eq_725)
  OrigDataType: (ptr (fn T_777 ()))
T_777: (in fn1676_0068() : void)
  Class: Eq_727
  DataType: void
  OrigDataType: void
T_778: (in msdos_display_string : ptr32)
  Class: Eq_778
  DataType: (ptr Eq_778)
  OrigDataType: (ptr (fn T_783 (T_18, T_782)))
T_779: (in signature of msdos_display_string : void)
  Class: Eq_778
  DataType: (ptr Eq_778)
  OrigDataType: 
T_780: (in ds : selector)
  Class: Eq_14
  DataType: (ptr Eq_14)
  OrigDataType: (ptr (segment))
T_781: (in dx : word16)
  Class: Eq_781
  DataType: word16
  OrigDataType: word16
T_782: (in 0xE6B4 : word16)
  Class: Eq_781
  DataType: word16
  OrigDataType: word16
T_783: (in msdos_display_string(0x0800, 0xE6B4) : void)
  Class: Eq_783
  DataType: void
  OrigDataType: void
T_784: (in msdos_terminate : ptr32)
  Class: Eq_784
  DataType: (ptr Eq_784)
  OrigDataType: (ptr (fn T_788 (T_787)))
T_785: (in signature of msdos_terminate : void)
  Class: Eq_784
  DataType: (ptr Eq_784)
  OrigDataType: 
T_786: (in al : byte)
  Class: Eq_786
  DataType: byte
  OrigDataType: byte
T_787: (in 0x00 : byte)
  Class: Eq_786
  DataType: byte
  OrigDataType: byte
T_788: (in msdos_terminate(0x00) : void)
  Class: Eq_788
  DataType: void
  OrigDataType: void
T_789:
  Class: Eq_789
  DataType: byte
  OrigDataType: (struct 0001 (0 T_30 t0000))
T_790:
  Class: Eq_790
  DataType: byte
  OrigDataType: (struct 0001 (0 T_34 t0000))
T_791:
  Class: Eq_791
  DataType: Eq_791
  OrigDataType: 
*/
typedef Eq_31 Eq_1Eq_14 Eq_1struct Globals {
	Eq_31 * ptrFFFA0000;	// FFFA0000
	Eq_14 * ptr8000;	// 8000
} Eq_1;

typedef void (Eq_2)(byte);

typedef void (Eq_10)(word16, word16, Eq_14 *, word16);

typedef union Eq_213 {
	uint16 u0;
	byte u1;
} Eq_14union Eq_213 {
	uint16 u0;
	byte u1;
} Eq_14Eq_471 Eq_14Eq_480 Eq_14 Eq_14[]Eq_213Eq_480Eq_471Eq_632Eq_213struct Eq_14 {
	union Eq_213 {
		uint16 u0;
		byte u1;
	} uFFFF99C0;	// FFFF99C0
	union Eq_213 {
		uint16 u0;
		byte u1;
	} uFFFFE055;	// FFFFE055
	byte b0000;	// 0
	Eq_471 t005E;	// 5E
	Eq_480 t00FE;	// FE
	byte a08C0[];	// 8C0
	Eq_213 t99C0;	// 99C0
	uint16 wDB5E;	// DB5E
	word16 wDB60;	// DB60
	word16 wDB62;	// DB62
	uint16 wDB64;	// DB64
	Eq_480 Eq_14::*ptrDB66;	// DB66
	Eq_471 Eq_14::*ptrDB68;	// DB68
	word16 wDB6A;	// DB6A
	byte Eq_14::*ptrDB6C;	// DB6C
	byte Eq_31::*ptrDB6E;	// DB6E
	word16 wDB72;	// DB72
	byte bDB77;	// DB77
	Eq_632 tDB78;	// DB78
	byte bDB7B;	// DB7B
	Eq_213 tE055;	// E055
} Eq_14;

typedef struct Eq_21 {
} Eq_21;

typedef union Eq_213 {
	uint16 u0;
	byte u1;
} Eq_31union Eq_213 {
	uint16 u0;
	byte u1;
} Eq_31 Eq_31[]Eq_213Eq_213struct Eq_31 {
	byte bFFFFD840;	// FFFFD840
	byte bFFFFD842;	// FFFFD842
	union Eq_213 {
		uint16 u0;
		byte u1;
	} uFFFFD97E;	// FFFFD97E
	union Eq_213 {
		uint16 u0;
		byte u1;
	} uFFFFD97F;	// FFFFD97F
	byte a3200[];	// 3200
	byte bD840;	// D840
	byte bD842;	// D842
	Eq_213 tD97E;	// D97E
	Eq_213 tD97F;	// D97F
} Eq_31;

typedef struct Eq_114 {
} Eq_114;

typedef void (Eq_208)();

typedef union Eq_213 {
	uint16 u0;
	byte u1;
} Eq_213;

typedef struct Eq_215 {
	word16 wDB60;	// DB60
	word16 wDB6A;	// DB6A
} Eq_215;

typedef struct Eq_253 {
} Eq_253;

typedef void (Eq_300)();

typedef void (Eq_389)(Eq_215 *);

typedef struct Eq_409 {
	byte bDB5C;	// DB5C
	byte bDB5D;	// DB5D
} Eq_409;

typedef void (Eq_414)(word16, byte);

typedef void (Eq_421)(word16, byte);

typedef void (Eq_424)(word16, byte);

typedef void (Eq_427)(word16, byte);

typedef void (Eq_434)(word16, byte);

typedef void (Eq_441)(word16, byte);

typedef void (Eq_444)(word16, byte);

typedef void (Eq_447)(word16, byte);

typedef struct Eq_471 {
	word16 wFFFFD8C0;	// FFFFD8C0
} Eq_471;

typedef struct Eq_480 {
	word16 wFFFFD920;	// FFFFD920
} Eq_480;

typedef void (Eq_525)();

typedef void (Eq_528)();

typedef Eq_215 * (Eq_532)();

typedef void (Eq_542)(word16, byte);

typedef void (Eq_546)(word16, byte);

typedef void (Eq_550)(word16, byte);

typedef void (Eq_554)(word16, byte);

typedef byte (Eq_558)(word16);

typedef void (Eq_565)(word16, byte);

typedef struct Eq_570 {
	byte bDB76;	// DB76
	byte bDB77;	// DB77
	byte bDB7C;	// DB7C
} Eq_570;

typedef void (Eq_573)(word16, byte);

typedef void (Eq_576)(word16, byte);

typedef void (Eq_579)(word16, byte);

typedef void (Eq_604)(Eq_570 *);

typedef Eq_609 * (Eq_607)();

typedef struct Eq_609 {
} Eq_609;

typedef struct Eq_628 {
} Eq_628;

typedef union Eq_632 {
	int16 u0;
	Eq_791 Eq_14::* u1;
} Eq_632;

typedef bool (Eq_716)(Eq_718 *, word16, word16 *);

typedef struct Eq_718 {
} Eq_718;

typedef void (Eq_725)();

typedef void (Eq_730)();

typedef void (Eq_739)();

typedef void (Eq_742)(byte, byte);

typedef void (Eq_746)();

typedef Eq_570 * (Eq_750)();

typedef void (Eq_755)();

typedef void (Eq_758)(Eq_409 *);

typedef Eq_409 * (Eq_760)(Eq_570 *);

typedef void (Eq_764)();

typedef byte (Eq_767)(byte);

typedef void (Eq_772)(byte, byte);

typedef void (Eq_778)(Eq_14 *, word16);

typedef void (Eq_784)(byte);

typedef struct Eq_791 {
	word16 wFFFFDB7D;	// FFFFDB7D
} Eq_791;

