// subject.h
// Generated on TIMESTAMP by decompiling malware_via_email/malware_0763/ia32_pe/subject.exe
// using Decompiler version VERSION

/*
// Equivalence classes ////////////
Eq_1: (struct "Globals" (404034 (struct "Eq_2117" (0 up32 dw0000) (4 word32 dw0004) (3C word32 dw003C)) t404034) (404064 word32 dw404064) (404068 int32 dw404068) (40406C int32 dw40406C) (404070 int32 dw404070) (404074 int32 dw404074) (404078 int32 dw404078) (40407C word32 dw40407C) (404080 Eq_56 t404080) (404084 (ptr Eq_904) ptr404084) (404088 int32 dw404088) (40408C word32 dw40408C) (404090 int32 dw404090) (404094 Eq_311 t404094) (404098 word32 dw404098) (40409C int32 dw40409C) (4040A0 Eq_38 t4040A0) (4040A4 Eq_311 t4040A4) (4040A8 (ptr Eq_945) ptr4040A8) (4040AC (ptr code) ptr4040AC) (4040B0 int32 dw4040B0) (4040B4 ui32 dw4040B4))
	globals_t (in globals : (ptr (struct "Globals")))
Eq_9: (fn word32 (Eq_11))
	T_9 (in GetBkColor : ptr32)
	T_10 (in signature of GetBkColor : void)
Eq_11: (union "Eq_11" (word32 u0) (HDC u1))
	T_11 (in hdc : HDC)
	T_12 (in 0x00047B9D : word32)
Eq_38: (union "Eq_38" (int32 u0) (ptr32 u1))
	T_38 (in globals->dw40409C - 0x000D4E0C - globals->dw404068 : word32)
	T_40 (in Mem40[0x004040A0:word32] : word32)
	T_268 (in 0x00077A9E << (byte) (dwLoc14 * 0x00000002) << (byte) dwLoc20 : word32)
	T_270 (in Mem43[0x004040A0:word32] : word32)
	T_286 (in AdjustWindowRect : ptr32)
	T_287 (in signature of AdjustWindowRect : void)
	T_292 (in Mem26[0x004040A0:word32] : word32)

T_2102: (in 0x004040B0 : ptr32)
  Class: Eq_2102
  DataType: (ptr int32)
  OrigDataType: (ptr (struct (0 T_2103 t0000)))
T_2103: (in Mem35[0x004040B0:word32] : word32)
  Class: Eq_113
  DataType: int32
  OrigDataType: word32
T_2104:
  Class: Eq_2104
  DataType: word16
  OrigDataType: (struct 0002 (0 T_1261 t0000))
T_2105:
  Class: Eq_2104
  DataType: word16
  OrigDataType: (struct 0002 (0 T_1275 t0000))
T_2106:
  Class: Eq_2104
  DataType: word16
  OrigDataType: (struct 0002 (0 T_1290 t0000))
T_2107:
  Class: Eq_2107
  DataType: word16
  OrigDataType: (struct 0002 (0 T_1586 t0000))
T_2108:
  Class: Eq_2107
  DataType: word16
  OrigDataType: (struct 0002 (0 T_1598 t0000))
T_2109:
  Class: Eq_2107
  DataType: word16
  OrigDataType: (struct 0002 (0 T_1611 t0000))
T_2110:
  Class: Eq_2110
  DataType: int32
  OrigDataType: 
T_2111:
  Class: Eq_2111
  DataType: Eq_2111
  OrigDataType: 
T_2112:
  Class: Eq_2112
  DataType: int32
  OrigDataType: 
T_2113:
  Class: Eq_2113
  DataType: int32
  OrigDataType: 
T_2114:
  Class: Eq_2114
  DataType: Eq_2114
  OrigDataType: 
T_2115:
  Class: Eq_2115
  DataType: int32
  OrigDataType: 
T_2116:
  Class: Eq_2116
  DataType: Eq_2116
  OrigDataType: 
T_2117:
  Class: Eq_2117
  DataType: Eq_2117
  OrigDataType: 
T_2118:
  Class: Eq_2118
  DataType: int32
  OrigDataType: 
T_2119:
  Class: Eq_2119
  DataType: int32
  OrigDataType: 
T_2120:
  Class: Eq_2120
  DataType: int32
  OrigDataType: 
T_2121:
  Class: Eq_2121
  DataType: int32
  OrigDataType: 
T_2122:
  Class: Eq_2122
  DataType: int32
  OrigDataType: 
T_2123:
  Class: Eq_2123
  DataType: int32
  OrigDataType: 
T_2124:
  Class: Eq_2124
  DataType: int32
  OrigDataType: 
T_2125:
  Class: Eq_2125
  DataType: int32
  OrigDataType: 
T_2126:
  Class: Eq_2126
  DataType: Eq_2126
  OrigDataType: 
T_2127:
  Class: Eq_2127
  DataType: Eq_2127
  OrigDataType: 
T_2128:
  Class: Eq_2128
  DataType: Eq_2128
  OrigDataType: 
T_2129:
  Class: Eq_2129
  DataType: Eq_2129
  OrigDataType: 
T_2130:
  Class: Eq_2130
  DataType: Eq_2130
  OrigDataType: 
T_2131:
  Class: Eq_2131
  DataType: int32
  OrigDataType: 
T_2132:
  Class: Eq_2132
  DataType: Eq_2132
  OrigDataType: 
T_2133:
  Class: Eq_2133
  DataType: Eq_2133
  OrigDataType: 
*/
typedef struct Eq_2117;
Eq_56 Eq_1Eq_904 Eq_1Eq_311 Eq_1Eq_38 Eq_1Eq_311 Eq_1Eq_945 Eq_1code Eq_1struct Globals {
	struct Eq_2117 t404034;	// 404034
	word32 dw404064;	// 404064
	int32 dw404068;	// 404068
	int32 dw40406C;	// 40406C
	int32 dw404070;	// 404070
	int32 dw404074;	// 404074
	int32 dw404078;	// 404078
	word32 dw40407C;	// 40407C
	Eq_56 t404080;	// 404080
	Eq_904 * ptr404084;	// 404084
	int32 dw404088;	// 404088
	word32 dw40408C;	// 40408C
	int32 dw404090;	// 404090
	Eq_311 t404094;	// 404094
	word32 dw404098;	// 404098
	int32 dw40409C;	// 40409C
	Eq_38 t4040A0;	// 4040A0
	Eq_311 t4040A4;	// 4040A4
	Eq_945 * ptr4040A8;	// 4040A8
	code * ptr4040AC;	// 4040AC
	int32 dw4040B0;	// 4040B0
	ui32 dw4040B4;	// 4040B4
} Eq_1;

typedef word32 (Eq_9)(Eq_11);

typedef union Eq_11 {
	word32 u0;
	 HDC u1;
} Eq_11;

typedef union Eq_38 {
	int32 u0;
	ptr32 u1;
} Eq_38;

typedef word32 (Eq_54)(Eq_56, Eq_57);

typedef union Eq_56 {
	Eq_2111* u0;
	 DWORD u1;
	 HINSTANCE u2;
	 HMODULE u3;
	 LPCVOID u4;
	 LPRECT u5;
	 LPVOID u6;
} Eq_56;

typedef union Eq_57 {
	word32 u0;
	 LPCSTR u1;
} Eq_57;

typedef struct Eq_65 {
	word32 dwFFFFFFC4;	// FFFFFFC4
} Eq_65;

typedef word32 (Eq_69)(Eq_71);

typedef union Eq_71 {
	word32 u0;
	 HICON u1;
} Eq_71;

typedef word32 (Eq_121)(word32, word32);

typedef Eq_183 Eq_183struct Eq_183 {	// size: 1 1
	byte b0000;	// 0
	Eq_183 t0001;	// 1
} Eq_183;

typedef word32 (Eq_230)(Eq_232, Eq_233, Eq_234, Eq_235, Eq_236, Eq_237, Eq_238);

typedef union Eq_232 {
	word32 u0;
	 LPCSTR u1;
} Eq_232;

typedef union Eq_233 {
	word32 u0;
	 DWORD u1;
} Eq_233;

typedef union Eq_234 {
	word32 u0;
	 DWORD u1;
} Eq_234;

typedef union Eq_235 {
	word32 u0;
	 LPSECURITY_ATTRIBUTES u1;
} Eq_235;

typedef union Eq_236 {
	word32 u0;
	 DWORD u1;
} Eq_236;

typedef union Eq_237 {
	word32 u0;
	 DWORD u1;
} Eq_237;

typedef union Eq_238 {
	word32 u0;
	 HANDLE u1;
} Eq_238;

typedef Eq_56 (Eq_309)(Eq_311);

typedef union Eq_311 {
	Eq_2117* u0;
	 HANDLE u1;
	 HCURSOR u2;
	 HINSTANCE u3;
	 LPCSTR u4;
	 LPSTR u5;
	 UINT u6;
} Eq_311;

typedef Eq_311 (Eq_332)(Eq_334, Eq_311);

typedef union Eq_334 {
	word32 u0;
	 HINSTANCE u1;
} Eq_334;

typedef word32 (Eq_356)(WNDCLASSA *);

typedef WNDCLASSA;

typedef Eq_311 Eq_359Eq_311 Eq_359Eq_56 Eq_359Eq_311 Eq_359WNDCLASSA Eq_359struct Eq_359 {
	Eq_311 tFFFFFED0;	// FFFFFED0
	Eq_311 tFFFFFED4;	// FFFFFED4
	word32 dwFFFFFED8;	// FFFFFED8
	Eq_56 tFFFFFEDC;	// FFFFFEDC
	Eq_311 tFFFFFEE0;	// FFFFFEE0
	WNDCLASSA tFFFFFF44;	// FFFFFF44
	int32 dwFFFFFFD8;	// FFFFFFD8
} Eq_359;

typedef word32 (Eq_386)(Eq_388, Eq_389, Eq_390, Eq_391, int32, int32, int32, int32, Eq_396, Eq_397, Eq_311, Eq_399);

typedef union Eq_388 {
	word32 u0;
	 DWORD u1;
} Eq_388;

typedef union Eq_389 {
	word32 u0;
	 LPCSTR u1;
} Eq_389;

typedef union Eq_390 {
	word32 u0;
	 LPCSTR u1;
} Eq_390;

typedef union Eq_391 {
	word32 u0;
	 DWORD u1;
} Eq_391;

typedef union Eq_396 {
	word32 u0;
	 HWND u1;
} Eq_396;

typedef union Eq_397 {
	word32 u0;
	 HMENU u1;
} Eq_397;

typedef union Eq_399 {
	word32 u0;
	 LPVOID u1;
} Eq_399;

typedef Eq_592 Eq_458struct Eq_458 {
	word16 w0006;	// 6
	word16 w0014;	// 14
	Eq_592 t003C;	// 3C
} Eq_458;

typedef void (Eq_472)(word32, byte, word32);

typedef void (Eq_486)(Eq_488);

typedef union Eq_488 {
	word32 u0;
	 LPSTARTUPINFOA u1;
} Eq_488;

typedef word32 (Eq_504)(Eq_311);

typedef word32 (Eq_543)(Eq_56, Eq_546);

typedef union Eq_546 {
	 RECT* u0;
	 DWORD u1;
} Eq_546;

typedef struct Eq_567 {
	word32 dw0010;	// 10
	word32 dw0014;	// 14
} Eq_567;

typedef union Eq_592 {
	int32 u0;
	uint32 u1;
} Eq_592;

typedef union Eq_594 {
	word32 u0;
	 LONG u1;
} Eq_594;

typedef union Eq_605 {
	int32 u0;
	uint32 u1;
} Eq_605;

typedef Eq_311 (Eq_621)(word32);

typedef word32 (Eq_640)(Eq_56, Eq_311, Eq_546);

typedef Eq_311 (Eq_693)(word32);

typedef union Eq_709 {
	word32 u0;
	 DWORD u1;
} Eq_709;

typedef word32 (Eq_710)(Eq_311, Eq_713);

typedef union Eq_713 {
	word32 u0;
	 LPDWORD u1;
} Eq_713;

typedef word32 (Eq_749)(Eq_751, Eq_594, Eq_753, Eq_754);

typedef union Eq_751 {
	word32 u0;
	 HANDLE u1;
	 LPVOID u2;
} Eq_751;

typedef union Eq_753 {
	word32 u0;
	 PLONG u1;
} Eq_753;

typedef union Eq_754 {
	word32 u0;
	 DWORD u1;
} Eq_754;

typedef word32 (Eq_765)(Eq_767, Eq_751, Eq_709, Eq_770, Eq_771);

typedef union Eq_767 {
	word32 u0;
	 HANDLE u1;
} Eq_767;

typedef union Eq_770 {
	word32 u0;
	 LPDWORD u1;
} Eq_770;

typedef union Eq_771 {
	word32 u0;
	 LPOVERLAPPED u1;
} Eq_771;

typedef word32 (Eq_791)(Eq_793);

typedef union Eq_793 {
	word32 u0;
	 HANDLE u1;
} Eq_793;

typedef void (Eq_807)(Eq_311, Eq_311, Eq_56);

typedef word32 (Eq_827)(Eq_829);

typedef union Eq_829 {
	word32 u0;
	 LPCSTR u1;
} Eq_829;

typedef Eq_311 (Eq_853)();

typedef word32 (Eq_859)(Eq_861);

typedef union Eq_861 {
	word32 u0;
	 HWND u1;
} Eq_861;

typedef struct Eq_891 {
	word32 dw0008;	// 8
} Eq_891;

typedef struct Eq_897 {
	word32 dw0008;	// 8
} Eq_897;

typedef Eq_311 Eq_904struct Eq_904 {
	int32 dwFFFFFFE0;	// FFFFFFE0
	int32 dwFFFFFFEC;	// FFFFFFEC
	int32 dwFFFFFFF0;	// FFFFFFF0
	Eq_311 tFFFFFFF4;	// FFFFFFF4
	ui32 dwFFFFFFF8;	// FFFFFFF8
} Eq_904;

typedef Eq_904 * (Eq_905)(word32 *, word32, Eq_311, up32);

typedef Eq_945 Eq_943struct Eq_943 {
	Eq_945 * ptr0018;	// 18
} Eq_943;

typedef Eq_1974 Eq_945struct Eq_945 {
	Eq_1974 * ptr0030;	// 30
} Eq_945;

typedef void (Eq_989)(Eq_311);

typedef void (Eq_1009)(word32);

typedef word32 (Eq_1037)(word32);

typedef void (Eq_1112)(word32);

typedef Eq_1160 Eq_1155struct Eq_1155 {
	Eq_1160 t0050;	// 50
	word32 dw00A0;	// A0
	word32 dw00A4;	// A4
} Eq_1155;

typedef union Eq_1160 {
	word32 u0;
	 SIZE_T u1;
} Eq_1160;

typedef Eq_56 Eq_1161Eq_1160 Eq_1161struct Eq_1161 {
	Eq_56 tFFFFFFB4;	// FFFFFFB4
	Eq_1160 tFFFFFFB8;	// FFFFFFB8
} Eq_1161;

typedef Eq_311 (Eq_1165)(Eq_56, Eq_1160, Eq_1169, Eq_56);

typedef union Eq_1169 {
	Eq_2132* u0;
	 DWORD u1;
} Eq_1169;

typedef  Eq_1215[]struct Eq_1215 {
	word32 dw0000;	// 0
	word32 dw0004;	// 4
	word16 a0008[];	// 8
} Eq_1215;

typedef Eq_1410 Eq_1305Eq_1160 Eq_1305struct Eq_1305 {
	word16 w0006;	// 6
	word16 w0014;	// 14
	Eq_1410 t003C;	// 3C
	Eq_1160 t0050;	// 50
} Eq_1305;

typedef Eq_1311 Eq_1311struct Eq_1311 {	// size: 40 28
	word32 dw000C;	// C
	word32 dw0010;	// 10
	word32 dw0014;	// 14
	Eq_1311 t0028;	// 28
} Eq_1311;

typedef Eq_1518 Eq_1354Eq_1718 Eq_1354Eq_56 Eq_1354Eq_56 Eq_1354Eq_1169 Eq_1354Eq_56 Eq_1354struct Eq_1354 {
	Eq_1518 tFFFFFF8C;	// FFFFFF8C
	Eq_1718 tFFFFFF90;	// FFFFFF90
	Eq_56 tFFFFFF94;	// FFFFFF94
	Eq_56 tFFFFFF98;	// FFFFFF98
	Eq_1169 tFFFFFF9C;	// FFFFFF9C
	Eq_56 tFFFFFFA0;	// FFFFFFA0
	word32 dwFFFFFFEC;	// FFFFFFEC
} Eq_1354;

typedef code Eq_1373Eq_56 Eq_1373Eq_56 Eq_1373struct Eq_1373 {
	code * ptr0028;	// 28
	Eq_56 t0034;	// 34
	Eq_56 t0050;	// 50
	word32 dw0080;	// 80
	word32 dw00A0;	// A0
	word32 dw00A4;	// A4
} Eq_1373;

typedef Eq_1378 Eq_1378struct Eq_1378 {	// size: 20 14
	word32 dw0000;	// 0
	word32 dw000C;	// C
	word32 dw0010;	// 10
	Eq_1378 t0014;	// 14
} Eq_1378;

typedef union Eq_1410 {
	int32 u0;
	uint32 u1;
} Eq_1410;

typedef union Eq_1431 {
	int32 u0;
	uint32 u1;
} Eq_1431;

typedef Eq_1451 Eq_1451struct Eq_1451 {	// size: 4 4
	word32 dw0000;	// 0
	Eq_1451 t0004;	// 4
} Eq_1451;

typedef Eq_1452 Eq_1452struct Eq_1452 {	// size: 4 4
	word32 dw0000;	// 0
	Eq_1452 t0004;	// 4
} Eq_1452;

typedef Eq_56 (Eq_1470)(Eq_1472);

typedef union Eq_1472 {
	word32 u0;
	 LPCSTR u1;
} Eq_1472;

typedef union Eq_1518 {
	word32 u0;
	 HANDLE u1;
} Eq_1518;

typedef Eq_1518 (Eq_1519)(Eq_1521, Eq_1522, Eq_1523, Eq_1524, Eq_56, Eq_1526);

typedef union Eq_1521 {
	word32 u0;
	 HANDLE u1;
} Eq_1521;

typedef union Eq_1522 {
	word32 u0;
	 LPSECURITY_ATTRIBUTES u1;
} Eq_1522;

typedef union Eq_1523 {
	word32 u0;
	 DWORD u1;
} Eq_1523;

typedef union Eq_1524 {
	word32 u0;
	 DWORD u1;
} Eq_1524;

typedef union Eq_1526 {
	word32 u0;
	 LPCSTR u1;
} Eq_1526;

typedef  Eq_1547[]struct Eq_1547 {
	word32 dw0000;	// 0
	word32 dw0004;	// 4
	word16 a0008[];	// 8
} Eq_1547;

typedef word32 (Eq_1633)(Eq_56, Eq_1636);

typedef union Eq_1636 {
	word32 u0;
	 LPCSTR u1;
} Eq_1636;

typedef union Eq_1718 {
	word32 u0;
	 DWORD u1;
} Eq_1718;

typedef Eq_311 (Eq_1725)(Eq_1518, Eq_1718, Eq_56, Eq_1730, Eq_1731, Eq_56);

typedef union Eq_1730 {
	word32 u0;
	 DWORD u1;
} Eq_1730;

typedef union Eq_1731 {
	word32 u0;
	 SIZE_T u1;
} Eq_1731;

typedef word32 (Eq_1785)(Eq_56);

typedef word32 (Eq_1809)(Eq_56, Eq_1731, Eq_1813);

typedef union Eq_1813 {
	word32 u0;
	 DWORD u1;
} Eq_1813;

typedef void (Eq_1820)(Eq_311);

typedef void (Eq_1826)(Eq_56, word32);

typedef Eq_1994 Eq_1969struct Eq_1969 {
	Eq_1994 * ptr000C;	// C
} Eq_1969;

typedef Eq_1969 Eq_1974struct Eq_1974 {
	word32 dw0008;	// 8
	Eq_1969 * ptr000C;	// C
} Eq_1974;

typedef Eq_1994 Eq_1994struct Eq_1994 {
	Eq_1994 * ptr0000;	// 0
	word32 dw0018;	// 18
	word32 dw001C;	// 1C
} Eq_1994;

typedef word32 (Eq_2063)(Eq_2065, Eq_2066, Eq_2067);

typedef union Eq_2065 {
	word32 u0;
	 HANDLE u1;
} Eq_2065;

typedef union Eq_2066 {
	word32 u0;
	 DWORD u1;
} Eq_2066;

typedef union Eq_2067 {
	word32 u0;
	 LPVOID u1;
} Eq_2067;

typedef Eq_2065 (Eq_2068)();

typedef word32 (Eq_2084)(Eq_2065, Eq_2087, Eq_2088);

typedef union Eq_2087 {
	word32 u0;
	 DWORD u1;
} Eq_2087;

typedef union Eq_2088 {
	word32 u0;
	 SIZE_T u1;
} Eq_2088;

typedef struct Eq_2111 {
	word32 dw003C;	// 3C
} Eq_2111;

typedef LONGLONGLONGLONGstruct tagRECT {
	LONG;	// 0
	LONG;	// 4
	LONG;	// 8
	LONG;	// C
} Eq_2114;

typedef DWORDLPVOIDBOOLstruct _SECURITY_ATTRIBUTES {
	DWORD;	// 0
	LPVOID;	// 4
	BOOL;	// 8
} Eq_2116;

typedef struct Eq_2117 Eq_2117;

typedef DWORDLPSTRLPSTRLPSTRDWORDDWORDDWORDDWORDDWORDDWORDDWORDDWORDWORDWORDLPBYTEHANDLEHANDLEHANDLEstruct _STARTUPINFOA {
	DWORD;	// 0
	LPSTR;	// 4
	LPSTR;	// 8
	LPSTR;	// C
	DWORD;	// 10
	DWORD;	// 14
	DWORD;	// 18
	DWORD;	// 1C
	DWORD;	// 20
	DWORD;	// 24
	DWORD;	// 28
	DWORD;	// 2C
	WORD;	// 30
	WORD;	// 32
	LPBYTE;	// 34
	HANDLE;	// 38
	HANDLE;	// 3C
	HANDLE;	// 40
} Eq_2126;

typedef LONGLONGLONGLONGstruct tagRECT {
	LONG;	// 0
	LONG;	// 4
	LONG;	// 8
	LONG;	// C
} Eq_2127;

typedef DWORDDWORDstruct struct_61 {
	DWORD;	// 0
	DWORD;	// 4
} Eq_2128;

typedef union Eq_2129 {
	 <anonymous> u0;
	 PVOID u1;
} Eq_2129;

typedef ULONG_PTRULONG_PTREq_2129 Eq_2130HANDLEstruct _OVERLAPPED {
	ULONG_PTR;	// 0
	ULONG_PTR;	// 4
	Eq_2129 t0008;	// 8
	HANDLE;	// 10
} Eq_2130;

typedef struct Eq_2132 {
	word32 dw003C;	// 3C
} Eq_2132;

typedef DWORDLPVOIDBOOLstruct _SECURITY_ATTRIBUTES {
	DWORD;	// 0
	LPVOID;	// 4
	BOOL;	// 8
} Eq_2133;

